[
  {
    "subreddit": "trans",
    "selftext": "Okay, so this was a while back when I first started public school again, and at the time, I passed pretty well, if I still looked a bit fem due to my round face. Well, I explained to the school that I was trans and asked about being able to possibly use gender neutral bathrooms/locker rooms, or if I could just use the men's. And considering this is a school in Texas, they told me no and that I couldn't even use the gender neutral ones because those were really meant for disabled kids/teachers. I shrugged and said \"alright if that's what you want me to do\" and started school.\n\nAnyway, gym class rolls around and I am stoked, I love exercising and running around like a feral rat child so gym has basically always been recess for me. The teacher sends us off to the locker room to get our lockers for the year and change our clothes. I had to stay behind for a second so I could ask how the locker combos worked (different from my old school) but after that I ran off to the locker rooms to change. It's very important that we note that I was one of the last people to enter.\n\nI walk in, and immediately, at least 3 girls yell, \"WRONG ROOM\" and \"GET OUT\" while covering themselves. I jumped and looked around cuz I assumed a guy had followed me in here, but nope, I was the only person near the door. I turn back around and a bunch of the girls are scrambling to cover themselves, others are glaring, and one of them is even starting to walk towards me to push me out.\n\nNow I'm confused, so I ask. \"Isn't this the girls locker room?\"\n\nThe girl walking towards me to push me out, scoffs. \"Yeah, GET OUT.\" and then she starts literally shoving me towards the door.\n\nIt then dawns on me what has happened, and I'm not sure whether to be happy, embarrassed, apologetic or what. But I quickly stammer out that I'm trans but afab so the school told me to use these locker rooms. This gives the girls some pause and the girl shoving me stops. But everyone still looks very skeptical and uneasy\n\nSo I do the first thing I can think of, I take off my shirt to show that I'm wearing a binder while very panickly saying \"see, I'm not a creepy dude I swear.\" \n\nAnyway, they all look uncomfortable, end up asking a few more questions before letting me use the locker rooms in peace. I think that's the end of it and I now have a funny story to tell my friends after school. \n\nIt was, in fact, not the end. \n\nTurns out a small group of those girls, in their words, \"really uncomfortable with a man in the locker rooms, even if he doesn't have a dick and balls.\" (I'm giggling at kicking my feet at this sentiment) so they all band together and complain to administration about how they are making the locker rooms uncomfortable for everyone by putting me in there.\n\nAdministration does not back down, basically saying in fancy terms that I was born a girl so I am girl and I was going to use the girls locker rooms. The group of girls are furious on my behalf, but it gets so much worse when they learn I was using the girl's bathrooms too.\n\nTurns out, there are some girls that don't take gym but do use the bathrooms often, that are also annoyed with my presence. They join up with the girls and continue hounding administration to just let me use the other bathrooms because literally everyone is uncomfortable with my presence. Keep in mind, I have no clue that they are doing this.\n\nAnyway, one girl apparently complains to her mom about this and her mom is furious that the school is sacrificing not only my comfort, but all the girls comfort just to uphold their bigotry. She storms into the school and yells at the principal, threatening to sue.\n\nWell, that's all it took for the principal to get on the intercoms, call me down to the office, slam the gender neutral locker room/ bathroom key in my hand, and say that I was allowed to use whatever bathroom I was comfortable using.\n\nMoral of the story, even if your transphobic, if someone passes well enough, don't try to shove them in with the wrong gender, it just makes everyone uncomfortable",
    "author_fullname": "t2_1adc5yhi5c",
    "title": "Accidently made a bunch of girls uncomfy",
    "upvote_ratio": 0.99,
    "ups": 5458,
    "created": 1734378536.0,
    "created_utc": 1734378536.0,
    "num_comments": 160,
    "author": "throw_awaymoney",
    "id": "1hfrqh8",
    "created_datetime": "2024-12-16 19:48:56",
    "title_clean": "accidently bunch girl uncomfy",
    "title_clean_pos": [
      "accidently ADV",
      "bunch NOUN",
      "girl NOUN",
      "uncomfy VERB"
    ],
    "selftext_clean": "start public school time pass pretty look bit fem round face explain school tran ask able possibly use gender neutral bathroomslocker room use men consider school texas tell use gender neutral one mean disabled kidsteacher shrug say want start school gym class roll stoke love exercise run feral rat child gym basically recess teacher send locker room locker year change clothe stay second ask locker combo work different old school run locker room change important note people enter walk immediately girl yell wrong room cover jump look assume guy follow person door turn bunch girl scramble cover glare start walk push confused ask girl locker room girl walk push scoff start literally shove door dawn happen sure happy embarrassed apologetic quickly stammer tran afab school tell use locker room give girl pause girl shove stop look skeptical uneasy thing think shirt wear binder panickly say creepy dude swear look uncomfortable end ask question let use locker room peace think end funny story tell friend school fact end turn small group girl word uncomfortable man locker room dick ball giggle kick foot sentiment band complain administration make locker room uncomfortable put administration basically say fancy term bear girl girl go use girl locker room group girl furious behalf get bad learn girl bathroom turn girl gym use bathroom annoy presence join girl continue hound administration let use bathroom literally uncomfortable presence mind clue girl apparently complain mom mom furious school sacrifice comfort girl comfort uphold bigotry storm school yell principal threaten sue take principal intercom office slam gender neutral locker room bathroom key hand allow use bathroom comfortable moral story transphobic pass try shove wrong gender make uncomfortable",
    "selftext_clean_pos": [
      "start VERB",
      "public ADJ",
      "school NOUN",
      "time NOUN",
      "pass VERB",
      "pretty ADV",
      "look VERB",
      "bit NOUN",
      "fem NOUN",
      "round NOUN",
      "face NOUN",
      "explain VERB",
      "school NOUN",
      "tran NOUN",
      "ask VERB",
      "able ADJ",
      "possibly ADV",
      "use VERB",
      "gender NOUN",
      "neutral ADJ",
      "bathroomslocker NOUN",
      "room NOUN",
      "use VERB",
      "men NOUN",
      "consider VERB",
      "school NOUN",
      "texas PROPN",
      "tell VERB",
      "use VERB",
      "gender NOUN",
      "neutral ADJ",
      "one NOUN",
      "mean VERB",
      "disabled ADJ",
      "kidsteacher NOUN",
      "shrug VERB",
      "say VERB",
      "want VERB",
      "start VERB",
      "school NOUN",
      "gym NOUN",
      "class NOUN",
      "roll VERB",
      "stoke VERB",
      "love VERB",
      "exercise VERB",
      "run VERB",
      "feral ADJ",
      "rat NOUN",
      "child NOUN",
      "gym NOUN",
      "basically ADV",
      "recess NOUN",
      "teacher NOUN",
      "send VERB",
      "locker NOUN",
      "room NOUN",
      "locker NOUN",
      "year NOUN",
      "change VERB",
      "clothe NOUN",
      "stay VERB",
      "second ADJ",
      "ask VERB",
      "locker NOUN",
      "combo NOUN",
      "work VERB",
      "different ADJ",
      "old ADJ",
      "school NOUN",
      "run VERB",
      "locker NOUN",
      "room NOUN",
      "change VERB",
      "important ADJ",
      "note VERB",
      "people NOUN",
      "enter VERB",
      "walk VERB",
      "immediately ADV",
      "girl NOUN",
      "yell VERB",
      "wrong ADJ",
      "room NOUN",
      "cover VERB",
      "jump VERB",
      "look VERB",
      "assume VERB",
      "guy NOUN",
      "follow VERB",
      "person NOUN",
      "door NOUN",
      "turn VERB",
      "bunch NOUN",
      "girl NOUN",
      "scramble VERB",
      "cover VERB",
      "glare VERB",
      "start VERB",
      "walk VERB",
      "push VERB",
      "confused ADJ",
      "ask VERB",
      "girl NOUN",
      "locker NOUN",
      "room NOUN",
      "girl NOUN",
      "walk VERB",
      "push VERB",
      "scoff NOUN",
      "start VERB",
      "literally ADV",
      "shove VERB",
      "door NOUN",
      "dawn VERB",
      "happen VERB",
      "sure ADJ",
      "happy ADJ",
      "embarrassed ADJ",
      "apologetic ADJ",
      "quickly ADV",
      "stammer VERB",
      "tran NOUN",
      "afab PROPN",
      "school NOUN",
      "tell VERB",
      "use VERB",
      "locker NOUN",
      "room NOUN",
      "give VERB",
      "girl NOUN",
      "pause NOUN",
      "girl NOUN",
      "shove VERB",
      "stop VERB",
      "look VERB",
      "skeptical ADJ",
      "uneasy ADJ",
      "thing NOUN",
      "think VERB",
      "shirt NOUN",
      "wear VERB",
      "binder NOUN",
      "panickly ADV",
      "say VERB",
      "creepy ADJ",
      "dude NOUN",
      "swear VERB",
      "look VERB",
      "uncomfortable ADJ",
      "end VERB",
      "ask VERB",
      "question NOUN",
      "let VERB",
      "use VERB",
      "locker NOUN",
      "room NOUN",
      "peace NOUN",
      "think VERB",
      "end NOUN",
      "funny ADJ",
      "story NOUN",
      "tell VERB",
      "friend NOUN",
      "school NOUN",
      "fact NOUN",
      "end NOUN",
      "turn VERB",
      "small ADJ",
      "group NOUN",
      "girl NOUN",
      "word NOUN",
      "uncomfortable ADJ",
      "man NOUN",
      "locker NOUN",
      "room NOUN",
      "dick NOUN",
      "ball NOUN",
      "giggle VERB",
      "kick VERB",
      "foot NOUN",
      "sentiment NOUN",
      "band VERB",
      "complain VERB",
      "administration NOUN",
      "make VERB",
      "locker NOUN",
      "room NOUN",
      "uncomfortable ADJ",
      "put VERB",
      "administration NOUN",
      "basically ADV",
      "say VERB",
      "fancy ADJ",
      "term NOUN",
      "bear VERB",
      "girl NOUN",
      "girl NOUN",
      "go VERB",
      "use VERB",
      "girl NOUN",
      "locker NOUN",
      "room NOUN",
      "group NOUN",
      "girl NOUN",
      "furious ADJ",
      "behalf NOUN",
      "get VERB",
      "bad ADJ",
      "learn VERB",
      "girl NOUN",
      "bathroom NOUN",
      "turn VERB",
      "girl NOUN",
      "gym NOUN",
      "use VERB",
      "bathroom NOUN",
      "annoy VERB",
      "presence NOUN",
      "join VERB",
      "girl NOUN",
      "continue VERB",
      "hound VERB",
      "administration NOUN",
      "let VERB",
      "use VERB",
      "bathroom NOUN",
      "literally ADV",
      "uncomfortable ADJ",
      "presence NOUN",
      "mind NOUN",
      "clue NOUN",
      "girl NOUN",
      "apparently ADV",
      "complain VERB",
      "mom NOUN",
      "mom NOUN",
      "furious ADJ",
      "school NOUN",
      "sacrifice VERB",
      "comfort NOUN",
      "girl NOUN",
      "comfort NOUN",
      "uphold VERB",
      "bigotry NOUN",
      "storm VERB",
      "school NOUN",
      "yell VERB",
      "principal NOUN",
      "threaten VERB",
      "sue VERB",
      "take VERB",
      "principal NOUN",
      "intercom NOUN",
      "office NOUN",
      "slam VERB",
      "gender NOUN",
      "neutral ADJ",
      "locker NOUN",
      "room NOUN",
      "bathroom NOUN",
      "key NOUN",
      "hand NOUN",
      "allow VERB",
      "use VERB",
      "bathroom NOUN",
      "comfortable ADJ",
      "moral ADJ",
      "story NOUN",
      "transphobic NOUN",
      "pass VERB",
      "try VERB",
      "shove VERB",
      "wrong ADJ",
      "gender NOUN",
      "make VERB",
      "uncomfortable ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "DO NOT TRY AND CHANGE YOUR GENDER MARKER IN TEXAS! my mom is an attorney and attended a CLE yesterday and anyone who applies for a gender marker change-in addition to  rejecting it, they are also having these applications sent to an email for unknown reasons :(",
    "author_fullname": "t2_7d6l4f13",
    "title": "ATTENTION ALL TEXAS TRANS PEOPLE!",
    "upvote_ratio": 0.99,
    "ups": 4323,
    "created": 1734283823.0,
    "created_utc": 1734283823.0,
    "num_comments": 160,
    "author": "satanicnoodlez",
    "id": "1hexkel",
    "created_datetime": "2024-12-15 17:30:23",
    "title_clean": "attention texas trans people",
    "title_clean_pos": [
      "attention NOUN",
      "texas PROPN",
      "trans PROPN",
      "people NOUN"
    ],
    "selftext_clean": "try change gender marker texas mom attorney attend cle yesterday apply gender marker changein addition reject have application send email unknown reason",
    "selftext_clean_pos": [
      "try VERB",
      "change VERB",
      "gender NOUN",
      "marker NOUN",
      "texas PROPN",
      "mom NOUN",
      "attorney NOUN",
      "attend VERB",
      "cle NOUN",
      "yesterday NOUN",
      "apply VERB",
      "gender NOUN",
      "marker NOUN",
      "changein NOUN",
      "addition NOUN",
      "reject VERB",
      "have VERB",
      "application NOUN",
      "send VERB",
      "email NOUN",
      "unknown ADJ",
      "reason NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "Me and my boyfriend were on a call, and he started saying \"The trans community sexualized the Blajah, that's a kids toy.\"  When I asked him how, he said \"I've seen people online use it as a sex toy.\"(How??)  I love him, but this is just ridiculous.\n\nUpdate: He is no longer my boyfriend.  I'm not dating a bigot.\n\nUpdate 2: electric boogaloo: This is my most popular post on reddit, and it's me breaking up with my boyfriend.  Is this how Taylor Swift feels?",
    "author_fullname": "N/A",
    "title": "How do I tell my boyfriend that the trans community didn't \"sexualize the Blajah\"?",
    "upvote_ratio": 0.99,
    "ups": 4286,
    "created": 1733643162.0,
    "created_utc": 1733643162.0,
    "num_comments": 275,
    "author": "N/A",
    "id": "1h9dob0",
    "created_datetime": "2024-12-08 07:32:42",
    "title_clean": "tell boyfriend trans community sexualize blajah",
    "title_clean_pos": [
      "tell VERB",
      "boyfriend NOUN",
      "trans PROPN",
      "community NOUN",
      "sexualize VERB",
      "blajah NOUN"
    ],
    "selftext_clean": "boyfriend start say trans community sexualize blajah kid toy ask say see people online use sex love ridiculous long boyfriend date bigot update electric boogaloo popular post reddit break boyfriend taylor swift feel",
    "selftext_clean_pos": [
      "boyfriend NOUN",
      "start VERB",
      "say VERB",
      "trans PROPN",
      "community NOUN",
      "sexualize VERB",
      "blajah NOUN",
      "kid NOUN",
      "toy NOUN",
      "ask VERB",
      "say VERB",
      "see VERB",
      "people NOUN",
      "online ADV",
      "use VERB",
      "sex NOUN",
      "love VERB",
      "ridiculous ADJ",
      "long ADV",
      "boyfriend NOUN",
      "date VERB",
      "bigot NOUN",
      "update PROPN",
      "electric PROPN",
      "boogaloo PROPN",
      "popular ADJ",
      "post NOUN",
      "reddit NOUN",
      "break VERB",
      "boyfriend NOUN",
      "taylor NOUN",
      "swift NOUN",
      "feel VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "So about three months ago i started taking estrogen (yay!! :D) but i kinda screwed up because i ran out after 3 months and missed a few weeks and went to my doctor and she was like “How’d you run out? It’s a 6 month supply.” So i said “Well it’s only 5 mL and I’ll supposed to take 1.5 mL right?”\n\nNO \nI was supposed to take 0.15 mL. So ive been taking 10 times as much estrogen and had the estrogen levels of a pregnant lady. On the bright side, i got A cups!\nThis is not me asking for medical advice btw, they just told me to wait a few weeks to start taking shots again",
    "author_fullname": "t2_jw7fiepu5",
    "title": "I accidentally took too much estrogen ",
    "upvote_ratio": 0.99,
    "ups": 3387,
    "created": 1734576786.0,
    "created_utc": 1734576786.0,
    "num_comments": 153,
    "author": "RosiePosie0518",
    "id": "1hhj27f",
    "created_datetime": "2024-12-19 02:53:06",
    "title_clean": "accidentally take estrogen",
    "title_clean_pos": [
      "accidentally ADV",
      "take VERB",
      "estrogen NOUN"
    ],
    "selftext_clean": "month ago start take estrogen yay kind screw run month miss week go doctor run month supply say ml suppose ml right suppose ml take time estrogen estrogen level pregnant lady bright get cup ask medical advice way tell wait week start take shot",
    "selftext_clean_pos": [
      "month NOUN",
      "ago ADV",
      "start VERB",
      "take VERB",
      "estrogen PROPN",
      "yay NOUN",
      "kind ADV",
      "screw VERB",
      "run VERB",
      "month NOUN",
      "miss VERB",
      "week NOUN",
      "go VERB",
      "doctor NOUN",
      "run VERB",
      "month NOUN",
      "supply NOUN",
      "say VERB",
      "ml PROPN",
      "suppose VERB",
      "ml PROPN",
      "right ADJ",
      "suppose VERB",
      "ml PROPN",
      "take VERB",
      "time NOUN",
      "estrogen NOUN",
      "estrogen PROPN",
      "level NOUN",
      "pregnant ADJ",
      "lady NOUN",
      "bright ADJ",
      "get VERB",
      "cup NOUN",
      "ask VERB",
      "medical ADJ",
      "advice NOUN",
      "way NOUN",
      "tell VERB",
      "wait VERB",
      "week NOUN",
      "start VERB",
      "take VERB",
      "shot NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "My Grandma has made a tradition out of personally making Christmas stockings for all of her children, grandchildren, and in-laws, each one with that person’s name and birthday on them. My stocking was made just a few months after I was born, and since then she has fixed it twice.\n\nThe first time was when I was almost too young to even remember it. We spent the holiday at my uncle’s house and his dog tore through my stocking trying to get the candy inside it. My grandma was able to fix it but it still has a bit of a scar and that actually ended up making my stocking much longer than any of my siblings. \n\nThe second time she fixed it was just this week. See, about 2.5 years ago I came out as transgender, and ever since then Christmas has been rough for me. Not just because it was always such a Christian centered holiday in my house, but also because my family and my stocking were no longer using the correct name. In the last year, I have been much more open about my identity with my family despite the fact that they are pretty much all conservative and Christian. Surprisingly, a lot of them have been pretty good about using the correct name. A couple of weeks ago, I asked my grandma if she would be able to change the name on my stocking, and to my surprise, she told me that she had already started doing exactly that! I’m so grateful that my family is doing their best to acknowledge and accept my identity. I know it hasn’t been easy for them, but it’s great to see that they’re making progress. ",
    "author_fullname": "t2_g1fu3957",
    "title": "My Grandmother has “fixed” my stocking twice now",
    "upvote_ratio": 1.0,
    "ups": 3339,
    "created": 1734926927.0,
    "created_utc": 1734926927.0,
    "num_comments": 68,
    "author": "Skylar1303",
    "id": "1hkfpl3",
    "created_datetime": "2024-12-23 04:08:47",
    "title_clean": "grandmother fix stocking twice",
    "title_clean_pos": [
      "grandmother NOUN",
      "fix VERB",
      "stocking NOUN",
      "twice ADV"
    ],
    "selftext_clean": "grandma tradition personally make christmas stocking child grandchild inlaw person birthday stocking month bear fix twice time young remember spend holiday uncle house dog tear stocking try candy grandma able fix bit scar actually end make stocking long sibling second time fix week year ago come transgender christmas rough christian center holiday house family stocking long correct year open identity family fact pretty conservative christian surprisingly lot pretty good correct couple week ago ask grandma able change stocking surprise tell start exactly grateful family good acknowledge accept identity know easy great make progress",
    "selftext_clean_pos": [
      "grandma NOUN",
      "tradition NOUN",
      "personally ADV",
      "make VERB",
      "christmas PROPN",
      "stocking NOUN",
      "child NOUN",
      "grandchild NOUN",
      "inlaw NOUN",
      "person NOUN",
      "birthday NOUN",
      "stocking NOUN",
      "month NOUN",
      "bear VERB",
      "fix VERB",
      "twice ADV",
      "time NOUN",
      "young ADJ",
      "remember VERB",
      "spend VERB",
      "holiday NOUN",
      "uncle NOUN",
      "house NOUN",
      "dog NOUN",
      "tear VERB",
      "stocking NOUN",
      "try VERB",
      "candy NOUN",
      "grandma NOUN",
      "able ADJ",
      "fix VERB",
      "bit NOUN",
      "scar NOUN",
      "actually ADV",
      "end VERB",
      "make VERB",
      "stocking NOUN",
      "long ADV",
      "sibling NOUN",
      "second ADJ",
      "time NOUN",
      "fix VERB",
      "week NOUN",
      "year NOUN",
      "ago ADV",
      "come VERB",
      "transgender NOUN",
      "christmas PROPN",
      "rough ADJ",
      "christian ADJ",
      "center VERB",
      "holiday NOUN",
      "house NOUN",
      "family NOUN",
      "stocking NOUN",
      "long ADV",
      "correct ADJ",
      "year NOUN",
      "open ADJ",
      "identity NOUN",
      "family NOUN",
      "fact NOUN",
      "pretty ADV",
      "conservative ADJ",
      "christian ADJ",
      "surprisingly ADV",
      "lot NOUN",
      "pretty ADV",
      "good ADJ",
      "correct ADJ",
      "couple NOUN",
      "week NOUN",
      "ago ADV",
      "ask VERB",
      "grandma NOUN",
      "able ADJ",
      "change VERB",
      "stocking NOUN",
      "surprise NOUN",
      "tell VERB",
      "start VERB",
      "exactly ADV",
      "grateful ADJ",
      "family NOUN",
      "good ADJ",
      "acknowledge VERB",
      "accept VERB",
      "identity NOUN",
      "know VERB",
      "easy ADJ",
      "great ADJ",
      "make VERB",
      "progress NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I started transitioning three years ago. I’ve been a girl for three years. \nI’m visiting my dad this week for Christmas. My dad is very Mormon. For the most part, he’s okay with the transition. He looks into the challenges facing the trans community and he tries to be supportive. \n\nBut over the last couple of days, every time he has used my pronouns, or talked about me to someone else, he has misgendered me. It almost feels intentional. \n\nTo help him remember, I decided to let him know that every time he “accidentally” misgenders me, I’m going to say the word “f*ck.” His Mormon brain hates that word. \nIt’s a normal part of my vocabulary at this point. But I always sensor myself when I’m around him out of respect. \n\nI said it three times to him tonight. It honestly felt really good. He flinches just like I do whenever he misgenders me. \n\nIt’s been three years. Time for him to try a little harder I think. ",
    "author_fullname": "t2_1eexnevahw",
    "title": "Found a cure for my dad misgendering me. I’m",
    "upvote_ratio": 0.99,
    "ups": 3320,
    "created": 1735283061.0,
    "created_utc": 1735283061.0,
    "num_comments": 104,
    "author": "laughing_crowXIII",
    "id": "1hn9dfn",
    "created_datetime": "2024-12-27 07:04:21",
    "title_clean": "find cure dad misgendere",
    "title_clean_pos": [
      "find VERB",
      "cure NOUN",
      "dad NOUN",
      "misgendere VERB"
    ],
    "selftext_clean": "start transition year ago girl year visit dad week christmas dad mormon okay transition look challenge face trans community try supportive couple day time pronoun talk misgendere feel intentional help remember decide let know time accidentally misgender go word fck mormon brain hate word normal vocabulary point sensor respect say time tonight honestly feel good flinch misgender year time try little hard think",
    "selftext_clean_pos": [
      "start VERB",
      "transition VERB",
      "year NOUN",
      "ago ADV",
      "girl NOUN",
      "year NOUN",
      "visit VERB",
      "dad NOUN",
      "week NOUN",
      "christmas PROPN",
      "dad NOUN",
      "mormon ADJ",
      "okay ADJ",
      "transition NOUN",
      "look VERB",
      "challenge NOUN",
      "face VERB",
      "trans PROPN",
      "community NOUN",
      "try VERB",
      "supportive ADJ",
      "couple NOUN",
      "day NOUN",
      "time NOUN",
      "pronoun NOUN",
      "talk VERB",
      "misgendere VERB",
      "feel VERB",
      "intentional ADJ",
      "help VERB",
      "remember VERB",
      "decide VERB",
      "let VERB",
      "know VERB",
      "time NOUN",
      "accidentally ADV",
      "misgender VERB",
      "go VERB",
      "word NOUN",
      "fck NOUN",
      "mormon ADJ",
      "brain NOUN",
      "hate VERB",
      "word NOUN",
      "normal ADJ",
      "vocabulary NOUN",
      "point NOUN",
      "sensor VERB",
      "respect NOUN",
      "say VERB",
      "time NOUN",
      "tonight NOUN",
      "honestly ADV",
      "feel VERB",
      "good ADJ",
      "flinch VERB",
      "misgender VERB",
      "year NOUN",
      "time NOUN",
      "try VERB",
      "little ADJ",
      "hard ADV",
      "think VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "“Gender equality doesn’t exist in this house.” -Mom\n\n“Male privilege doesn’t exist because I had to work my ass off to get where I am.” -Dad\n\n“If you really believed that there was no difference between men and women then you wouldn’t have transitioned, you would have just stayed a girl.” -Mom & Dad.\n\nIsn’t it cute? They tag team their ignorance🤗",
    "author_fullname": "t2_nb6n53ju2",
    "title": "Parents actually said this verbatim",
    "upvote_ratio": 0.99,
    "ups": 3164,
    "created": 1733958883.0,
    "created_utc": 1733958883.0,
    "num_comments": 143,
    "author": "Mad_Hatter25",
    "id": "1hc7163",
    "created_datetime": "2024-12-11 23:14:43",
    "title_clean": "parent actually say verbatim",
    "title_clean_pos": [
      "parent NOUN",
      "actually ADV",
      "say VERB",
      "verbatim NOUN"
    ],
    "selftext_clean": "gender equality exist house mom male privilege exist work ass dad believe difference man woman transition stay girl mom dad cute tag team ignorance",
    "selftext_clean_pos": [
      "gender NOUN",
      "equality NOUN",
      "exist VERB",
      "house NOUN",
      "mom NOUN",
      "male ADJ",
      "privilege NOUN",
      "exist VERB",
      "work VERB",
      "ass NOUN",
      "dad NOUN",
      "believe VERB",
      "difference NOUN",
      "man NOUN",
      "woman NOUN",
      "transition VERB",
      "stay VERB",
      "girl NOUN",
      "mom NOUN",
      "dad PROPN",
      "cute ADJ",
      "tag VERB",
      "team NOUN",
      "ignorance NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "So I was checking into a hotel in LA and the front desk lady asked for my name and ID. I told her my name is ‘preferred name’ and gave her my ID. She said “ma’am, I think you have your brother or husband’s passport”. I told her that “dead name” is my legal name and showed her my student ID showing my dead and preferred name. She then said “the person on the pick is a guy… you’re a woman so I’m confused…”. She walked away to her manager before I could say that I was trans. The manager told me that I needed to have ‘my’ id and not someone else’s. I told them that it was mine and that I am trans. They were shocked and proceeded to tell me that they had no idea and that I was very welcome there.\n\nAfter checking in, they apologized but I honestly thought it was flattering that I finally achieved being able to pass at that level.",
    "author_fullname": "t2_4srw084y",
    "title": "Checked into Hotel and was almost denied! (Positive)",
    "upvote_ratio": 0.99,
    "ups": 3050,
    "created": 1733795052.0,
    "created_utc": 1733795052.0,
    "num_comments": 70,
    "author": "karalwright",
    "id": "1haqii7",
    "created_datetime": "2024-12-10 01:44:12",
    "title_clean": "check hotel deny positive",
    "title_clean_pos": [
      "check VERB",
      "hotel NOUN",
      "deny VERB",
      "positive ADJ"
    ],
    "selftext_clean": "check hotel la desk lady ask tell preferred give say madam think brother husband passport tell dead legal show student d show dead preferred say person pick guy woman confused walk away manager trans manager tell need d else tell trans shock proceed tell idea welcome check apologize honestly think flattering finally achieve able pass level",
    "selftext_clean_pos": [
      "check VERB",
      "hotel NOUN",
      "la PROPN",
      "desk NOUN",
      "lady NOUN",
      "ask VERB",
      "tell VERB",
      "preferred ADJ",
      "give VERB",
      "say VERB",
      "madam NOUN",
      "think VERB",
      "brother NOUN",
      "husband NOUN",
      "passport VERB",
      "tell VERB",
      "dead ADJ",
      "legal ADJ",
      "show VERB",
      "student NOUN",
      "d NOUN",
      "show VERB",
      "dead ADJ",
      "preferred ADJ",
      "say VERB",
      "person NOUN",
      "pick NOUN",
      "guy NOUN",
      "woman NOUN",
      "confused ADJ",
      "walk VERB",
      "away ADV",
      "manager NOUN",
      "trans ADJ",
      "manager NOUN",
      "tell VERB",
      "need VERB",
      "d PROPN",
      "else VERB",
      "tell VERB",
      "trans ADJ",
      "shock VERB",
      "proceed VERB",
      "tell VERB",
      "idea NOUN",
      "welcome ADJ",
      "check VERB",
      "apologize VERB",
      "honestly ADV",
      "think VERB",
      "flattering ADJ",
      "finally ADV",
      "achieve VERB",
      "able ADJ",
      "pass VERB",
      "level NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "edit: for all the people calling my mom an insensitive coward, she’s been abused by him as a child and as an adult and he’s threatened my dad multiple times. the entire family is terrified of him.\n\nI live in a somewhat large house with my parents and siblings, and my grandparents live downstairs. my grandma is very kind and accepting, but grandpa is vehemently racist, homophobic, transphobic and extremely hateful. a bald, white 72yo man with a southern accent and hip dysplasia who loves to watch Alex Jones and Ben Shapiro. we were all having dinner together Wednesday night and I came downstairs from my room in a beautiful dress I bought earlier that day. he saw it and said that I should put some “boy clothes” on, yelling a bunch of slurs in the process. I started getting very upset with him and told him to stop, but he got up and backhanded me across the face, the force of which slammed me into the kitchen table and hurt my back. he called me more slurs and I went upstairs and sobbed. after everyone finished eating, my mom came in and said she thinks it’d be best for me if I just stopped being trans. I have just been wanting to die all week and I can’t take his bullying anymore. I don’t know what to do.",
    "author_fullname": "N/A",
    "title": "got slapped by my grandpa for “mouthing off “ (telling him he was being hurtful by purposefully calling me a boy)",
    "upvote_ratio": 0.99,
    "ups": 3046,
    "created": 1733583917.0,
    "created_utc": 1733583917.0,
    "num_comments": 296,
    "author": "N/A",
    "id": "1h8uccq",
    "created_datetime": "2024-12-07 15:05:17",
    "title_clean": "slap grandpa mouth tell hurtful purposefully call boy",
    "title_clean_pos": [
      "slap VERB",
      "grandpa NOUN",
      "mouth VERB",
      "tell VERB",
      "hurtful ADJ",
      "purposefully ADV",
      "call VERB",
      "boy NOUN"
    ],
    "selftext_clean": "edit people call mom insensitive coward abuse child adult threaten dad multiple time entire family terrify live somewhat large house parent sibling grandparent live downstairs grandma kind accept grandpa vehemently racist homophobic transphobic extremely hateful bald white yo man southern accent hip dysplasia love watch alex jones ben shapiro have dinner wednesday night come downstairs room beautiful dress buy early day see say boy clothe yell bunch slur process start get upset tell stop get backhand face force slam kitchen table hurt call slur go upstairs sob finish eat mom come say think good stop trans want die week bullying anymore know",
    "selftext_clean_pos": [
      "edit VERB",
      "people NOUN",
      "call VERB",
      "mom NOUN",
      "insensitive ADJ",
      "coward NOUN",
      "abuse VERB",
      "child NOUN",
      "adult NOUN",
      "threaten VERB",
      "dad NOUN",
      "multiple ADJ",
      "time NOUN",
      "entire ADJ",
      "family NOUN",
      "terrify VERB",
      "live VERB",
      "somewhat ADV",
      "large ADJ",
      "house NOUN",
      "parent NOUN",
      "sibling NOUN",
      "grandparent NOUN",
      "live VERB",
      "downstairs ADV",
      "grandma NOUN",
      "kind ADJ",
      "accept VERB",
      "grandpa NOUN",
      "vehemently ADV",
      "racist ADJ",
      "homophobic NOUN",
      "transphobic NOUN",
      "extremely ADV",
      "hateful ADJ",
      "bald ADJ",
      "white PROPN",
      "yo PROPN",
      "man NOUN",
      "southern ADJ",
      "accent NOUN",
      "hip NOUN",
      "dysplasia NOUN",
      "love VERB",
      "watch VERB",
      "alex PROPN",
      "jones PROPN",
      "ben PROPN",
      "shapiro PROPN",
      "have VERB",
      "dinner NOUN",
      "wednesday PROPN",
      "night NOUN",
      "come VERB",
      "downstairs ADV",
      "room NOUN",
      "beautiful ADJ",
      "dress NOUN",
      "buy VERB",
      "early ADV",
      "day NOUN",
      "see VERB",
      "say VERB",
      "boy NOUN",
      "clothe NOUN",
      "yell VERB",
      "bunch NOUN",
      "slur NOUN",
      "process NOUN",
      "start VERB",
      "get VERB",
      "upset ADJ",
      "tell VERB",
      "stop VERB",
      "get VERB",
      "backhand VERB",
      "face NOUN",
      "force NOUN",
      "slam VERB",
      "kitchen NOUN",
      "table NOUN",
      "hurt VERB",
      "call VERB",
      "slur NOUN",
      "go VERB",
      "upstairs ADV",
      "sob VERB",
      "finish VERB",
      "eat VERB",
      "mom NOUN",
      "come VERB",
      "say VERB",
      "think VERB",
      "good ADJ",
      "stop VERB",
      "trans PROPN",
      "want VERB",
      "die VERB",
      "week NOUN",
      "bullying NOUN",
      "anymore ADV",
      "know VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "For context, I’m ftm enby and basically changed my appearance overnight, during the pandemic. Anyway, there’s a convenience store (bodega) down the street that I always go to. It’s family owned so they all know me and I them, and the owner is always there as the cashier. The other day while I was paying, he asked why my “sister” hadn’t been around. I do have a younger sister but he meant someone else. Then it clicked lol he thought pre-transition me was another person. The best kind of unexpected compliment. Now I have a twin sister apparently haha ",
    "author_fullname": "t2_bfaqhipk",
    "title": "got told I “have a sister”",
    "upvote_ratio": 0.99,
    "ups": 2994,
    "created": 1734444071.0,
    "created_utc": 1734444071.0,
    "num_comments": 43,
    "author": "dekusfrogaddiction",
    "id": "1hgb90g",
    "created_datetime": "2024-12-17 14:01:11",
    "title_clean": "tell sister",
    "title_clean_pos": [
      "tell VERB",
      "sister NOUN"
    ],
    "selftext_clean": "context ftm enby basically change appearance overnight pandemic convenience store bodega street family own know owner cashier day pay ask sister young sister mean click lol think pretransition person good kind unexpected compliment twin sister apparently haha",
    "selftext_clean_pos": [
      "context NOUN",
      "ftm ADJ",
      "enby NOUN",
      "basically ADV",
      "change VERB",
      "appearance NOUN",
      "overnight ADV",
      "pandemic NOUN",
      "convenience NOUN",
      "store NOUN",
      "bodega NOUN",
      "street NOUN",
      "family NOUN",
      "own VERB",
      "know VERB",
      "owner NOUN",
      "cashier NOUN",
      "day NOUN",
      "pay VERB",
      "ask VERB",
      "sister NOUN",
      "young ADJ",
      "sister NOUN",
      "mean VERB",
      "click VERB",
      "lol NOUN",
      "think VERB",
      "pretransition NOUN",
      "person NOUN",
      "good ADJ",
      "kind NOUN",
      "unexpected ADJ",
      "compliment NOUN",
      "twin ADJ",
      "sister NOUN",
      "apparently ADV",
      "haha VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "Yesterday night I came home from work and was immediately sat down by my older brother mom and dad. and confronted about why I had women’s clothes in my room. they asked if I had a girl over which I denied and owned up to being trans and bisexual, that’s when all hell broke lose lol. A yelling match occurred for about 2ish hours they said stuff like “we didn’t raise you to be this way” “we’ll take you down to the gay bar and see if you’re really gay” my dad even threatened to kill me. That’s when my 2 older brothers came over and asked what was going on because my mom texted them. My parents made me come out to them on the spot, my brothers sided with me and argued with my parents saying that it’s ok the was that I was but it had no effect they only got more and more angry. Finally mom just said “you can’t be gay in my house” and told me to\nPack my things, my brothers helped me load up my stuff and now I’m staying at one of their houses I don’t really what to do or go from here I have a job so at least I can provide for myself. I think I’m gonna work toward getting my drivers license and see if I can find a cheap place to stay. Merry Christmas I guess. UPDATE: im back at my parents house for now they don’t accept me but wanna buy me in therapy im gonna play along for now get my drivers license and save up to rent a room thank you for all of your support it’s overwhelming I love you all <3",
    "author_fullname": "t2_my923qnl",
    "title": "I just got kicked out of my house last night ",
    "upvote_ratio": 1.0,
    "ups": 2912,
    "created": 1735150501.0,
    "created_utc": 1735150501.0,
    "num_comments": 108,
    "author": "k0dE83",
    "id": "1hm5ssj",
    "created_datetime": "2024-12-25 18:15:01",
    "title_clean": "kick house night",
    "title_clean_pos": [
      "kick VERB",
      "house NOUN",
      "night NOUN"
    ],
    "selftext_clean": "yesterday night come home work immediately sit old brother mom dad confront women clothe room ask girl deny own tran bisexual hell break lose lol yelling match occur ish hour say stuff raise way gay bar gay dad threaten kill old brother come ask go mom texte parent come spot brother side argue parent say ok effect get angry finally mom say gay house tell pack thing brother help load stuff stay house job provide think go work get driver license find cheap place stay merry christmas guess parent house accept want buy therapy go play driver license save rent room thank support overwhelming love",
    "selftext_clean_pos": [
      "yesterday NOUN",
      "night NOUN",
      "come VERB",
      "home ADV",
      "work NOUN",
      "immediately ADV",
      "sit VERB",
      "old ADJ",
      "brother NOUN",
      "mom NOUN",
      "dad NOUN",
      "confront VERB",
      "women NOUN",
      "clothe NOUN",
      "room NOUN",
      "ask VERB",
      "girl NOUN",
      "deny VERB",
      "own VERB",
      "tran NOUN",
      "bisexual ADJ",
      "hell NOUN",
      "break VERB",
      "lose VERB",
      "lol NOUN",
      "yelling NOUN",
      "match NOUN",
      "occur VERB",
      "ish ADJ",
      "hour NOUN",
      "say VERB",
      "stuff NOUN",
      "raise VERB",
      "way NOUN",
      "gay ADJ",
      "bar NOUN",
      "gay ADJ",
      "dad NOUN",
      "threaten VERB",
      "kill VERB",
      "old ADJ",
      "brother NOUN",
      "come VERB",
      "ask VERB",
      "go VERB",
      "mom NOUN",
      "texte VERB",
      "parent NOUN",
      "come VERB",
      "spot NOUN",
      "brother NOUN",
      "side VERB",
      "argue VERB",
      "parent NOUN",
      "say VERB",
      "ok ADJ",
      "effect NOUN",
      "get VERB",
      "angry ADJ",
      "finally ADV",
      "mom NOUN",
      "say VERB",
      "gay ADJ",
      "house NOUN",
      "tell VERB",
      "pack VERB",
      "thing NOUN",
      "brother NOUN",
      "help VERB",
      "load VERB",
      "stuff NOUN",
      "stay VERB",
      "house NOUN",
      "job NOUN",
      "provide VERB",
      "think VERB",
      "go VERB",
      "work VERB",
      "get VERB",
      "driver NOUN",
      "license VERB",
      "find VERB",
      "cheap ADJ",
      "place NOUN",
      "stay VERB",
      "merry PROPN",
      "christmas PROPN",
      "guess VERB",
      "parent NOUN",
      "house NOUN",
      "accept VERB",
      "want VERB",
      "buy VERB",
      "therapy NOUN",
      "go VERB",
      "play VERB",
      "driver NOUN",
      "license VERB",
      "save VERB",
      "rent VERB",
      "room NOUN",
      "thank VERB",
      "support NOUN",
      "overwhelming ADJ",
      "love VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "Ok so my parents hire a housecleaner, right? We chat, she's nice. Anyway, today I get back home after school and all my stiffed animals are in a corner of my bed, but my Blahaj is at the foot of my bed with a little note that essentially says that she supports me and asks if I have a different name. I recently put up a trans flag in my room (I never told her I was trans) and got a bunch of trans-themed gifts for my party. Apparently, she didn't know what the flag was so searched it up and then wrote the note. Just something that made me smile.",
    "author_fullname": "t2_n2dqi8go",
    "title": "So fu*king happy ahebdhajah",
    "upvote_ratio": 0.99,
    "ups": 2889,
    "created": 1734158159.0,
    "created_utc": 1734158159.0,
    "num_comments": 36,
    "author": "Background_Secret219",
    "id": "1hdwzgw",
    "created_datetime": "2024-12-14 06:35:59",
    "title_clean": "fuke happy ahebdhajah",
    "title_clean_pos": [
      "fuke VERB",
      "happy ADJ",
      "ahebdhajah NOUN"
    ],
    "selftext_clean": "parent hire housecleaner right chat nice today home school stiffed animal corner bed blahaj foot bed little note essentially say support ask different recently trans flag room tell tran get bunch transtheme gift party apparently know flag search write note smile",
    "selftext_clean_pos": [
      "parent NOUN",
      "hire VERB",
      "housecleaner NOUN",
      "right NOUN",
      "chat VERB",
      "nice ADJ",
      "today NOUN",
      "home ADV",
      "school NOUN",
      "stiffed ADJ",
      "animal NOUN",
      "corner NOUN",
      "bed NOUN",
      "blahaj NOUN",
      "foot NOUN",
      "bed NOUN",
      "little ADJ",
      "note NOUN",
      "essentially ADV",
      "say VERB",
      "support VERB",
      "ask VERB",
      "different ADJ",
      "recently ADV",
      "trans NOUN",
      "flag NOUN",
      "room NOUN",
      "tell VERB",
      "tran NOUN",
      "get VERB",
      "bunch NOUN",
      "transtheme VERB",
      "gift NOUN",
      "party NOUN",
      "apparently ADV",
      "know VERB",
      "flag NOUN",
      "search VERB",
      "write VERB",
      "note NOUN",
      "smile VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I'm not surprised, but mannn TERF island is getting worse and worse. I'm lucky to have been able to transition privately, but I fear the future so much for the trans youth who have to grow up here.\n\nKeep going strong kids, you're amazing and we'll always be here for you 💛 ",
    "author_fullname": "t2_eeccuxzz",
    "title": "puberty blockers are now banned in the uk for under 18s",
    "upvote_ratio": 0.98,
    "ups": 2866,
    "created": 1733934504.0,
    "created_utc": 1733934504.0,
    "num_comments": 267,
    "author": "tabbytheo",
    "id": "1hbxdci",
    "created_datetime": "2024-12-11 16:28:24",
    "title_clean": "puberty blocker ban uk s",
    "title_clean_pos": [
      "puberty NOUN",
      "blocker NOUN",
      "ban VERB",
      "uk PROPN",
      "s NOUN"
    ],
    "selftext_clean": "surprised mann terf island get bad bad lucky able transition privately fear future trans youth grow go strong kid amazing",
    "selftext_clean_pos": [
      "surprised ADJ",
      "mann NOUN",
      "terf PROPN",
      "island NOUN",
      "get VERB",
      "bad ADJ",
      "bad ADJ",
      "lucky ADJ",
      "able ADJ",
      "transition VERB",
      "privately ADV",
      "fear VERB",
      "future NOUN",
      "trans PROPN",
      "youth NOUN",
      "grow VERB",
      "go VERB",
      "strong ADJ",
      "kid NOUN",
      "amazing ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I tagged this nsfw for a reason but anyway a school shooting happened yesterday and people on twitter and tik tok are assuming the person was trans. Like I don’t get why people are doing that is it a reason just to hate on us because if so then they’re soo obsess with us like it’s not even funny.  Like i don’t get it. Like why the transphobia when you know it’s not a trans person. ",
    "author_fullname": "t2_mr6vjyq6",
    "title": "So people are using the recent shooting to blame us. ",
    "upvote_ratio": 0.99,
    "ups": 2823,
    "created": 1734485270.0,
    "created_utc": 1734485270.0,
    "num_comments": 196,
    "author": "Therealwalterwhite2",
    "id": "1hgqeoo",
    "created_datetime": "2024-12-18 01:27:50",
    "title_clean": "people recent shooting blame",
    "title_clean_pos": [
      "people NOUN",
      "recent ADJ",
      "shooting NOUN",
      "blame VERB"
    ],
    "selftext_clean": "tag nsfw reason school shooting happen yesterday people twitter tik tok assume person trans people reason hate soo obsess funny transphobia know trans person",
    "selftext_clean_pos": [
      "tag VERB",
      "nsfw NOUN",
      "reason NOUN",
      "school NOUN",
      "shooting NOUN",
      "happen VERB",
      "yesterday NOUN",
      "people NOUN",
      "twitter NOUN",
      "tik NOUN",
      "tok NOUN",
      "assume VERB",
      "person NOUN",
      "trans ADJ",
      "people NOUN",
      "reason NOUN",
      "hate VERB",
      "soo NOUN",
      "obsess NOUN",
      "funny ADJ",
      "transphobia NOUN",
      "know VERB",
      "trans PROPN",
      "person NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "\"When it comes to animated content for a younger audience, we recognize that many parents would prefer to discuss certain subjects with their children on their own terms and timeline.\" - Disney on why they removed a trans character from their show \n\nand here I was thinking Disney was better than this..\n\nDoing this just further alienates us, making negative propaganda more and more believeable. Imagine if they removed all the black people from a movie because \"it's a sensitive topic and parents should choose when to expose their children to it\" WE'RE LITERALLY JUST NORMAL PEOPLE \nWE ARE NOT A \"CERTAIN SUBJECT\" \nWE ARE JUST PEOPLE\nYOUR NEIGHBOUR \nTHE CASHIER\nYOUR FAMILY \nJUST ANOTHER MEMBER OF SOCIETY\nANYONE\n\nand yet they still do it, they still oppress us, just as they oppressed the other minorities before us, and just as they will oppress the next.\n\n( sorry for ranting I have no one else to speak to about this :/ )\n\nstay strong everyone we'll get through it eventually <3",
    "author_fullname": "t2_8nmqoc2g",
    "title": "This is just blatant transphobia.",
    "upvote_ratio": 0.97,
    "ups": 2785,
    "created": 1734538398.0,
    "created_utc": 1734538398.0,
    "num_comments": 211,
    "author": "catperson69420",
    "id": "1hh4zub",
    "created_datetime": "2024-12-18 16:13:18",
    "title_clean": "blatant transphobia",
    "title_clean_pos": [
      "blatant PROPN",
      "transphobia PROPN"
    ],
    "selftext_clean": "come animate content young audience recognize parent prefer discuss certain subject child term timeline disney remove trans character think disney well alienate make negative propaganda believeable imagine remove black people movie sensitive topic parent choose expose child literally normal people certain subject people neighbour cashier family member society oppress oppress minority oppress sorry rant speak stay strong eventually",
    "selftext_clean_pos": [
      "come VERB",
      "animate VERB",
      "content NOUN",
      "young ADJ",
      "audience NOUN",
      "recognize VERB",
      "parent NOUN",
      "prefer VERB",
      "discuss VERB",
      "certain ADJ",
      "subject NOUN",
      "child NOUN",
      "term NOUN",
      "timeline NOUN",
      "disney NOUN",
      "remove VERB",
      "trans PROPN",
      "character NOUN",
      "think VERB",
      "disney NOUN",
      "well ADJ",
      "alienate VERB",
      "make VERB",
      "negative ADJ",
      "propaganda NOUN",
      "believeable ADJ",
      "imagine VERB",
      "remove VERB",
      "black ADJ",
      "people NOUN",
      "movie NOUN",
      "sensitive ADJ",
      "topic NOUN",
      "parent NOUN",
      "choose VERB",
      "expose VERB",
      "child NOUN",
      "literally ADV",
      "normal ADJ",
      "people NOUN",
      "certain ADJ",
      "subject NOUN",
      "people NOUN",
      "neighbour NOUN",
      "cashier NOUN",
      "family NOUN",
      "member NOUN",
      "society NOUN",
      "oppress VERB",
      "oppress VERB",
      "minority NOUN",
      "oppress VERB",
      "sorry ADJ",
      "rant VERB",
      "speak VERB",
      "stay VERB",
      "strong ADJ",
      "eventually ADV"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "The place I work at has multiple buildings and I work in each from time to time for maybe 1-2 days at a time before returning to the main building I work in. This week, I’ve been working out of a building that’s not my main one all week. The restrooms have one sign each, the gender icon followed by “toilet.” This morning, someone added an additional sign under the women’s sign that says “women’s restroom!” in bold on printer paper. Ive used this bathroom before, just not as frequently as lately. I know what they’re implying but it made me laugh if that’s what they actually are trying to say. I’m still going to use it like I have been, all my ID cards say “female” on it. Curious if someone will actually say something to me so I can tell them to take it up with HR.\n\n\nEdit: I mentioned it to HR, it was removed shortly afterwards.",
    "author_fullname": "t2_9v50lyc",
    "title": "Someone added an extra sign on the women’s restroom this week.",
    "upvote_ratio": 0.99,
    "ups": 2494,
    "created": 1734008861.0,
    "created_utc": 1734008861.0,
    "num_comments": 87,
    "author": "misguidedmisfit",
    "id": "1hckpkq",
    "created_datetime": "2024-12-12 13:07:41",
    "title_clean": "add extra sign womens restroom week",
    "title_clean_pos": [
      "add VERB",
      "extra ADJ",
      "sign NOUN",
      "womens PROPN",
      "restroom NOUN",
      "week NOUN"
    ],
    "selftext_clean": "place work multiple building work time time maybe day time return main building work week work building main week restroom sign gender icon follow toilet morning add additional sign women sign say womens restroom bold printer paper bathroom frequently lately know imply laugh actually try go use d card female curious actually tell hr edit mention remove shortly",
    "selftext_clean_pos": [
      "place NOUN",
      "work VERB",
      "multiple ADJ",
      "building NOUN",
      "work VERB",
      "time NOUN",
      "time NOUN",
      "maybe ADJ",
      "day NOUN",
      "time NOUN",
      "return VERB",
      "main ADJ",
      "building NOUN",
      "work VERB",
      "week NOUN",
      "work VERB",
      "building NOUN",
      "main ADJ",
      "week NOUN",
      "restroom NOUN",
      "sign NOUN",
      "gender NOUN",
      "icon NOUN",
      "follow VERB",
      "toilet NOUN",
      "morning NOUN",
      "add VERB",
      "additional ADJ",
      "sign NOUN",
      "women NOUN",
      "sign NOUN",
      "say VERB",
      "womens PROPN",
      "restroom NOUN",
      "bold NOUN",
      "printer NOUN",
      "paper NOUN",
      "bathroom NOUN",
      "frequently ADV",
      "lately ADV",
      "know VERB",
      "imply VERB",
      "laugh VERB",
      "actually ADV",
      "try VERB",
      "go VERB",
      "use VERB",
      "d PROPN",
      "card NOUN",
      "female ADJ",
      "curious ADJ",
      "actually ADV",
      "tell VERB",
      "hr PROPN",
      "edit PROPN",
      "mention VERB",
      "remove VERB",
      "shortly ADV"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": " im not trans.\n\n\ni just fucking hate being female, wish i had a flat chest and NOT girl parts, wish everyday i was a cis guy, get so fucking happy anytime smne uses he/him pronouns on me, hope someone \"thinks I'm a boy\" when I go out irl, cringe anytime people use \"girl\" \"sister\" \"daughter\" etc. for me, and got a haircut to make me look more masculine.\n\nok maybe I am--",
    "author_fullname": "N/A",
    "title": "no, I'm not trans..",
    "upvote_ratio": 0.98,
    "ups": 2432,
    "created": 1734126938.0,
    "created_utc": 1734126938.0,
    "num_comments": 191,
    "author": "N/A",
    "id": "1hdnek9",
    "created_datetime": "2024-12-13 21:55:38",
    "title_clean": "tran",
    "title_clean_pos": [
      "tran NOUN"
    ],
    "selftext_clean": "trans fuck hate female wish flat chest girl part wish everyday cis guy fucking happy anytime smne use hehim pronoun hope think boy irl cringe anytime people use girl sister daughter get haircut look masculine maybe",
    "selftext_clean_pos": [
      "trans PROPN",
      "fuck VERB",
      "hate VERB",
      "female ADJ",
      "wish NOUN",
      "flat ADJ",
      "chest NOUN",
      "girl NOUN",
      "part NOUN",
      "wish VERB",
      "everyday NOUN",
      "cis NOUN",
      "guy NOUN",
      "fucking ADJ",
      "happy ADJ",
      "anytime NOUN",
      "smne NOUN",
      "use VERB",
      "hehim PROPN",
      "pronoun NOUN",
      "hope VERB",
      "think VERB",
      "boy NOUN",
      "irl NOUN",
      "cringe NOUN",
      "anytime ADJ",
      "people NOUN",
      "use VERB",
      "girl NOUN",
      "sister NOUN",
      "daughter NOUN",
      "get VERB",
      "haircut NOUN",
      "look VERB",
      "masculine NOUN",
      "maybe ADV"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I’m MTF. 😎🥳\n\nThat’s it. That’s the post. ",
    "author_fullname": "t2_bhgj0zbf",
    "title": "Got told “you’ll never be a real man!” Today.",
    "upvote_ratio": 0.99,
    "ups": 2354,
    "created": 1734829731.0,
    "created_utc": 1734829731.0,
    "num_comments": 51,
    "author": "virtualmentalist38",
    "id": "1hjnvn1",
    "created_datetime": "2024-12-22 01:08:51",
    "title_clean": "tell real man today",
    "title_clean_pos": [
      "tell VERB",
      "real ADJ",
      "man NOUN",
      "today NOUN"
    ],
    "selftext_clean": "mtf post",
    "selftext_clean_pos": [
      "mtf PROPN",
      "post NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "She was watching Bluey \n\n\"Hey, can I ask you a question?\"  \n  \nShe normally doesn't respond when she's watching TV, but today she looked up and said \"Sure.\"  \n  \nI asked \"Do you think I'm pretty?\"\n\nThere was this long pause with a look that her mother (my sister) has made since we were kids.  A look that says \"you already know the answer, why are you asking me?\"\n\n\"Yeah, you're pretty.  You're...*VERY* *pretty.*\"  And she dug back into her bag of Goldfish and went back to watching Bluey.\n\nAnyway, I almost cried.  I love her so much.  \n\nComrades, I'm officially pretty.",
    "author_fullname": "t2_4q9j4xbs",
    "title": "I asked my 8 year old niece \"Am I pretty?\"",
    "upvote_ratio": 0.98,
    "ups": 2317,
    "created": 1733806821.0,
    "created_utc": 1733806821.0,
    "num_comments": 83,
    "author": "evilrobotch",
    "id": "1hau6o0",
    "created_datetime": "2024-12-10 05:00:21",
    "title_clean": "ask year old niece pretty",
    "title_clean_pos": [
      "ask VERB",
      "year NOUN",
      "old ADJ",
      "niece NOUN",
      "pretty ADJ"
    ],
    "selftext_clean": "watch bluey ask question normally respond watch tv today look say sure ask think pretty long pause look mother sister kid look say know answer ask pretty pretty dig bag goldfish go watch bluey cry love comrade officially pretty",
    "selftext_clean_pos": [
      "watch VERB",
      "bluey NOUN",
      "ask VERB",
      "question NOUN",
      "normally ADV",
      "respond VERB",
      "watch VERB",
      "tv NOUN",
      "today NOUN",
      "look VERB",
      "say VERB",
      "sure ADJ",
      "ask VERB",
      "think VERB",
      "pretty ADJ",
      "long ADJ",
      "pause NOUN",
      "look NOUN",
      "mother NOUN",
      "sister NOUN",
      "kid NOUN",
      "look NOUN",
      "say VERB",
      "know VERB",
      "answer NOUN",
      "ask VERB",
      "pretty ADJ",
      "pretty ADV",
      "dig VERB",
      "bag NOUN",
      "goldfish PROPN",
      "go VERB",
      "watch VERB",
      "bluey NOUN",
      "cry VERB",
      "love VERB",
      "comrade NOUN",
      "officially ADV",
      "pretty ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "Just got my parent to finally both agree to not stop me from taking HRT, they are both transphobic or at least very very against the idea that I transition, so this is a huge milestone for me, gonna go set up an appointment with planned parenthood rn and get some, ask me anything btw\n\nEdit: based on more research and all of y’alls comments I’ve decided on Folx after all and made an appointment, I’ll let you guys know how it goes. \nAlso TYSM from everyone who are so positive it’s really made my week",
    "author_fullname": "t2_tq69bace9",
    "title": "OMG OMG ITS HAPPENING",
    "upvote_ratio": 0.97,
    "ups": 2319,
    "created": 1733668509.0,
    "created_utc": 1733668509.0,
    "num_comments": 221,
    "author": "Necessary-Snow-3685",
    "id": "1h9k3yj",
    "created_datetime": "2024-12-08 14:35:09",
    "title_clean": "omg happening",
    "title_clean_pos": [
      "omg NOUN",
      "happening NOUN"
    ],
    "selftext_clean": "get parent finally agree stop take hrt transphobic idea transition huge milestone go set appointment plan parenthood right ask way edit base research yall comment decide folx appointment let guy know go tysm positive week",
    "selftext_clean_pos": [
      "get VERB",
      "parent NOUN",
      "finally ADV",
      "agree VERB",
      "stop VERB",
      "take VERB",
      "hrt VERB",
      "transphobic ADJ",
      "idea NOUN",
      "transition VERB",
      "huge ADJ",
      "milestone NOUN",
      "go VERB",
      "set VERB",
      "appointment NOUN",
      "plan VERB",
      "parenthood NOUN",
      "right ADV",
      "ask VERB",
      "way NOUN",
      "edit NOUN",
      "base VERB",
      "research NOUN",
      "yall NOUN",
      "comment NOUN",
      "decide VERB",
      "folx NOUN",
      "appointment NOUN",
      "let VERB",
      "guy NOUN",
      "know VERB",
      "go VERB",
      "tysm VERB",
      "positive ADJ",
      "week NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I went to the mall today, to see my favorite person (we haven’t seen each other in months). He’s transmasc, 6 months younger than me, I think he passes extremely well. Anyways, I text my mom we’re about done and she calls me saying she’s in Hot Topic with the rest of my family and she deadass calls my friend a “she”. Twice. So what do I do? Of course I rat her ass out to my friend and he just shrugs it off. I’d be boiling but he calms me down, just a little. I honestly regret coming out to her but it also feels so good, cause I don’t have to hide my clothes* and what’s she gonna do about it?\n\nJust… ugh. She likes to pretend she’s supportive, but it’s really obvious she’s not.\n\n*I will still likely hide my clothes",
    "author_fullname": "t2_s4cp9vg5",
    "title": "You can knock that shit off right now.",
    "upvote_ratio": 0.98,
    "ups": 2273,
    "created": 1735501378.0,
    "created_utc": 1735501378.0,
    "num_comments": 78,
    "author": "SunshineZeus446",
    "id": "1hp3ysi",
    "created_datetime": "2024-12-29 19:42:58",
    "title_clean": "knock shit right",
    "title_clean_pos": [
      "knock VERB",
      "shit VERB",
      "right ADV"
    ],
    "selftext_clean": "go mall today favorite person see month transmasc month young think pass extremely text mom call say hot topic rest family deadass call friend twice course rat ass friend shrug boil calm little honestly regret come feel good hide clothe go ugh like pretend supportive obvious likely hide clothe",
    "selftext_clean_pos": [
      "go VERB",
      "mall NOUN",
      "today NOUN",
      "favorite ADJ",
      "person NOUN",
      "see VERB",
      "month NOUN",
      "transmasc NOUN",
      "month NOUN",
      "young ADJ",
      "think VERB",
      "pass VERB",
      "extremely ADV",
      "text VERB",
      "mom NOUN",
      "call VERB",
      "say VERB",
      "hot ADJ",
      "topic NOUN",
      "rest NOUN",
      "family NOUN",
      "deadass VERB",
      "call VERB",
      "friend NOUN",
      "twice ADV",
      "course ADV",
      "rat VERB",
      "ass NOUN",
      "friend NOUN",
      "shrug VERB",
      "boil VERB",
      "calm VERB",
      "little ADJ",
      "honestly ADV",
      "regret VERB",
      "come VERB",
      "feel VERB",
      "good ADJ",
      "hide VERB",
      "clothe NOUN",
      "go VERB",
      "ugh PROPN",
      "like VERB",
      "pretend VERB",
      "supportive ADJ",
      "obvious ADJ",
      "likely ADV",
      "hide VERB",
      "clothe NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "This Christmas I went to my girlfriend's family gathering, and while she says they would be fine with me presenting as a girl, I don't feel ready for that yet, so I just went with my standard boymode, a football jersey, regular boy pants and sneakers, plus a santa hat for the holiday spirit, no makeup, no earrings, nothing. When I got there, I buzzed the intercom and told the doorman what I was there for, to which he asked my name and for obvious reasons I gave him my deadname. He asked my name once again, visibly confused, and I told him my deadname again, then I overheard my girlfriend's voice through the intercom saying \"yeah, that's right, either one is fine\". He finally let me in and proceeded to call me by my real name, I even tripped in shock and we all laughed about it. My girlfriend told me afterwards that he asked her if she was there waiting for \"Mrs Claus there\", referring to me (remember the santa hat?), and she told him \"yeah, that's my girlfriend Mel\".\n\nSuch a silly interaction but it made my night.",
    "author_fullname": "t2_l8sv755",
    "title": "malefailed for the first time this Christmas ",
    "upvote_ratio": 0.99,
    "ups": 2252,
    "created": 1735331924.0,
    "created_utc": 1735331924.0,
    "num_comments": 20,
    "author": "SkyBlueSneakers",
    "id": "1hnobrm",
    "created_datetime": "2024-12-27 20:38:44",
    "title_clean": "malefaile time christmas",
    "title_clean_pos": [
      "malefaile VERB",
      "time NOUN",
      "christmas PROPN"
    ],
    "selftext_clean": "christmas go girlfriend family gathering say fine present girl feel ready go standard boymode football jersey regular boy pant sneaker santa hat holiday spirit makeup earring get buzz intercom tell doorman ask obvious reason give deadname ask visibly confused tell deadname overheard girlfriend voice intercom say right fine finally let proceed real trip shock laugh girlfriend tell ask wait mrs claus refer remember santa hat tell girlfriend mel silly interaction night",
    "selftext_clean_pos": [
      "christmas PROPN",
      "go VERB",
      "girlfriend NOUN",
      "family NOUN",
      "gathering NOUN",
      "say VERB",
      "fine ADJ",
      "present VERB",
      "girl NOUN",
      "feel VERB",
      "ready ADJ",
      "go VERB",
      "standard ADJ",
      "boymode NOUN",
      "football NOUN",
      "jersey NOUN",
      "regular ADJ",
      "boy NOUN",
      "pant NOUN",
      "sneaker NOUN",
      "santa NOUN",
      "hat NOUN",
      "holiday NOUN",
      "spirit NOUN",
      "makeup NOUN",
      "earring NOUN",
      "get VERB",
      "buzz VERB",
      "intercom NOUN",
      "tell VERB",
      "doorman NOUN",
      "ask VERB",
      "obvious ADJ",
      "reason NOUN",
      "give VERB",
      "deadname NOUN",
      "ask VERB",
      "visibly ADV",
      "confused ADJ",
      "tell VERB",
      "deadname NOUN",
      "overheard VERB",
      "girlfriend NOUN",
      "voice NOUN",
      "intercom NOUN",
      "say VERB",
      "right ADJ",
      "fine ADJ",
      "finally ADV",
      "let VERB",
      "proceed VERB",
      "real ADJ",
      "trip VERB",
      "shock NOUN",
      "laugh VERB",
      "girlfriend NOUN",
      "tell VERB",
      "ask VERB",
      "wait VERB",
      "mrs PROPN",
      "claus PROPN",
      "refer VERB",
      "remember VERB",
      "santa NOUN",
      "hat NOUN",
      "tell VERB",
      "girlfriend NOUN",
      "mel PROPN",
      "silly ADJ",
      "interaction NOUN",
      "night NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "seriously at my limit..\n\n\nso im a trans guy and i start getting symptoms of BV right? and im like ohh i really dont wanna explain this face to face with a doctor because that would make me incredibly dysphoric. so im looking at these websites where you fill in a form, its reviewed by a doctor then they mail the medication to you. perfect!\n\nexcept i have a very obviously male name and i think while signing up to one of these websites i made my title mr or something. so i get a message back saying \"we cannot prescribe this to men\" with a refund. holyy shit. theres an option for transgender patients to reply with their agab and stuff but it says it takes 2-3 days to get a response!!! im tryna get this over and done with quickly fuck that.\n\nso i try a different website and hey this ones cheaper anyway. the form specifically asks for \"birth sex\" so im hoping this clarifies things from the start. well guess what?? i get the message \"your name and photo id suggest you are male,\" denied prescription + refund, AND THEY MANUALLY CHANGE MY BIRTH SEX TO MALE. i have just been RAMAB, Retroactively Assigned Male at Birth. i mean seriously what is even the point of calling it \"birth sex\" at that point. just proves cis people are using agab terms as a stand in for man and woman, lol, lmao even.\n\nso im now waiting for the people who can always tell to respond to my message, which i wrote resisting the urge to just type I HAVE A VAGINA and hit send. after all this hassle i might aswell have just told my gp. i dont know if i should laugh or cry.\n\n\n\nUPDATE: so the second pharmacy got back to me and approved the prescription. thank god. my birth gender has been updated on their system for a second time, waddayaknow i was right about it the first time. could have made their system trans friendly from the start but my medication is on its way. thankyou everyone for all the support and advice!!! what a moment.",
    "author_fullname": "t2_khpc0ad9",
    "title": "just got denied healthcare cause i pass too good",
    "upvote_ratio": 0.99,
    "ups": 2197,
    "created": 1733772832.0,
    "created_utc": 1733772832.0,
    "num_comments": 50,
    "author": "lava_bastion",
    "id": "1hai6av",
    "created_datetime": "2024-12-09 19:33:52",
    "title_clean": "deny healthcare pass good",
    "title_clean_pos": [
      "deny VERB",
      "healthcare NOUN",
      "pass VERB",
      "good ADJ"
    ],
    "selftext_clean": "seriously limit trans guy start get symptom bv right ohh want explain face face doctor incredibly dysphoric look website fill form review doctor mail medication perfect obviously male think sign website title mr message say prescribe man refund holyy shit option transgender patient reply agab stuff say take day response tryna quickly fuck try different website one cheap form specifically ask birth sex hope clarify thing start guess message photo d suggest male deny prescription refund manually change birth sex male ramab retroactively assign male birth mean seriously point call birth sex point prove cis people agab term stand man woman lol lmao wait people tell respond message write resist urge type vagina hit send hassle aswell tell gp know laugh cry update second pharmacy get approve prescription thank god birth gender update system second time waddayaknow right time system tran friendly start medication way support advice moment",
    "selftext_clean_pos": [
      "seriously ADV",
      "limit NOUN",
      "trans PROPN",
      "guy NOUN",
      "start VERB",
      "get VERB",
      "symptom NOUN",
      "bv PROPN",
      "right NOUN",
      "ohh NOUN",
      "want VERB",
      "explain VERB",
      "face NOUN",
      "face VERB",
      "doctor NOUN",
      "incredibly ADV",
      "dysphoric ADJ",
      "look VERB",
      "website NOUN",
      "fill VERB",
      "form NOUN",
      "review VERB",
      "doctor NOUN",
      "mail VERB",
      "medication NOUN",
      "perfect ADJ",
      "obviously ADV",
      "male ADJ",
      "think VERB",
      "sign VERB",
      "website NOUN",
      "title NOUN",
      "mr PROPN",
      "message NOUN",
      "say VERB",
      "prescribe VERB",
      "man NOUN",
      "refund NOUN",
      "holyy ADJ",
      "shit NOUN",
      "option NOUN",
      "transgender NOUN",
      "patient NOUN",
      "reply VERB",
      "agab NOUN",
      "stuff NOUN",
      "say VERB",
      "take VERB",
      "day NOUN",
      "response NOUN",
      "tryna ADJ",
      "quickly ADV",
      "fuck NOUN",
      "try VERB",
      "different ADJ",
      "website NOUN",
      "one NOUN",
      "cheap ADJ",
      "form NOUN",
      "specifically ADV",
      "ask VERB",
      "birth NOUN",
      "sex NOUN",
      "hope VERB",
      "clarify VERB",
      "thing NOUN",
      "start NOUN",
      "guess VERB",
      "message NOUN",
      "photo NOUN",
      "d PROPN",
      "suggest VERB",
      "male ADJ",
      "deny VERB",
      "prescription NOUN",
      "refund NOUN",
      "manually ADV",
      "change VERB",
      "birth NOUN",
      "sex NOUN",
      "male NOUN",
      "ramab PROPN",
      "retroactively ADV",
      "assign VERB",
      "male NOUN",
      "birth NOUN",
      "mean VERB",
      "seriously ADV",
      "point NOUN",
      "call VERB",
      "birth NOUN",
      "sex NOUN",
      "point NOUN",
      "prove VERB",
      "cis NOUN",
      "people NOUN",
      "agab ADJ",
      "term NOUN",
      "stand NOUN",
      "man NOUN",
      "woman NOUN",
      "lol PROPN",
      "lmao PROPN",
      "wait VERB",
      "people NOUN",
      "tell VERB",
      "respond VERB",
      "message NOUN",
      "write VERB",
      "resist VERB",
      "urge NOUN",
      "type VERB",
      "vagina ADJ",
      "hit VERB",
      "send NOUN",
      "hassle NOUN",
      "aswell VERB",
      "tell VERB",
      "gp NOUN",
      "know VERB",
      "laugh VERB",
      "cry VERB",
      "update VERB",
      "second ADJ",
      "pharmacy NOUN",
      "get VERB",
      "approve VERB",
      "prescription NOUN",
      "thank VERB",
      "god PROPN",
      "birth NOUN",
      "gender NOUN",
      "update VERB",
      "system NOUN",
      "second ADJ",
      "time NOUN",
      "waddayaknow NOUN",
      "right ADJ",
      "time NOUN",
      "system NOUN",
      "tran NOUN",
      "friendly ADJ",
      "start NOUN",
      "medication NOUN",
      "way NOUN",
      "support NOUN",
      "advice NOUN",
      "moment NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "While leaving the self checkout at Walmart, the lady, working there, says \"Have a nice day sir, and Happy New year.\". My response to that was \"You too Mr.\"\n\nShe didn't seem too impressed.  LoL,  correcting me as I continued walking out the door.\n\nEDIT:  for context, I was dressed fem.  I was wearing a light pink woman's CK coat, a frilly, floral peasant top and stretchy jeans leggings,, pink Under Armour shoes, and I had makeup on.  I usually unzip my coat while indoors, so my top was visible.",
    "author_fullname": "t2_80xcvwdg",
    "title": "Lady at Walmart sir'd me. My response...",
    "upvote_ratio": 0.97,
    "ups": 2187,
    "created": 1735623738.0,
    "created_utc": 1735623738.0,
    "num_comments": 134,
    "author": "Ok-Wrongdoer-2179",
    "id": "1hq81e5",
    "created_datetime": "2024-12-31 05:42:18",
    "title_clean": "lady walmart sird response",
    "title_clean_pos": [
      "lady PROPN",
      "walmart PROPN",
      "sird PROPN",
      "response NOUN"
    ],
    "selftext_clean": "leave self checkout walmart lady work say nice day sir happy new year response mr impressed lol correct walk door edit context dress fem wear light pink womans ck coat frilly floral peasant stretchy jean legging pink armour shoe makeup usually unzip coat indoor visible",
    "selftext_clean_pos": [
      "leave VERB",
      "self NOUN",
      "checkout NOUN",
      "walmart PROPN",
      "lady NOUN",
      "work VERB",
      "say VERB",
      "nice ADJ",
      "day NOUN",
      "sir NOUN",
      "happy ADJ",
      "new ADJ",
      "year NOUN",
      "response NOUN",
      "mr PROPN",
      "impressed ADJ",
      "lol NOUN",
      "correct VERB",
      "walk VERB",
      "door NOUN",
      "edit VERB",
      "context NOUN",
      "dress VERB",
      "fem NOUN",
      "wear VERB",
      "light ADJ",
      "pink ADJ",
      "womans PROPN",
      "ck PROPN",
      "coat NOUN",
      "frilly ADV",
      "floral ADJ",
      "peasant NOUN",
      "stretchy ADJ",
      "jean NOUN",
      "legging NOUN",
      "pink VERB",
      "armour NOUN",
      "shoe NOUN",
      "makeup NOUN",
      "usually ADV",
      "unzip VERB",
      "coat NOUN",
      "indoor NOUN",
      "visible ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "Amping myself and fighting the anxiety for over 6 months. I always am in uniform (masc). A few folks probably thought I was some NB flavor. \n\nI showed up in a full length flowing dress, corset, painted nails, makeup, and my hair styled. Oh, and NOT wearing an unpadded compression bra for once. \n\nHoly crap the amount of support I got! Lots of compliments on my dress, and a lot of those \"I am calling you gorgeous/beautiful as a way of saying I support you\". \n\nSad thing was there was a large chunk of folks that normally say hello to me at similar functions or day to day, especially the higher ups, That pretended I didn't exist. No eye contact, no saying hello, nothing.\n\nWent worlds better than expected. Hopefully it keeps being positive and I don't get any weirdness from folks when I come back Monday. \n\nI am celebrating, and still having a hard time believing I did it!",
    "author_fullname": "t2_8dj0x9pw",
    "title": "I went to my company's holiday party in girl mode....",
    "upvote_ratio": 0.99,
    "ups": 2136,
    "created": 1734231861.0,
    "created_utc": 1734231861.0,
    "num_comments": 77,
    "author": "UpUpAndAwayYall",
    "id": "1hejhng",
    "created_datetime": "2024-12-15 03:04:21",
    "title_clean": "go company holiday party girl mode",
    "title_clean_pos": [
      "go VERB",
      "company NOUN",
      "holiday NOUN",
      "party NOUN",
      "girl NOUN",
      "mode NOUN"
    ],
    "selftext_clean": "ampe fight anxiety month uniform masc folk probably think nb flavor show length flow dress corset paint nail makeup hair style wear unpadded compression bra holy crap support get lot compliment dress lot call gorgeousbeautiful way say support sad thing large chunk folk normally similar function day day especially high up pretend exist eye contact say go world well expect hopefully keep positive weirdness folk come monday celebrate have hard time believe",
    "selftext_clean_pos": [
      "ampe VERB",
      "fight VERB",
      "anxiety NOUN",
      "month NOUN",
      "uniform PROPN",
      "masc PROPN",
      "folk NOUN",
      "probably ADV",
      "think VERB",
      "nb ADJ",
      "flavor NOUN",
      "show VERB",
      "length NOUN",
      "flow VERB",
      "dress NOUN",
      "corset NOUN",
      "paint VERB",
      "nail NOUN",
      "makeup NOUN",
      "hair NOUN",
      "style VERB",
      "wear VERB",
      "unpadded ADJ",
      "compression NOUN",
      "bra NOUN",
      "holy PROPN",
      "crap VERB",
      "support NOUN",
      "get VERB",
      "lot NOUN",
      "compliment NOUN",
      "dress NOUN",
      "lot NOUN",
      "call VERB",
      "gorgeousbeautiful ADJ",
      "way NOUN",
      "say VERB",
      "support VERB",
      "sad ADJ",
      "thing NOUN",
      "large ADJ",
      "chunk NOUN",
      "folk NOUN",
      "normally ADV",
      "similar ADJ",
      "function NOUN",
      "day NOUN",
      "day NOUN",
      "especially ADV",
      "high ADJ",
      "up NOUN",
      "pretend VERB",
      "exist VERB",
      "eye NOUN",
      "contact NOUN",
      "say VERB",
      "go VERB",
      "world NOUN",
      "well ADV",
      "expect VERB",
      "hopefully ADV",
      "keep VERB",
      "positive ADJ",
      "weirdness NOUN",
      "folk NOUN",
      "come VERB",
      "monday PROPN",
      "celebrate VERB",
      "have VERB",
      "hard ADJ",
      "time NOUN",
      "believe VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I reached out to my stepfather who's been with my mom ever since I was 8, asking him if we could bury the hatchet and maybe talk things out before the holidays. But right away he refused and said he'd keep on using my dead name. So I told him I would not answer to that name, then he started going on about the woke ppl. I told him he was being immature, then he said I didnt accomplish enough to talk about maturity since I'm already 27 and still in school. And that I was hurting everyone around me by affirming myself as a trans woman.\n\nSo I snapped. I went in on him and spat out venom that I had been holding on to for all these years, telling him just how insecure he acted for all these years. And then I blocked him\n\nAnd I'm wondering, did I sink to his level? Did I explode too much. I wanted to just burn that fucking bridge and be done with that sorry bastard.",
    "author_fullname": "t2_ux87nfmp",
    "title": "I snapped.",
    "upvote_ratio": 0.98,
    "ups": 2103,
    "created": 1733549979.0,
    "created_utc": 1733549979.0,
    "num_comments": 248,
    "author": "IdunnowhotfIam",
    "id": "1h8lqz2",
    "created_datetime": "2024-12-07 05:39:39",
    "title_clean": "snap",
    "title_clean_pos": [
      "snap VERB"
    ],
    "selftext_clean": "reach stepfather mom ask bury hatchet maybe talk thing holiday right away refuse say dead tell answer start go woke people tell immature say accomplish talk maturity school hurt affirm trans woman snap go spit venom hold year tell insecure act year block wonder sink level explode want burn fucking bridge sorry bastard",
    "selftext_clean_pos": [
      "reach VERB",
      "stepfather NOUN",
      "mom NOUN",
      "ask VERB",
      "bury VERB",
      "hatchet NOUN",
      "maybe ADV",
      "talk VERB",
      "thing NOUN",
      "holiday NOUN",
      "right ADV",
      "away ADV",
      "refuse VERB",
      "say VERB",
      "dead ADJ",
      "tell VERB",
      "answer VERB",
      "start VERB",
      "go VERB",
      "woke ADJ",
      "people NOUN",
      "tell VERB",
      "immature ADJ",
      "say VERB",
      "accomplish VERB",
      "talk VERB",
      "maturity NOUN",
      "school NOUN",
      "hurt VERB",
      "affirm VERB",
      "trans PROPN",
      "woman NOUN",
      "snap VERB",
      "go VERB",
      "spit VERB",
      "venom NOUN",
      "hold VERB",
      "year NOUN",
      "tell VERB",
      "insecure ADJ",
      "act VERB",
      "year NOUN",
      "block VERB",
      "wonder VERB",
      "sink VERB",
      "level NOUN",
      "explode VERB",
      "want VERB",
      "burn VERB",
      "fucking ADJ",
      "bridge NOUN",
      "sorry ADJ",
      "bastard NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "So about a 7 months ago I told my boss about me being trans as it could affect my work output.\nSo anyway, a few nights ago he “jokingly” called another co worker a “tranny” and told her to come over to speak to him.\nThis was right in-front of me and everyone knows that I’m trans where I work.\nWhat makes it worse is that another co worker chimed in saying “if you’re a tranny that makes your pregnancy a miracle”.\n\nI don’t know what to do? Do I report them to hr or any higher ups for this? Or do I just try and forget about it? ",
    "author_fullname": "t2_stjks6i9",
    "title": "My boss using some “fun” wording ",
    "upvote_ratio": 0.99,
    "ups": 1954,
    "created": 1733459197.0,
    "created_utc": 1733459197.0,
    "num_comments": 44,
    "author": "PritchyKunn",
    "id": "1h7t3tq",
    "created_datetime": "2024-12-06 04:26:37",
    "title_clean": "boss fun wording",
    "title_clean_pos": [
      "boss NOUN",
      "fun NOUN",
      "wording NOUN"
    ],
    "selftext_clean": "month ago tell boss tran affect work output night ago jokingly call co worker tranny tell come speak right infront know tran work make bad co worker chime say tranny make pregnancy miracle know report high up try forget",
    "selftext_clean_pos": [
      "month NOUN",
      "ago ADV",
      "tell VERB",
      "boss NOUN",
      "tran NOUN",
      "affect VERB",
      "work NOUN",
      "output NOUN",
      "night NOUN",
      "ago ADV",
      "jokingly ADV",
      "call VERB",
      "co NOUN",
      "worker NOUN",
      "tranny NOUN",
      "tell VERB",
      "come VERB",
      "speak VERB",
      "right ADV",
      "infront ADV",
      "know VERB",
      "tran NOUN",
      "work VERB",
      "make VERB",
      "bad ADJ",
      "co NOUN",
      "worker NOUN",
      "chime VERB",
      "say VERB",
      "tranny NOUN",
      "make VERB",
      "pregnancy NOUN",
      "miracle NOUN",
      "know VERB",
      "report VERB",
      "high ADJ",
      "up NOUN",
      "try VERB",
      "forget VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I (genderfluid, 19) was in Sally Beauty today picking up my usual hair dye, and there was another person in the isle with me, someone who also looked to be visibly queer (not to stereotype). You know, androgynous, dyed red and green hair, punk jacket, a visible rainbow flag patch on said jacket.\n\nI complimented the hair, saying \"oh that's cool, did you do red and green for christmas?\" And the response was \"Yes! But I'm going back to brown for the holidays because my family won't like it, I can't find the semi-permanent brown though.\"\n\nI said \"aw that sucks, looks cool though!\" And one of the workers I'm familiar with came over considering I'm there like every other week and asked if we needed any help. I said \"Oh, well they're looking for semi-permanent brown dye, they already have developer.\" While gesturing to the person I met next to me.\n\nThis persons face instantly changed to one of disgust and went, \"They? My pronouns are He/It ONLY. NOT they/them.\"\n\nI genuinely froze up because for one, I hate misgendering people, but at the same time I was confused. I only used \"they\" considering we never discussed each others pronouns, I figured it was pretty common knowledge that unless discussed beforehand, \"they\" is an acceptable term to refer to a stranger as if you don't know how they identify, out of respect.\n\nI paused awkwardly because I'm not really good with confrontation and I couldn't fathom why this person looked so genuinely upset, even the worker looked uncomfortable. After a few seconds I quickly apologized with, \"I'm sorry, I didn't know, if I had known you used he/it I wouldn't have used \"they\". I only used it because I wanted to be respectful and didn't know how you identified. It wont happen again.\"\n\nI was then met with \"Yeah, well I'm NOT non-binary or whatever. I don't want to be grouped with that.\"\n\nAnd then I paused again, thinking, \"Is this person who's under the transgender umbrella simultaneously enby-phobic?\"\n\nGenuine curiosity got the better of me and I asked why he thought that way, and he said that it was because of all the \"neo-pronoun bullshit\" and \"making up terms that don't need to exist for attention, making the rest of the trans community look bad\".\n\nThen he threw in the word \"trans trender\" and I immediately knew where the conversation was going. I shook my head, grabbed my black hair dye, went to the counter and left in a flabbergasted state.\n\nUSING THE TERM \"TRANS-TRENDER\" IN 2024?? ARE YOU KIDDING ME?\n\nThe person looked to be around 15-16 years old so I wanted to give him the benefit of the doubt, but damn. It felt like I was having a conversation with the reincarnate of Kalvin Garrah for a hot minute. I am now reluctant to go back to that Sally's location because I don't want to run into him again. I understand having your own opinions about the current state of the trans community but holy shit dude, there's no need to be hateful.\n\n\n",
    "author_fullname": "t2_ylevbb40w",
    "title": "I have never had this happen before and I'm appalled.",
    "upvote_ratio": 0.97,
    "ups": 1860,
    "created": 1734904067.0,
    "created_utc": 1734904067.0,
    "num_comments": 89,
    "author": "Putridlemons",
    "id": "1hk8lli",
    "created_datetime": "2024-12-22 21:47:47",
    "title_clean": "happen appal",
    "title_clean_pos": [
      "happen VERB",
      "appal VERB"
    ],
    "selftext_clean": "genderfluid sally beauty today pick usual hair dye person isle look visibly queer stereotype know androgynous dye red green hair punk jacket visible rainbow flag patch said jacket compliment hair say cool red green christmas response go brown holiday family like find semipermanent brown say suck look cool worker familiar come consider week ask need help say look semipermanent brown dye developer gesture person meet person face instantly change disgust go pronoun heit theythem genuinely freeze hate misgendere people time confused consider discuss pronoun figure pretty common knowledge discuss acceptable term refer stranger know identify respect pause awkwardly good confrontation fathom person look genuinely upset worker look uncomfortable second quickly apologize sorry know know heit want respectful know identify happen meet nonbinary want group pause think person transgender umbrella simultaneously enbyphobic genuine curiosity get well ask think way say neopronoun bullshit make term need exist attention make rest trans community look bad throw word trans trender immediately know conversation go shake head grab black hair dye go counter leave flabbergasted state term transtrender kid person look year old want benefit doubt feel have conversation reincarnate kalvin garrah hot minute reluctant sallys location want run understand have opinion current state trans community holy shit dude need hateful",
    "selftext_clean_pos": [
      "genderfluid ADJ",
      "sally ADJ",
      "beauty NOUN",
      "today NOUN",
      "pick VERB",
      "usual ADJ",
      "hair NOUN",
      "dye NOUN",
      "person NOUN",
      "isle NOUN",
      "look VERB",
      "visibly ADV",
      "queer ADJ",
      "stereotype VERB",
      "know VERB",
      "androgynous ADJ",
      "dye VERB",
      "red ADJ",
      "green ADJ",
      "hair NOUN",
      "punk NOUN",
      "jacket NOUN",
      "visible ADJ",
      "rainbow NOUN",
      "flag NOUN",
      "patch NOUN",
      "said ADJ",
      "jacket NOUN",
      "compliment VERB",
      "hair NOUN",
      "say VERB",
      "cool ADJ",
      "red NOUN",
      "green ADJ",
      "christmas PROPN",
      "response NOUN",
      "go VERB",
      "brown NOUN",
      "holiday NOUN",
      "family NOUN",
      "like VERB",
      "find VERB",
      "semipermanent NOUN",
      "brown NOUN",
      "say VERB",
      "suck VERB",
      "look VERB",
      "cool ADJ",
      "worker NOUN",
      "familiar ADJ",
      "come VERB",
      "consider VERB",
      "week NOUN",
      "ask VERB",
      "need VERB",
      "help NOUN",
      "say VERB",
      "look VERB",
      "semipermanent ADJ",
      "brown ADJ",
      "dye NOUN",
      "developer NOUN",
      "gesture VERB",
      "person NOUN",
      "meet VERB",
      "person NOUN",
      "face VERB",
      "instantly ADV",
      "change VERB",
      "disgust NOUN",
      "go VERB",
      "pronoun NOUN",
      "heit ADJ",
      "theythem PROPN",
      "genuinely ADV",
      "freeze VERB",
      "hate VERB",
      "misgendere VERB",
      "people NOUN",
      "time NOUN",
      "confused ADJ",
      "consider VERB",
      "discuss VERB",
      "pronoun NOUN",
      "figure VERB",
      "pretty ADV",
      "common ADJ",
      "knowledge NOUN",
      "discuss VERB",
      "acceptable ADJ",
      "term NOUN",
      "refer VERB",
      "stranger NOUN",
      "know VERB",
      "identify VERB",
      "respect NOUN",
      "pause VERB",
      "awkwardly ADV",
      "good ADJ",
      "confrontation NOUN",
      "fathom VERB",
      "person NOUN",
      "look VERB",
      "genuinely ADV",
      "upset ADJ",
      "worker NOUN",
      "look VERB",
      "uncomfortable ADJ",
      "second NOUN",
      "quickly ADV",
      "apologize VERB",
      "sorry ADJ",
      "know VERB",
      "know VERB",
      "heit NOUN",
      "want VERB",
      "respectful ADJ",
      "know VERB",
      "identify VERB",
      "happen VERB",
      "meet VERB",
      "nonbinary ADJ",
      "want VERB",
      "group VERB",
      "pause VERB",
      "think VERB",
      "person NOUN",
      "transgender NOUN",
      "umbrella NOUN",
      "simultaneously ADV",
      "enbyphobic ADJ",
      "genuine ADJ",
      "curiosity NOUN",
      "get VERB",
      "well ADJ",
      "ask VERB",
      "think VERB",
      "way NOUN",
      "say VERB",
      "neopronoun PROPN",
      "bullshit NOUN",
      "make VERB",
      "term NOUN",
      "need VERB",
      "exist VERB",
      "attention NOUN",
      "make VERB",
      "rest NOUN",
      "trans PROPN",
      "community NOUN",
      "look VERB",
      "bad ADJ",
      "throw VERB",
      "word NOUN",
      "trans PROPN",
      "trender NOUN",
      "immediately ADV",
      "know VERB",
      "conversation NOUN",
      "go VERB",
      "shake VERB",
      "head NOUN",
      "grab VERB",
      "black ADJ",
      "hair NOUN",
      "dye NOUN",
      "go VERB",
      "counter NOUN",
      "leave VERB",
      "flabbergasted ADJ",
      "state NOUN",
      "term NOUN",
      "transtrender NOUN",
      "kid VERB",
      "person NOUN",
      "look VERB",
      "year NOUN",
      "old ADJ",
      "want VERB",
      "benefit NOUN",
      "doubt NOUN",
      "feel VERB",
      "have VERB",
      "conversation NOUN",
      "reincarnate NOUN",
      "kalvin NOUN",
      "garrah PROPN",
      "hot ADJ",
      "minute NOUN",
      "reluctant ADJ",
      "sallys VERB",
      "location NOUN",
      "want VERB",
      "run VERB",
      "understand VERB",
      "have VERB",
      "opinion NOUN",
      "current ADJ",
      "state NOUN",
      "trans PROPN",
      "community NOUN",
      "holy ADJ",
      "shit NOUN",
      "dude NOUN",
      "need NOUN",
      "hateful ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "god im just here to rant. cw for mentions of violence against trans women.\n\ntwo of my cis girl friends got messaged by the same creepy guy and decide to start trolling him. thats fine, whatever. but they start saying stuff like \"i have a penis\" in an effort to put him off. ive heard of cis women doing this before and its just kind of wild to me. like first of all that is just insanely disrespectful, to think the worst most off putting thing you could think of is someone being trans, cool. awesome. but also that is just incredibly dangerous?? like they seriously think that is going to make those men leave them alone!? if you go round telling creepy men youre trans AT BEST you'll just get further harassed, at worst fucking hate crimed and murdered. but they just have no regard for this at all and ugh. it made me mad.",
    "author_fullname": "t2_khpc0ad9",
    "title": "cis girls pretending to be trans girls",
    "upvote_ratio": 0.98,
    "ups": 1791,
    "created": 1733620354.0,
    "created_utc": 1733620354.0,
    "num_comments": 58,
    "author": "lava_bastion",
    "id": "1h97b8q",
    "created_datetime": "2024-12-08 01:12:34",
    "title_clean": "cis girl pretend tran girl",
    "title_clean_pos": [
      "cis NOUN",
      "girl NOUN",
      "pretend VERB",
      "tran NOUN",
      "girl NOUN"
    ],
    "selftext_clean": "rant cw mention violence trans woman cis girl friend message creepy guy decide start troll fine start say stuff penis effort hear cis woman kind wild insanely disrespectful think bad put thing think trans cool awesome incredibly dangerous seriously think go man leave round tell creepy man tran good harass bad fucking hate crime murder regard ugh mad",
    "selftext_clean_pos": [
      "rant VERB",
      "cw NOUN",
      "mention NOUN",
      "violence NOUN",
      "trans PROPN",
      "woman NOUN",
      "cis NOUN",
      "girl NOUN",
      "friend NOUN",
      "message VERB",
      "creepy ADJ",
      "guy NOUN",
      "decide VERB",
      "start VERB",
      "troll VERB",
      "fine ADJ",
      "start VERB",
      "say VERB",
      "stuff NOUN",
      "penis NOUN",
      "effort NOUN",
      "hear VERB",
      "cis NOUN",
      "woman NOUN",
      "kind ADV",
      "wild ADJ",
      "insanely ADV",
      "disrespectful ADJ",
      "think VERB",
      "bad ADJ",
      "put VERB",
      "thing NOUN",
      "think VERB",
      "trans ADV",
      "cool ADJ",
      "awesome ADJ",
      "incredibly ADV",
      "dangerous ADJ",
      "seriously ADV",
      "think VERB",
      "go VERB",
      "man NOUN",
      "leave VERB",
      "round ADV",
      "tell VERB",
      "creepy ADJ",
      "man NOUN",
      "tran NOUN",
      "good ADJ",
      "harass VERB",
      "bad ADJ",
      "fucking ADJ",
      "hate NOUN",
      "crime VERB",
      "murder VERB",
      "regard NOUN",
      "ugh NOUN",
      "mad ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I(mtf) had a meeting at work today about being transgender and what support I needed/wanted from the company. They are changing internal documents to match my gender and preferred name, but while they do that I have to use the gender neutral changing rooms and bathrooms on site since I’m not a guy and they want to finish the paperwork before I use the women’s areas.(I’ve been doing this for a while now and they are honestly nicer than the other facilities tbh also very abundant). They’re also working with my management to get me into the women’s uniform. I’m excited since this is my first time actually coming out to someone who isn’t a close friend and now I can finally start living as a woman. Yippee ",
    "author_fullname": "t2_3ayhhbii",
    "title": "I got told I can’t use the Men’s restroom at work today 🙂",
    "upvote_ratio": 0.99,
    "ups": 1791,
    "created": 1735304916.0,
    "created_utc": 1735304916.0,
    "num_comments": 49,
    "author": "tinylord202",
    "id": "1hneiff",
    "created_datetime": "2024-12-27 13:08:36",
    "title_clean": "tell use men restroom work today",
    "title_clean_pos": [
      "tell VERB",
      "use VERB",
      "men NOUN",
      "restroom NOUN",
      "work NOUN",
      "today NOUN"
    ],
    "selftext_clean": "imtf meeting work today transgender support neededwante company change internal document match gender preferred use gender neutral change room bathroom site guy want finish paperwork use women honestly nice facility honest abundant work management women uniform excited time actually come close friend finally start live woman yippee",
    "selftext_clean_pos": [
      "imtf PROPN",
      "meeting NOUN",
      "work NOUN",
      "today NOUN",
      "transgender ADJ",
      "support NOUN",
      "neededwante VERB",
      "company NOUN",
      "change VERB",
      "internal ADJ",
      "document NOUN",
      "match VERB",
      "gender NOUN",
      "preferred ADJ",
      "use VERB",
      "gender NOUN",
      "neutral ADJ",
      "change VERB",
      "room NOUN",
      "bathroom NOUN",
      "site NOUN",
      "guy NOUN",
      "want VERB",
      "finish VERB",
      "paperwork NOUN",
      "use VERB",
      "women NOUN",
      "honestly ADV",
      "nice ADJ",
      "facility NOUN",
      "honest ADJ",
      "abundant ADJ",
      "work VERB",
      "management NOUN",
      "women NOUN",
      "uniform NOUN",
      "excited ADJ",
      "time NOUN",
      "actually ADV",
      "come VERB",
      "close ADJ",
      "friend NOUN",
      "finally ADV",
      "start VERB",
      "live VERB",
      "woman NOUN",
      "yippee PROPN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I'm currently a senior in highschool and my friend is a junior. My friend is a trans woman that is able to use the womans locker room. Yesterday an article about her was released saying that she did so many heinous things in the locker room without providing any real evidence, just word of mouth, and stating it as fact.\nBased off what I know, what other people know, and my own logic, none of this makes any sense and is just a load of shit. It this shit would of actually happen I wouldn't have heard it for the first time from a fucking article. Not to mention this \"journalist\" has been accused of defamation before.\n\nThis is pissing me off so fucking hard rn.\n\n\nEdit: I forgot rule 4 was a thing, I am in fact, trans myself ",
    "author_fullname": "t2_9kguketq",
    "title": "My friend is being defamed by a yellow journalist ",
    "upvote_ratio": 0.99,
    "ups": 1768,
    "created": 1734730798.0,
    "created_utc": 1734730798.0,
    "num_comments": 25,
    "author": "Agreeable-Dinner1094",
    "id": "1hiuhoi",
    "created_datetime": "2024-12-20 21:39:58",
    "title_clean": "friend defame yellow journalist",
    "title_clean_pos": [
      "friend NOUN",
      "defame VERB",
      "yellow ADJ",
      "journalist NOUN"
    ],
    "selftext_clean": "currently senior highschool friend junior friend trans woman able use womans locker room yesterday article release say heinous thing locker room provide real evidence word mouth state fact base know people know logic make sense load shit shit actually happen hear time fucking article mention journalist accuse defamation piss fucking hard right edit forgot rule thing fact trans",
    "selftext_clean_pos": [
      "currently ADV",
      "senior ADJ",
      "highschool NOUN",
      "friend NOUN",
      "junior NOUN",
      "friend NOUN",
      "trans PROPN",
      "woman NOUN",
      "able ADJ",
      "use VERB",
      "womans PROPN",
      "locker NOUN",
      "room NOUN",
      "yesterday NOUN",
      "article NOUN",
      "release VERB",
      "say VERB",
      "heinous ADJ",
      "thing NOUN",
      "locker NOUN",
      "room NOUN",
      "provide VERB",
      "real ADJ",
      "evidence NOUN",
      "word NOUN",
      "mouth NOUN",
      "state VERB",
      "fact NOUN",
      "base VERB",
      "know VERB",
      "people NOUN",
      "know VERB",
      "logic NOUN",
      "make VERB",
      "sense NOUN",
      "load NOUN",
      "shit NOUN",
      "shit NOUN",
      "actually ADV",
      "happen VERB",
      "hear VERB",
      "time NOUN",
      "fucking ADJ",
      "article NOUN",
      "mention VERB",
      "journalist NOUN",
      "accuse VERB",
      "defamation NOUN",
      "piss VERB",
      "fucking ADV",
      "hard ADV",
      "right ADV",
      "edit PROPN",
      "forgot VERB",
      "rule NOUN",
      "thing NOUN",
      "fact NOUN",
      "trans PROPN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "So I work in a service industry that goes to folks homes. I am mtf transfem but boymode at work because I have to use public restrooms and don’t want any issues.\n\nThis was my first time at this customers house. \nShe was elderly and bed ridden.\nShe told me she has sons who live with her.\nEverything was fine I was just about finished up there and then I hear someone yelling at me.\n\n“Hey what’s this f-slur-y ass dy-slur doing.\nFa$$&y ASS *d-slur for lesbian*. You ain’t a man. You just a B@@ch in a suit.”\n\nI turn around and see her paraplegic son laying in bed yelling at me.\n\n I was caught off guard and just apologized and said I’m just here to help out his grandma.\n\n“You’re a d-slur! You ain’t a man. You a b*#€h. Trying to make my granny gay. F-slur ass D-slur.”\n\nI just gave the grandma my number said call me if you need anything and left.\n\nI was… offended? I think? I mean honestly it made me feel pretty great. He thought I was a trans man. I am not. I mean he is horrid and well… I guess… I dunno.\n\nTL;DR Paraplegic guy called me a bunch of lesbian slurs thinking I was a trans man. \n\nEdit: to make it clear he was an ass because he was an ass. I’m a feminist and think all people can be assholes equally. I’m just pointing out he was paraplegic because it was different from someone who could actually attack me. \nI was in control in the situation for once.\nI’ve had situations when I was just starting where guys would come at me. Luckily nothing ever happened.\n ",
    "author_fullname": "t2_17138dr58s",
    "title": "Misgendered in the most wild way",
    "upvote_ratio": 0.98,
    "ups": 1740,
    "created": 1734880130.0,
    "created_utc": 1734880130.0,
    "num_comments": 81,
    "author": "rando9000mcdoublebun",
    "id": "1hk0adv",
    "created_datetime": "2024-12-22 15:08:50",
    "title_clean": "misgendere wild way",
    "title_clean_pos": [
      "misgendere VERB",
      "wild ADJ",
      "way NOUN"
    ],
    "selftext_clean": "work service industry go folk home mtf transfem boymode work use public restroom want issue time customer house elderly bed ride tell son live fine finish hear yell fslury ass dyslur fay dslur lesbian man b suit turn paraplegic son lay bed yell catch guard apologize say help grandma dslur man beurh try granny gay fslur dslur give grandma number say need leave offend think mean honestly feel pretty great think trans man mean horrid guess know tldr paraplegic guy call bunch lesbian slur think trans man edit clear ass ass feminist think people asshole equally point paraplegic different actually attack control situation situation start guy come luckily happen",
    "selftext_clean_pos": [
      "work VERB",
      "service NOUN",
      "industry NOUN",
      "go VERB",
      "folk NOUN",
      "home NOUN",
      "mtf ADJ",
      "transfem PROPN",
      "boymode NOUN",
      "work NOUN",
      "use VERB",
      "public ADJ",
      "restroom NOUN",
      "want VERB",
      "issue NOUN",
      "time NOUN",
      "customer NOUN",
      "house NOUN",
      "elderly ADJ",
      "bed NOUN",
      "ride VERB",
      "tell VERB",
      "son NOUN",
      "live VERB",
      "fine ADJ",
      "finish VERB",
      "hear VERB",
      "yell VERB",
      "fslury NOUN",
      "ass NOUN",
      "dyslur NOUN",
      "fay NOUN",
      "dslur NOUN",
      "lesbian PROPN",
      "man NOUN",
      "b NOUN",
      "suit NOUN",
      "turn VERB",
      "paraplegic ADJ",
      "son NOUN",
      "lay VERB",
      "bed NOUN",
      "yell VERB",
      "catch VERB",
      "guard NOUN",
      "apologize VERB",
      "say VERB",
      "help VERB",
      "grandma NOUN",
      "dslur NOUN",
      "man NOUN",
      "beurh NOUN",
      "try VERB",
      "granny NOUN",
      "gay NOUN",
      "fslur PROPN",
      "dslur PROPN",
      "give VERB",
      "grandma NOUN",
      "number NOUN",
      "say VERB",
      "need VERB",
      "leave VERB",
      "offend VERB",
      "think VERB",
      "mean VERB",
      "honestly ADV",
      "feel VERB",
      "pretty ADV",
      "great ADJ",
      "think VERB",
      "trans PROPN",
      "man NOUN",
      "mean VERB",
      "horrid ADJ",
      "guess VERB",
      "know VERB",
      "tldr PROPN",
      "paraplegic ADJ",
      "guy NOUN",
      "call VERB",
      "bunch NOUN",
      "lesbian ADJ",
      "slur NOUN",
      "think VERB",
      "trans PROPN",
      "man NOUN",
      "edit VERB",
      "clear ADJ",
      "ass NOUN",
      "ass NOUN",
      "feminist NOUN",
      "think VERB",
      "people NOUN",
      "asshole NOUN",
      "equally ADV",
      "point VERB",
      "paraplegic ADJ",
      "different ADJ",
      "actually ADV",
      "attack VERB",
      "control NOUN",
      "situation NOUN",
      "situation NOUN",
      "start VERB",
      "guy NOUN",
      "come VERB",
      "luckily ADV",
      "happen VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I kept having some stupid man tell me I was some porn-obsessed fetishizer. I told him to shut up because he didn't know anything about Trans hardships and he could go away. After him bringing up porn again and again I accused him of projecting and blocked him. Apparently he complained about being blocked so some other dude called me a man and said he bet my family all discarded me because I was a freak. I told him to die and immediately lost use of my Twitter account.\n\nGotta love it. They can say any and all shit, threaten trans people all they like, call us any name, tell us any fucked up thing they want, but I return the favor just one time.\n\nIm so mad. Im furious. I wish I could do something with this anger. Im so tired of being the bigger person. I hate these people. ",
    "author_fullname": "t2_1bmnyju",
    "title": "I lost my temper",
    "upvote_ratio": 0.99,
    "ups": 1723,
    "created": 1735044035.0,
    "created_utc": 1735044035.0,
    "num_comments": 91,
    "author": "Rylzix",
    "id": "1hlcqon",
    "created_datetime": "2024-12-24 12:40:35",
    "title_clean": "lose temper",
    "title_clean_pos": [
      "lose VERB",
      "temper NOUN"
    ],
    "selftext_clean": "keep have stupid man tell pornobsesse fetishizer tell shut know trans hardship away bring porn accuse project block apparently complain block dude call man say bet family discard freak tell die immediately lose use twitter account get love shit threaten trans people tell fuck thing want return favor time mad furious wish anger tired big person hate people",
    "selftext_clean_pos": [
      "keep VERB",
      "have VERB",
      "stupid ADJ",
      "man NOUN",
      "tell VERB",
      "pornobsesse VERB",
      "fetishizer NOUN",
      "tell VERB",
      "shut VERB",
      "know VERB",
      "trans PROPN",
      "hardship NOUN",
      "away ADV",
      "bring VERB",
      "porn NOUN",
      "accuse VERB",
      "project VERB",
      "block VERB",
      "apparently ADV",
      "complain VERB",
      "block VERB",
      "dude NOUN",
      "call VERB",
      "man NOUN",
      "say VERB",
      "bet VERB",
      "family NOUN",
      "discard VERB",
      "freak NOUN",
      "tell VERB",
      "die VERB",
      "immediately ADV",
      "lose VERB",
      "use NOUN",
      "twitter NOUN",
      "account NOUN",
      "get VERB",
      "love VERB",
      "shit NOUN",
      "threaten NOUN",
      "trans PROPN",
      "people NOUN",
      "tell VERB",
      "fuck VERB",
      "thing NOUN",
      "want VERB",
      "return VERB",
      "favor NOUN",
      "time NOUN",
      "mad ADJ",
      "furious ADJ",
      "wish VERB",
      "anger NOUN",
      "tired ADJ",
      "big ADJ",
      "person NOUN",
      "hate VERB",
      "people NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "No, you made it my identity by constantly obsessing over it, refusing to leave me alone about something that’s none of your business and doesn’t affect you at all. Trust me, I’d love nothing more than to just talk about Space exploration, video games, or literally anything else. But instead, I’m forced to stand up and defend basic human rights because someone’s imaginary friend decided my existence was “sinful,” and now they’re making it everyone’s problem.\n\nAnyone who actually knows me knows I don’t even bring it up unless someone makes it an issue.\n\n“But you’re wearing makeup.”\n\nMakeup has nothing to do with sexual orientation. The definition of sexual orientation is: “Sexual orientation is a person’s emotional, romantic, or sexual attraction to other people, and how they identify based on those attractions.”\n\nI wear makeup because I enjoy it. It’s a hobby and a form of art for me. It brings me joy—it’s not a sexual orientation.",
    "author_fullname": "t2_9w1lm2bo",
    "title": "“LGBTQ people make their whole identity about being LGBTQ.”",
    "upvote_ratio": 0.99,
    "ups": 1653,
    "created": 1734287116.0,
    "created_utc": 1734287116.0,
    "num_comments": 67,
    "author": "Safe-Combination1181",
    "id": "1heysj1",
    "created_datetime": "2024-12-15 18:25:16",
    "title_clean": "lgbtq people identity lgbtq",
    "title_clean_pos": [
      "lgbtq NOUN",
      "people NOUN",
      "identity NOUN",
      "lgbtq NOUN"
    ],
    "selftext_clean": "identity constantly obsess refuse leave business affect trust love talk space exploration video game literally instead force stand defend basic human right imaginary friend decide existence sinful make problem actually know know bring make issue wear makeup makeup sexual orientation definition sexual orientation sexual orientation person emotional romantic sexual attraction people identify base attraction wear makeup enjoy hobby form art bring joyit sexual orientation",
    "selftext_clean_pos": [
      "identity NOUN",
      "constantly ADV",
      "obsess VERB",
      "refuse VERB",
      "leave VERB",
      "business NOUN",
      "affect VERB",
      "trust VERB",
      "love VERB",
      "talk VERB",
      "space NOUN",
      "exploration NOUN",
      "video NOUN",
      "game NOUN",
      "literally ADV",
      "instead ADV",
      "force VERB",
      "stand VERB",
      "defend VERB",
      "basic ADJ",
      "human ADJ",
      "right NOUN",
      "imaginary ADJ",
      "friend NOUN",
      "decide VERB",
      "existence NOUN",
      "sinful ADJ",
      "make VERB",
      "problem NOUN",
      "actually ADV",
      "know VERB",
      "know VERB",
      "bring VERB",
      "make VERB",
      "issue NOUN",
      "wear VERB",
      "makeup NOUN",
      "makeup NOUN",
      "sexual ADJ",
      "orientation NOUN",
      "definition NOUN",
      "sexual ADJ",
      "orientation NOUN",
      "sexual ADJ",
      "orientation NOUN",
      "person NOUN",
      "emotional ADJ",
      "romantic ADJ",
      "sexual ADJ",
      "attraction NOUN",
      "people NOUN",
      "identify VERB",
      "base VERB",
      "attraction NOUN",
      "wear VERB",
      "makeup NOUN",
      "enjoy VERB",
      "hobby NOUN",
      "form NOUN",
      "art NOUN",
      "bring VERB",
      "joyit PROPN",
      "sexual ADJ",
      "orientation NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "This is not sad, i swear. I'm 18, ftm. I was put on the contraceptive pill for PCOS and horrible periods... but my body rejected the estrogen and pregesterone being pumped into my system (in a way) because something happened that wasnt supposed to happen. It was supposed to lessen or stop my periods. I ended up having a 2 week (+) long period. When i went to the doctors about it, she said that a period that long plus my normally heavy bleeding classes as a hemorrhage and i had low iron levels, so i got prescribed iron. This was about a month ago, and i was already in the process to getting T. This was just a thing to try to stop my periods and lessen the dysphoria for now. Anyway, the period stopped only a day or two after i stopped taking them. And here i am now. Tomorrow, i have another appointment with my endocrine, and as long as theres no problems (which there isn't. All of my problems are already diagnosed and confirmed by the endocrine that they raise no issues in starting T), I'll be at least getting prescribed T by tomorrow. I hope all goes well. I hate the idea of waiting until I'm 19 to start T. It's only a couple of months, but those months would be filled with dysphoria and depression for me. For now, I'm just telling myself that I'm getting T tomorrow, whether physically or prescribed at the least, haha.",
    "author_fullname": "t2_ifqize9g",
    "title": "My body rejected female hormones lol",
    "upvote_ratio": 0.98,
    "ups": 1615,
    "created": 1734276882.0,
    "created_utc": 1734276882.0,
    "num_comments": 38,
    "author": "Mysterious_Report276",
    "id": "1hev0kg",
    "created_datetime": "2024-12-15 15:34:42",
    "title_clean": "body reject female hormone lol",
    "title_clean_pos": [
      "body NOUN",
      "reject VERB",
      "female ADJ",
      "hormone NOUN",
      "lol VERB"
    ],
    "selftext_clean": "sad swear ftm contraceptive pill pco horrible period body reject estrogen pregesterone pump system way happen suppose happen suppose lessen stop period end have week long period go doctor say period long normally heavy bleeding class hemorrhage low iron level get prescribe iron month ago process get thing try stop period lessen dysphoria period stop day stop take tomorrow appointment endocrine long problem problem diagnose confirm endocrine raise issue start t get prescribe t tomorrow hope go hate idea wait start couple month month fill dysphoria depression tell get t tomorrow physically prescribe haha",
    "selftext_clean_pos": [
      "sad ADJ",
      "swear VERB",
      "ftm ADJ",
      "contraceptive NOUN",
      "pill NOUN",
      "pco NOUN",
      "horrible ADJ",
      "period NOUN",
      "body NOUN",
      "reject VERB",
      "estrogen NOUN",
      "pregesterone NOUN",
      "pump VERB",
      "system NOUN",
      "way NOUN",
      "happen VERB",
      "suppose VERB",
      "happen VERB",
      "suppose VERB",
      "lessen VERB",
      "stop VERB",
      "period NOUN",
      "end VERB",
      "have VERB",
      "week NOUN",
      "long ADJ",
      "period NOUN",
      "go VERB",
      "doctor NOUN",
      "say VERB",
      "period NOUN",
      "long ADV",
      "normally ADV",
      "heavy ADJ",
      "bleeding NOUN",
      "class NOUN",
      "hemorrhage NOUN",
      "low ADJ",
      "iron NOUN",
      "level NOUN",
      "get VERB",
      "prescribe VERB",
      "iron NOUN",
      "month NOUN",
      "ago ADV",
      "process NOUN",
      "get VERB",
      "thing NOUN",
      "try VERB",
      "stop VERB",
      "period NOUN",
      "lessen VERB",
      "dysphoria NOUN",
      "period NOUN",
      "stop VERB",
      "day NOUN",
      "stop VERB",
      "take VERB",
      "tomorrow NOUN",
      "appointment NOUN",
      "endocrine NOUN",
      "long ADV",
      "problem NOUN",
      "problem NOUN",
      "diagnose VERB",
      "confirm VERB",
      "endocrine NOUN",
      "raise VERB",
      "issue NOUN",
      "start VERB",
      "t NOUN",
      "get VERB",
      "prescribe VERB",
      "t NOUN",
      "tomorrow NOUN",
      "hope VERB",
      "go VERB",
      "hate VERB",
      "idea NOUN",
      "wait VERB",
      "start VERB",
      "couple NOUN",
      "month NOUN",
      "month NOUN",
      "fill VERB",
      "dysphoria NOUN",
      "depression NOUN",
      "tell VERB",
      "get VERB",
      "t NOUN",
      "tomorrow NOUN",
      "physically ADV",
      "prescribe VERB",
      "haha NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I (16 MtF) am in a school trip and I had to go in a room with 2 guys because I don't really know that many people in my school. I don't really know the first one, he is a quiet guy who doesn't really mess with anyone or do anything. The problems come with the second guy. Let's call him Alan.\n\nWell I met Alan a couple years ago on another trip and I've gone on several with him. When he was younger he was kind of a brute, playing pretty rough and stuff, but he knew where to draw lines and seemed to be growing more mature but this year we went to different classes in september. When I met him again this travel he had changed. He started laughing about \"nazi good, minority bad\" \"jokes\" and expressing fascist points of view unironically and acting pretty cold with me. I knew he had been struggling with acohol and substance abuse and his parents divorce but I never expected him to go down this route. \n\nAt first I tried to be friendly. He's been through a rough patch and we've all had phases. But he didn't seem to care about that, or about the fact that I was a human being. Every time I was in the room Alan would direct comments at what he considered \"my weakness\", calling me homophobic and transphobic slurs and in the latest days even trowing objects or hitting me and playing it off as a joke.\n\nAs I hope you'll understand, I wasn't quite happy with this. Yesterday we had a clash when I threw back back one of the fruits Alan had been throwing it me, we didn't get into a fight because the quiet guy was able to take him away. Today that didn't happen.\n\nThings got even worse today than before and at one point he hit me very badly in the neck while going past me, again trying to play it off as a joke. I got really, really mad and threw a bag that was nearby at him and then Alan jumped at me. I don't really remenber anything about that exchange other than the fact that he tried to choke me (fortunately failed) but was able to open a pretty big breach on my head. Then my other roomate was able to get him off me. That was a few hours ago. Alan is getting hammered next door and I am sitting in the bed of our room waiting for this whole shitshow to be over. God I hate this so much",
    "author_fullname": "t2_10jyclodnv",
    "title": "I got hate crimed tonight",
    "upvote_ratio": 0.98,
    "ups": 1588,
    "created": 1734658837.0,
    "created_utc": 1734658837.0,
    "num_comments": 78,
    "author": "Madame_Player",
    "id": "1hi8uej",
    "created_datetime": "2024-12-20 01:40:37",
    "title_clean": "get hate crime tonight",
    "title_clean_pos": [
      "get VERB",
      "hate NOUN",
      "crime VERB",
      "tonight NOUN"
    ],
    "selftext_clean": "mtf school trip room guy know people school know quiet guy mess problem come second guy let alan meet alan couple year ago trip go young kind brute play pretty rough stuff know draw line grow mature year go different class september meet travel change start laugh nazi good minority bad joke express fascist point view unironically act pretty cold know struggle acohol substance abuse parent divorce expect route try friendly rough patch phase care fact human time room alan direct comment consider weakness call homophobic transphobic slur late day trowe object hit play joke hope understand happy yesterday clash throw fruit alan throw fight quiet guy able away today happen thing get bad today point hit badly neck go try play joke get mad throw bag nearby alan jump remenber exchange fact try choke fortunately fail able open pretty big breach head roomate able hour ago alan hammer door sit bed room wait shitshow hate",
    "selftext_clean_pos": [
      "mtf VERB",
      "school NOUN",
      "trip NOUN",
      "room NOUN",
      "guy NOUN",
      "know VERB",
      "people NOUN",
      "school NOUN",
      "know VERB",
      "quiet ADJ",
      "guy NOUN",
      "mess VERB",
      "problem NOUN",
      "come VERB",
      "second ADJ",
      "guy NOUN",
      "let VERB",
      "alan PROPN",
      "meet VERB",
      "alan PROPN",
      "couple NOUN",
      "year NOUN",
      "ago ADV",
      "trip NOUN",
      "go VERB",
      "young ADJ",
      "kind ADV",
      "brute ADJ",
      "play VERB",
      "pretty ADV",
      "rough ADJ",
      "stuff NOUN",
      "know VERB",
      "draw VERB",
      "line NOUN",
      "grow VERB",
      "mature ADJ",
      "year NOUN",
      "go VERB",
      "different ADJ",
      "class NOUN",
      "september PROPN",
      "meet VERB",
      "travel NOUN",
      "change VERB",
      "start VERB",
      "laugh VERB",
      "nazi PROPN",
      "good ADJ",
      "minority NOUN",
      "bad ADJ",
      "joke NOUN",
      "express VERB",
      "fascist ADJ",
      "point NOUN",
      "view NOUN",
      "unironically ADV",
      "act VERB",
      "pretty ADV",
      "cold ADJ",
      "know VERB",
      "struggle VERB",
      "acohol NOUN",
      "substance NOUN",
      "abuse NOUN",
      "parent NOUN",
      "divorce NOUN",
      "expect VERB",
      "route NOUN",
      "try VERB",
      "friendly ADJ",
      "rough ADJ",
      "patch NOUN",
      "phase NOUN",
      "care VERB",
      "fact NOUN",
      "human ADJ",
      "time NOUN",
      "room NOUN",
      "alan PROPN",
      "direct VERB",
      "comment NOUN",
      "consider VERB",
      "weakness NOUN",
      "call VERB",
      "homophobic ADJ",
      "transphobic ADJ",
      "slur NOUN",
      "late ADJ",
      "day NOUN",
      "trowe VERB",
      "object NOUN",
      "hit VERB",
      "play VERB",
      "joke NOUN",
      "hope VERB",
      "understand VERB",
      "happy ADJ",
      "yesterday NOUN",
      "clash NOUN",
      "throw VERB",
      "fruit NOUN",
      "alan PROPN",
      "throw VERB",
      "fight NOUN",
      "quiet ADJ",
      "guy NOUN",
      "able ADJ",
      "away ADV",
      "today NOUN",
      "happen VERB",
      "thing NOUN",
      "get VERB",
      "bad ADJ",
      "today NOUN",
      "point NOUN",
      "hit VERB",
      "badly ADV",
      "neck NOUN",
      "go VERB",
      "try VERB",
      "play VERB",
      "joke NOUN",
      "get VERB",
      "mad ADJ",
      "throw VERB",
      "bag NOUN",
      "nearby ADV",
      "alan PROPN",
      "jump VERB",
      "remenber VERB",
      "exchange NOUN",
      "fact NOUN",
      "try VERB",
      "choke VERB",
      "fortunately ADV",
      "fail VERB",
      "able ADJ",
      "open VERB",
      "pretty ADV",
      "big ADJ",
      "breach NOUN",
      "head NOUN",
      "roomate NOUN",
      "able ADJ",
      "hour NOUN",
      "ago ADV",
      "alan PROPN",
      "hammer VERB",
      "door NOUN",
      "sit VERB",
      "bed NOUN",
      "room NOUN",
      "wait VERB",
      "shitshow NOUN",
      "hate VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "My (15mtf) Mom (34f) is 14 weeks pregnant. This is something I never really expected to happen as I’m an only child and she never really seemed interested in having more kids but here we are. My mom has always said that if she ever had a daughter she would name it a certain name. I have never came out to her because she’s slightly transphobic; I don’t think she’d kick me out or anything if she found out but she definitely wouldn’t be happy. So I figured that if maybe I made my chosen name the name she always wanted for a daughter maybe she’d be less mad when I eventually came out to her...\n\nWell we found out yesterday that my mom is having a girl and she has already said that my chosen name will be her name. I can’t help but be so upset by this because that was the only name I could decide on. There are many other girl names I like but I could never decide on which I liked more so I can’t help but feel like I’ll never find a name for me. \n\nI don’t know what to do 😭",
    "author_fullname": "t2_8esz4iuqz",
    "title": "My mom is pregnant and she’s naming the baby my chosen name",
    "upvote_ratio": 0.98,
    "ups": 1547,
    "created": 1735662035.0,
    "created_utc": 1735662035.0,
    "num_comments": 79,
    "author": "Asterioud",
    "id": "1hqi2m2",
    "created_datetime": "2024-12-31 16:20:35",
    "title_clean": "mom pregnant name baby choose",
    "title_clean_pos": [
      "mom NOUN",
      "pregnant ADJ",
      "name VERB",
      "baby NOUN",
      "choose VERB"
    ],
    "selftext_clean": "mtf mom f week pregnant expect happen child interested have kid mom say daughter certain come slightly transphobic think kick find definitely happy figure maybe choose want daughter maybe mad eventually come find yesterday mom have girl say choose help upset decide girl name like decide like help feel find know",
    "selftext_clean_pos": [
      "mtf PROPN",
      "mom PROPN",
      "f PROPN",
      "week NOUN",
      "pregnant ADJ",
      "expect VERB",
      "happen VERB",
      "child NOUN",
      "interested ADJ",
      "have VERB",
      "kid NOUN",
      "mom NOUN",
      "say VERB",
      "daughter NOUN",
      "certain ADJ",
      "come VERB",
      "slightly ADV",
      "transphobic ADJ",
      "think VERB",
      "kick VERB",
      "find VERB",
      "definitely ADV",
      "happy ADJ",
      "figure VERB",
      "maybe ADV",
      "choose VERB",
      "want VERB",
      "daughter NOUN",
      "maybe ADV",
      "mad ADJ",
      "eventually ADV",
      "come VERB",
      "find VERB",
      "yesterday NOUN",
      "mom NOUN",
      "have VERB",
      "girl NOUN",
      "say VERB",
      "choose VERB",
      "help VERB",
      "upset ADJ",
      "decide VERB",
      "girl NOUN",
      "name NOUN",
      "like VERB",
      "decide VERB",
      "like VERB",
      "help VERB",
      "feel VERB",
      "find VERB",
      "know VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "Was told \"can't you wear pants\" and I know I can't go full on goth out of respect and to not steal the show by why tf should I go as a boy just because I make uncle uncomfortable as a woman I can't see what's wrong with me going in a plain black dress but apparently me going as a woman is bad (I fully pass as a woman and u wouldn't know I'm trans unless u know me) it makes me so angry that they would even say that shit to me I'm not stealing anyone's attention by wearing a long black dress and simply refuse going as a guy just cause they want me to if other women can go in a dress I can do so too it's just pure stupidity the shot they tell me if I were to go in pants I would have to wear a short top or straight up crop top which is wayyy more attention stealing I don't have pants or guy clothes to go with it so a dress it is fuck them and their bigoted opinion I'm only going cause the guy that's dead was the only damn guy in that fucked family that even talked with or respected me as a person instead of just seeing me as the black sheep... Sorry for venting and sorry for lack of commas English isn't my 1st language",
    "author_fullname": "N/A",
    "title": "Going to a funeral and my family wants me to not be trans when going to it...",
    "upvote_ratio": 0.99,
    "ups": 1533,
    "created": 1734199214.0,
    "created_utc": 1734199214.0,
    "num_comments": 172,
    "author": "N/A",
    "id": "1he8gnt",
    "created_datetime": "2024-12-14 18:00:14",
    "title_clean": "go funeral family want tran go",
    "title_clean_pos": [
      "go VERB",
      "funeral NOUN",
      "family NOUN",
      "want VERB",
      "tran NOUN",
      "go VERB"
    ],
    "selftext_clean": "tell wear pant know goth respect steal boy uncle uncomfortable woman wrong go plain black dress apparently go woman bad fully pass woman know tran know make angry shit steal anyone attention wear long black dress simply refuse go guy want woman dress pure stupidity shot tell pant wear short straight crop wayy attention steal pant guy clothe dress fuck bigoted opinion go guy dead damn guy fuck family talk respect person instead see black sheep sorry venting sorry lack commas english st language",
    "selftext_clean_pos": [
      "tell VERB",
      "wear VERB",
      "pant NOUN",
      "know VERB",
      "goth NOUN",
      "respect NOUN",
      "steal VERB",
      "boy NOUN",
      "uncle NOUN",
      "uncomfortable ADJ",
      "woman NOUN",
      "wrong ADJ",
      "go VERB",
      "plain ADJ",
      "black ADJ",
      "dress NOUN",
      "apparently ADV",
      "go VERB",
      "woman NOUN",
      "bad ADJ",
      "fully ADV",
      "pass VERB",
      "woman NOUN",
      "know VERB",
      "tran NOUN",
      "know VERB",
      "make VERB",
      "angry ADJ",
      "shit NOUN",
      "steal VERB",
      "anyone NOUN",
      "attention NOUN",
      "wear VERB",
      "long ADJ",
      "black ADJ",
      "dress NOUN",
      "simply ADV",
      "refuse VERB",
      "go VERB",
      "guy NOUN",
      "want VERB",
      "woman NOUN",
      "dress NOUN",
      "pure ADJ",
      "stupidity NOUN",
      "shot NOUN",
      "tell VERB",
      "pant NOUN",
      "wear VERB",
      "short ADJ",
      "straight ADV",
      "crop NOUN",
      "wayy NOUN",
      "attention NOUN",
      "steal VERB",
      "pant NOUN",
      "guy NOUN",
      "clothe NOUN",
      "dress NOUN",
      "fuck VERB",
      "bigoted ADJ",
      "opinion NOUN",
      "go VERB",
      "guy NOUN",
      "dead ADJ",
      "damn ADJ",
      "guy NOUN",
      "fuck VERB",
      "family NOUN",
      "talk VERB",
      "respect VERB",
      "person NOUN",
      "instead ADV",
      "see VERB",
      "black ADJ",
      "sheep NOUN",
      "sorry ADJ",
      "venting NOUN",
      "sorry ADJ",
      "lack NOUN",
      "commas PROPN",
      "english PROPN",
      "st PROPN",
      "language NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "So this just happened, I am getting my 4 year old ready for bed, and she asks me\"are you a him or a her\" I tell her, I am a her, then she says \" so why momy calls you him?\" I tell her because she likes to call me him, so she says ' have you asked Mom to call you her?\" I responded yes I have. This is where I almost cried, my four year old said \" you need to be louder! , I can help you, tomorrow if you need help I will tell her very loud that you are a her\" I can't believe she just said this to me, I don't really know how to feel. I am SOO proud of her and so ashamed of myself ",
    "author_fullname": "t2_bfnw07zw",
    "title": "My 4 year old has is now teaching me how to stand up for myself ",
    "upvote_ratio": 0.99,
    "ups": 1498,
    "created": 1733448980.0,
    "created_utc": 1733448980.0,
    "num_comments": 40,
    "author": "tatis450",
    "id": "1h7pu2h",
    "created_datetime": "2024-12-06 01:36:20",
    "title_clean": "year old teach stand",
    "title_clean_pos": [
      "year NOUN",
      "old ADJ",
      "teach VERB",
      "stand VERB"
    ],
    "selftext_clean": "happen get year old ready bed ask meare tell say momy call tell like say ask mom respond cry year old say need loud help tomorrow need help tell loud believe say know feel soo proud ashamed",
    "selftext_clean_pos": [
      "happen VERB",
      "get VERB",
      "year NOUN",
      "old ADJ",
      "ready ADJ",
      "bed NOUN",
      "ask VERB",
      "meare VERB",
      "tell VERB",
      "say VERB",
      "momy NOUN",
      "call VERB",
      "tell VERB",
      "like VERB",
      "say VERB",
      "ask VERB",
      "mom NOUN",
      "respond VERB",
      "cry VERB",
      "year NOUN",
      "old ADJ",
      "say VERB",
      "need VERB",
      "loud ADJ",
      "help VERB",
      "tomorrow NOUN",
      "need VERB",
      "help NOUN",
      "tell VERB",
      "loud ADJ",
      "believe VERB",
      "say VERB",
      "know VERB",
      "feel VERB",
      "soo VERB",
      "proud ADJ",
      "ashamed ADJ"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I don’t know if i’m really trans. But i want to be a man, so i’m going to believe that I am a man",
    "author_fullname": "t2_fet4xsvu",
    "title": "You know what? Fuck it",
    "upvote_ratio": 0.98,
    "ups": 1480,
    "created": 1734293209.0,
    "created_utc": 1734293209.0,
    "num_comments": 109,
    "author": "KiolovesDebussy",
    "id": "1hf12h6",
    "created_datetime": "2024-12-15 20:06:49",
    "title_clean": "know fuck",
    "title_clean_pos": [
      "know VERB",
      "fuck NOUN"
    ],
    "selftext_clean": "know trans want man go believe man",
    "selftext_clean_pos": [
      "know VERB",
      "trans ADJ",
      "want VERB",
      "man NOUN",
      "go VERB",
      "believe VERB",
      "man NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "TLDR: My psychiatrist was acting like a bigot, asked me uncomfortable questions and told me im a gay man.\n\nSo today i (mtf pre everything) had an appointment with my psychiatrist. She was using the wrong pronouns all the time (in my language almost every word is gendered) which was weird bc she never acted that way. I said that ive been thinking about going to sexuologist to get a diagnosis. She said that its a bad idea cuz \"90% of trans people eventually accept their bodies (my body isnt the only problem, which she seemed to not understand) and that all of her trans patients eventually turned out to not be trans\" (ofc if you keep telling them that they are not trans they will just fold under pressure, duh...). I also told her that i talked about it with my parents but they are busy and forgot to set up an appointment with the sexuologist, and as an answer she told me that theyre just dont want me to \"ruin my body forever\" and that they wanna \"protect me from hurting myself\". She told me that im prolly just a gay man, which really threw me off guard cuz im yet to be romantically attracted to a cis guy.\n\nShe also pulled the usual bigot bs type \"sui rates skyrocket in ppl who transitioned\", \"hrt makes you unable to orgasm\" etc.\n\nI also got asked a bunch of pretty private questions regarding my sex life (mind you im underage) and idk maybe its normal for psychiatrists to ask theese questions i was just a lil suprised.\n\nShe was also rude to my dad. I really dont like her bc she acts like a totally diffrent person everytime i see her and its creeping me out.",
    "author_fullname": "t2_a839mtrg",
    "title": "My psychiatrist said im not trans",
    "upvote_ratio": 0.99,
    "ups": 1412,
    "created": 1734642296.0,
    "created_utc": 1734642296.0,
    "num_comments": 207,
    "author": "_AxEL_pancakes",
    "id": "1hi32z7",
    "created_datetime": "2024-12-19 21:04:56",
    "title_clean": "psychiatrist say trans",
    "title_clean_pos": [
      "psychiatrist NOUN",
      "say VERB",
      "trans ADJ"
    ],
    "selftext_clean": "tldr psychiatrist act bigot ask uncomfortable question tell gay man today mtf pre appointment psychiatrist wrong pronoun time language word gendere weird act way say think go sexuologist diagnosis say bad idea trans people eventually accept body body problem understand trans patient eventually turn tran course tell tran fold pressure tell talk parent busy forget set appointment sexuologist answer tell want ruin body forever want protect hurt tell probably gay man throw guard romantically attract cis guy pull usual bigot bs type sui rate skyrocket people transition hrt make unable orgasm ask bunch pretty private question sex life mind underage know maybe normal psychiatrist ask question lil suprise rude dad like act totally diffrent person everytime creep",
    "selftext_clean_pos": [
      "tldr VERB",
      "psychiatrist NOUN",
      "act VERB",
      "bigot NOUN",
      "ask VERB",
      "uncomfortable ADJ",
      "question NOUN",
      "tell VERB",
      "gay ADJ",
      "man NOUN",
      "today NOUN",
      "mtf VERB",
      "pre VERB",
      "appointment NOUN",
      "psychiatrist NOUN",
      "wrong ADJ",
      "pronoun NOUN",
      "time NOUN",
      "language NOUN",
      "word NOUN",
      "gendere VERB",
      "weird ADJ",
      "act VERB",
      "way NOUN",
      "say VERB",
      "think VERB",
      "go VERB",
      "sexuologist VERB",
      "diagnosis NOUN",
      "say VERB",
      "bad ADJ",
      "idea NOUN",
      "trans PROPN",
      "people NOUN",
      "eventually ADV",
      "accept VERB",
      "body NOUN",
      "body NOUN",
      "problem NOUN",
      "understand VERB",
      "trans PROPN",
      "patient NOUN",
      "eventually ADV",
      "turn VERB",
      "tran NOUN",
      "course NOUN",
      "tell VERB",
      "tran NOUN",
      "fold VERB",
      "pressure NOUN",
      "tell VERB",
      "talk VERB",
      "parent NOUN",
      "busy ADJ",
      "forget VERB",
      "set VERB",
      "appointment NOUN",
      "sexuologist NOUN",
      "answer NOUN",
      "tell VERB",
      "want VERB",
      "ruin VERB",
      "body NOUN",
      "forever ADV",
      "want VERB",
      "protect VERB",
      "hurt VERB",
      "tell VERB",
      "probably ADV",
      "gay ADJ",
      "man NOUN",
      "throw VERB",
      "guard NOUN",
      "romantically ADV",
      "attract VERB",
      "cis NOUN",
      "guy NOUN",
      "pull VERB",
      "usual ADJ",
      "bigot NOUN",
      "bs NOUN",
      "type NOUN",
      "sui PROPN",
      "rate NOUN",
      "skyrocket NOUN",
      "people NOUN",
      "transition VERB",
      "hrt PROPN",
      "make VERB",
      "unable ADJ",
      "orgasm VERB",
      "ask VERB",
      "bunch NOUN",
      "pretty ADV",
      "private ADJ",
      "question NOUN",
      "sex NOUN",
      "life NOUN",
      "mind VERB",
      "underage ADJ",
      "know VERB",
      "maybe ADV",
      "normal ADJ",
      "psychiatrist NOUN",
      "ask VERB",
      "question NOUN",
      "lil NOUN",
      "suprise VERB",
      "rude ADJ",
      "dad NOUN",
      "like VERB",
      "act VERB",
      "totally ADV",
      "diffrent ADJ",
      "person NOUN",
      "everytime NOUN",
      "creep VERB"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "On my way out of my weekly appointment at the hormone clinic, I was told that my bill was already covered by an anonymous donor, and I was handed an LGBT themed holiday card with the message:\n\n***\"We're happy to inform you that an anonymous donor has offered to cover the cost of your hormone therapy for the next 3 months.\nThank you for being amazing!\"***\n\nIf the person who made this extremely generous donation is reading this post, I just want you to know that I'm super grateful for what you did! I was having a rough day today, and money is a little bit tight for me. I was crying in my car for like 20 minutes after I read that letter! Whoever you are, thank you so so so much! I don't know who you are, and I may never know, but I fully intend to pass the same kindness along when I can.",
    "author_fullname": "t2_nqxus5n",
    "title": "Someone anonymously paid for 3 months of my HRT appointments!",
    "upvote_ratio": 0.99,
    "ups": 1421,
    "created": 1734142738.0,
    "created_utc": 1734142738.0,
    "num_comments": 26,
    "author": "JBlooey",
    "id": "1hdspno",
    "created_datetime": "2024-12-14 02:18:58",
    "title_clean": "anonymously pay month hrt appointment",
    "title_clean_pos": [
      "anonymously ADV",
      "pay VERB",
      "month NOUN",
      "hrt ADJ",
      "appointment NOUN"
    ],
    "selftext_clean": "way weekly appointment hormone clinic tell bill cover anonymous donor hand lgbt theme holiday card message happy inform anonymous donor offer cover cost hormone therapy month thank amazing person extremely generous donation read post want know super grateful have rough day today money little bit tight cry car minute read letter thank know know fully intend pass kindness",
    "selftext_clean_pos": [
      "way NOUN",
      "weekly ADJ",
      "appointment NOUN",
      "hormone NOUN",
      "clinic NOUN",
      "tell VERB",
      "bill NOUN",
      "cover VERB",
      "anonymous ADJ",
      "donor NOUN",
      "hand VERB",
      "lgbt PROPN",
      "theme VERB",
      "holiday NOUN",
      "card NOUN",
      "message NOUN",
      "happy ADJ",
      "inform VERB",
      "anonymous ADJ",
      "donor NOUN",
      "offer VERB",
      "cover VERB",
      "cost NOUN",
      "hormone NOUN",
      "therapy NOUN",
      "month NOUN",
      "thank VERB",
      "amazing ADJ",
      "person NOUN",
      "extremely ADV",
      "generous ADJ",
      "donation NOUN",
      "read VERB",
      "post NOUN",
      "want VERB",
      "know VERB",
      "super ADV",
      "grateful ADJ",
      "have VERB",
      "rough ADJ",
      "day NOUN",
      "today NOUN",
      "money NOUN",
      "little ADJ",
      "bit NOUN",
      "tight ADJ",
      "cry VERB",
      "car NOUN",
      "minute NOUN",
      "read VERB",
      "letter NOUN",
      "thank VERB",
      "know VERB",
      "know VERB",
      "fully ADV",
      "intend VERB",
      "pass VERB",
      "kindness NOUN"
    ]
  },
  {
    "subreddit": "trans",
    "selftext": "I just got into “trouble” for using the men’s restroom (I’m FtM) at my school and my dad is on the schools side because “it’s a high school and there’s children around” (I’m 17 and have been using the men’s since I was 12-13) and that it doesn’t matter, it’s just a rule, this doesn’t affect me, and that this can’t and won’t lead to more of our rights being attacked when they already are. He’s usually so supportive but I just don’t know how to take this. I know I’m not like “in trouble in trouble” but it still hurts so fucking bad. \n\nEdit: got a vice principal to agree to help us create a YDSA chapter! Hopefully we can start moving in the right direction (:",
    "author_fullname": "t2_8wj0jz0h",
    "title": "Got told I can’t use the men’s at school anymore and my dad is backing up that. ",
    "upvote_ratio": 0.98,
    "ups": 1418,
    "created": 1733508660.0,
    "created_utc": 1733508660.0,
    "num_comments": 73,
    "author": "DemonsAreMyFriends",
    "id": "1h87pgk",
    "created_datetime": "2024-12-06 18:11:00",
    "title_clean": "tell use men school anymore dad back",
    "title_clean_pos": [
      "tell VERB",
      "use VERB",
      "men NOUN",
      "school NOUN",
      "anymore ADV",
      "dad NOUN",
      "back VERB"
    ],
    "selftext_clean": "get trouble men restroom ftm school dad school high school child men matter rule affect lead right attack usually supportive know know trouble trouble hurt fucking bad edit get vice principal agree help create ydsa chapter hopefully start move right direction",
    "selftext_clean_pos": [
      "get VERB",
      "trouble NOUN",
      "men NOUN",
      "restroom NOUN",
      "ftm ADJ",
      "school NOUN",
      "dad NOUN",
      "school NOUN",
      "high ADJ",
      "school NOUN",
      "child NOUN",
      "men NOUN",
      "matter VERB",
      "rule NOUN",
      "affect VERB",
      "lead VERB",
      "right NOUN",
      "attack VERB",
      "usually ADV",
      "supportive ADJ",
      "know VERB",
      "know VERB",
      "trouble NOUN",
      "trouble NOUN",
      "hurt VERB",
      "fucking ADV",
      "bad ADJ",
      "edit PROPN",
      "get VERB",
      "vice NOUN",
      "principal NOUN",
      "agree VERB",
      "help VERB",
      "create VERB",
      "ydsa NOUN",
      "chapter NOUN",
      "hopefully ADV",
      "start VERB",
      "move VERB",
      "right ADJ",
      "direction NOUN"
    ]
  }
]