[
  {
    "subreddit": "asktransgender",
    "selftext": "Hi! This isn’t a subject I would normally be asking about, but google isn’t giving me answers. We had thanksgiving dinner last week, and my son (21M) ate half the table. I’m not exaggerating. I watched him gobble 2 turkey legs, 2 breasts, so much stuffing, 5 giant helpings of mashed potatoes, a shit-ton of green beans, and our entire helping of cranberry sauce. It was insane. His sister watched, jaw agape. I am not making this post to police his eating habits, but I’ve genuinely never seen this before. He told me it might’ve been a side effect of T, but he’s been on T for years and this has never happened before. Semi-worried about him, but let me know if there’s nothing to be worried about! \n\nHe said it was okay for me to post, because he was also kind of unsure.\n\nEDIT: Thanks for all the replies! Found out what happened, though. Turns out he was stoned and completely forgot. What a man.",
    "author_fullname": "t2_q24phi8i",
    "title": "Son inhaled thanksgiving dinner. is this normal?",
    "upvote_ratio": 0.98,
    "ups": 1321,
    "created": 1733445276.0,
    "created_utc": 1733445276.0,
    "num_comments": 115,
    "author": "Commercial-Rip1085",
    "id": "1h7okhk",
    "created_datetime": "2024-12-06 00:34:36"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Well hi my name is Corey I'm 23 amab I had a pretty normal childhood I think....I was the fraternal twin to my brother. I never really compared myself with him as we got along really well. But my life started to change around the time of puberty. My brother developed normally but I was a late Bloomer. I was always confused about my own identity since I had the sex ed talk in fifth grade. I noticed that I didn't have the changes that many of my peers had. This was around the time I heard what transgender was. Their was this girl with the same name as me fighting for bathroom Rights in school. That was the moment I really became fascinated with the whole experience. I watched every YouTube video, timelines , make up, boy to girl etc.\n\n\n As I began to crack my egg so to speak I started to keep my hair long and paint my nails with nail polish I bought at dollar tree.. I always had a stash of girly things hidden in my room scared of being found out. I thought I was just a sick pervert.\n\n But as the years passed my family just thought I was gay. I was always flamboyant since I was younger so they were sort of excepting. As I gotten my first job at a major retail store during my last year in highschool 2019.  I began to buy more and more feminine clothes then I dyed my hair burgundy red. Mixing that with having to wear a mask most people didn't think I was a man ironically getting mis gendered in embarrassing ways. Customer's would say that a woman helped them then my coworker's would correct them as I came back to help. This really made me feel wonderful hearing she and her then swiftly getting stabbed in my heart at my coworker's words. \n\nThat was when I started hrt. Then I got scared of how fast the changes happened so I stopped treatment.  Trying to make myself be as masculine as my brother. I began to get into sports and helping him with his car. But I felt like I was going against my nature. So these last few months I have begun to secretly transition again... Mostly due to me getting my first apartment finally away from my family. \n\nSo I have been really happy with how it's going. But then I got my first tattoo recently and it wouldn't heal so I went to the dermatologist and found out that I have psoriasis and they prescribed me humira a biologic to help with my skin... But I had to get a full panel of blood work. Before I could get my prescription. Then I went back to my dermatologist for my follow up appointment and for them to show me how to use the injection properly.\n\n That's when they ask me for my preferred pronouns probably because I was dressed pretty fem and I let them know about my hrt. That's when my dermatologist asked me why I was on it. I said that I was transitioning she then asked me if it was a typo because it said estradiol then she said that was strange for a biological Female... I then stated that I was born male at birth she looked at me confused then as we discussed different things she then came to the conclusion for me to get a chromosome test done and Lord behold I am intersex female and my parents knew about it and never told me... Here I am thinking I'm going through this wholesome process of self discovery then bam the answer to the feelings about my own identity and why I always felt off.\n\n I really can't tell you how much this revelation has changed how I feel about myself.. I am for all intensive purposes. Female not just something in my mind but my entire being. Now I have even greater issues because I don't know if I can identify as trans but I am transitioning.... I really don't know what I should do moving forward?\n\n(*every one's experience is valid I was not referring to it just being in anyone's mind just how I felt)\n\nUpdate: so I just had an appointment today with a specialist. I was formally diagnosed as a pseudo female hermaphrodite. Ps I don't like that terminology\n\nAlso was diagnosed with CAH : congenital adrenal hyperplasia.  Which is why I had some minor male puberty development...\n\nI also want to say thank you All for your support and suggestions.  I was and still processing all this new information about my body and am in the process of figuring out my next steps...\n\nI will start identifying as both trans and intersex.. mostly because it's easier to just tell them I'm trans than having to explain something I'm still confused about myself. I already have had issues discussing this stuff with my family. Ps I'm not talking to my parents until we can all go to therapy.",
    "author_fullname": "t2_7szjci18",
    "title": "I just found out that I'm biological girl!!!!",
    "upvote_ratio": 0.97,
    "ups": 1299,
    "created": 1735961407.0,
    "created_utc": 1735961407.0,
    "num_comments": 108,
    "author": "cjwolf02",
    "id": "1ht5ang",
    "created_datetime": "2025-01-04 03:30:07"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Was out today and realized I forgot to bring anything with me. Total panic mode, but then a trans girl I’ve seen around noticed and handed me a tampon from her bag. She said she always keeps one just in case. I was so grateful. Such a simple but kind gesture that made my day. Thank you so much for helping me out! 💖",
    "author_fullname": "t2_1e2giyogro",
    "title": "Shoutout to the trans girl who came through with a tampon!",
    "upvote_ratio": 0.97,
    "ups": 1075,
    "created": 1733796442.0,
    "created_utc": 1733796442.0,
    "num_comments": 43,
    "author": "LonelyTasha",
    "id": "1haqyqt",
    "created_datetime": "2024-12-10 02:07:22"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "My (currently) boyfriend has been drunk several times before, and often mentioned how they want to be a woman, they identify as a femboy as of writing this. I've generally gotten the impression that you shouldn't force someone to come out, but they haven't been happy with themselves or their body. I want to ask you people about whether trying to guide them would do more harm than good. \n\nAdditional quotes from my partner: \n\"Man I dunno, I wanna be a girl so bad\" \n\"Yesterday I had to fill out a document and they asked me 'What do you identify as: Male, Female or other' and I struggled with not crossing female 😭\" \"Dang I wanna be a girl so bad, I mean look like a girl\nUhhhh as in more feminine\" \n\n\nEdit: My partner has essentially renamed themselves \"Yuki\" because \"What I like about Yuki is that it's relatively neutral, so even if I decide to become trans, I can keep it\" \n\nEdit 2: OH NO HEA FOUND THE POST\n\nEdit 3: He's going by gender fluid now! \n\nEdit 4: She's beginning to go by female pronouns now! ",
    "author_fullname": "t2_u3axcci",
    "title": "My partner has got drunk and wanted to be a girl",
    "upvote_ratio": 0.98,
    "ups": 962,
    "created": 1735444368.0,
    "created_utc": 1735444368.0,
    "num_comments": 111,
    "author": "Nars_of_whal",
    "id": "1hong9g",
    "created_datetime": "2024-12-29 03:52:48"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hello, this is the first time I'm posting in this sub, hope you're happy to have me. I've never interacted with a lot of lgbt people before, I've been neutral to you guys to be honest, hope that doesn't come off as rude, but I'm willing to learn.\n\nI've been straight my entire life. Young, old, middle-age, doesn't matter as long as it's a she. Me and my girlfriend have been dating for a few months now, and I find her to be one of the best things to happen to me. She's funny, sweet, sassy, smart, and kinda wholesome.\n\nLike, one time she went to one of my amateur boxing bouts, I took a pretty nasty shot to my ribs (yeah, I lost that fight 😭) and I was limping afterwards and my lip was bleeding. She wouldn't leave my side no matter what, and even put my arm around her shoulder to help me move around. She scolded twice for forgetting to study for two tests, but let me cheat off her paper 💀\n\nI never really knew she was trans, to me she's a normal girl, she looks like a pretty girl, she acts like a girl, and she sounds like a girl. My God, the doctor who was responsible needs a big raise. She always squieks when I sometimes slap her behind playfully.\n\nSo, how did I find out she was trans? Her older sister told me. It was a huge shock, because I always thought that the little boy in her family pictures was her older brother who died, but nope, that was her.\n\nWhen I confronted her about it, she started to tear up and ran away, I just stood there like a moron dumbfounded. Her sister called me, my gf blew up at her. Sister told me that gf never told me because she was terrified at how I'd react and she was ashamed. Why would she be ashamed?\n\nIt's been a day now, and she's been avoiding me. Her sister told me to give her some space, cuz she'll talk to me eventually. I don't really care about what sex she was born as, I love her, that's what I care about. Ngl, I still find her hot.\n\nEDIT: I apologize for sounding gross. Thank you for the advice. I mean no ill intent, I promise. As for how I confronted her, we were talking one day and I asked her \"that little boy in the pictures at your house, that's you, right?\" and then it extended from there.\n\n**UPDATE:** She texted me now! 😭🙌 we're meeting up tomorrow! I'm gonna get her flowers",
    "author_fullname": "t2_906etlmwa",
    "title": "So, I found out that my girlfriend is trans and now she's currently avoiding me. I honestly find it hot. What do I do?",
    "upvote_ratio": 0.92,
    "ups": 895,
    "created": 1734583341.0,
    "created_utc": 1734583341.0,
    "num_comments": 141,
    "author": "Streinheir",
    "id": "1hhl0q7",
    "created_datetime": "2024-12-19 04:42:21"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I'm a 55 year old divorced dad. My 19 year old son just came out to me as trans. He gave me a card and asked me to read it when I got home. I texted her back and told her that no matter what, I'll always love her, and what could I do to make it easier for her. She hasn't told my ex or her (my child's) brother yet. It's a lot to process and I want to do things the right way for her. Any advice would be appreciated.",
    "author_fullname": "t2_5e254",
    "title": "My son just came out to me as trans I'm a 55 year old divorced dad.",
    "upvote_ratio": 0.98,
    "ups": 855,
    "created": 1735240777.0,
    "created_utc": 1735240777.0,
    "num_comments": 84,
    "author": "rudedog4",
    "id": "1hmvogl",
    "created_datetime": "2024-12-26 19:19:37"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Someone recently posted somewhere else that he (a straight, cis man) met a beautiful woman at a bar and they kissed in a booth and had a really good time. They exchanged numbers, then she told him she was trans. He is now asking other men if it should be a law that trans women have to disclose the fact that they're trans before kissing someone, because he is now \"disgusted\" with the whole experience. \n\nObviously this is blatantly transphobic, but they genuinely don't view it that way (most likely because they have little to no experience with trans people). I am not trans, but I wanted to know how you all viewed this scenario and how you approach these things with people in real life knowing that there are people who think this way.\n\nFrom where I stand as a gay, cis man, I genuinely wouldn't have a problem with kissing someone and enjoying my time with them and then finding out he's a trans man. Like, why would I care? All we did was kiss, and I literally enjoyed it? So why would I suddenly change my mind just because I found out he's trans? He still looks and acts exactly like the hot guy I thought he was back when I was kissing him, and that's still how I view him, even if I now know he has a vagina. So I seriously don't get it whenever straight men like the one who posted that are \"disgusted\" afterwards. \n\nOther straight, cis men in the comments are saying it's akin to sexual assault and/or coercion because he was manipulated/deceived by her. I don't think that counts as deception at all. He pursued \\*her\\* because he thought she was attractive. He enjoyed kissing her the whole time. She did everything right, before they actually went home together and got sexual she told him she was trans so that he knew what to expect. Then he changed his mind and has since been \"disgusted\". I don't know how to tell these people that, no, you were not \"lied to\" or \"deceived\" by her. Gender and sex aren't the same thing, and the fact that you confuse cis and trans women literally proves that. So if you were attracted to \\*her\\* as a person and now you're not solely because you found out she's trans, that doesn't mean she \"deceived you\". \n\nDo you know what I'm trying to say here? I need someone to put this into better words than me. Why does it bother me that straight, cis men are calling this \"deception\"? And what exactly are they so disgusted by? The OP of that post literally said he is totally fine with trans people and treats them with respect, but I feel like that can't be true if he was disgusted by that experience.",
    "author_fullname": "t2_n37cv6fm",
    "title": "Straight, Cis Men Finding out a Woman is Trans",
    "upvote_ratio": 0.96,
    "ups": 808,
    "created": 1733735025.0,
    "created_utc": 1733735025.0,
    "num_comments": 238,
    "author": "SzayelGrance",
    "id": "1ha5qg7",
    "created_datetime": "2024-12-09 09:03:45"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’ve been involved in the transgender community for several years now, and it seems like lately almost nobody supports trans ppl anymore?  Maybe Im just becoming more aware of it, but Ive seen an exponential increase in people blatantly saying they think trans people are pervs or should die or whatever.  Its incredibly disconcerting and I fear for the future of our healthcare, societal standing, etc.",
    "author_fullname": "t2_iaadv5ydo",
    "title": "Does literally everyone hate trans people now?",
    "upvote_ratio": 0.95,
    "ups": 792,
    "created": 1734553930.0,
    "created_utc": 1734553930.0,
    "num_comments": 339,
    "author": "PriorityNo6729",
    "id": "1hhazro",
    "created_datetime": "2024-12-18 20:32:10"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Disclaimer: I am young and fully aware that this story is, in some ways, a result of youthful inexperience. Feel free to laugh at me for this, just please be kind.\n\nI (21ftm) was at a party where I met a friend of a friend (35m) and we got to talking. Went out to his truck for a cigarette, and in talking about being queer (he expressed he was bisexual with a preference for women) I told him I was trans. He expressed that it would be \"fun to get me off\" and spoke to me as a man the whole time. He talked a bunch of shit about how he can go for hours and his dick would change my life, but I honestly just wanted some good sex, so I went and met him at his place.\n\nWithin the first couple of minutes, he told me to take my binder off and \"show him my t*ts.\" Throughout intercourse, he called me \"good girl\" multiple times and told me I \"sing like a woman.\" He also said at one point \"I can't see your beard in the dark, so that's a plus.\" He did not touch my clit one time and I came nowhere close to orgasm. He fell asleep shortly after his orgasm, and I left feeling angry, disgusted, and completely unsatisfied.\n\nI want to make it very clear that I understand each person is responsible for their own orgasm during sex, it's no one's job to make you cum. I also understand that at any point I could have called stop, but I felt a sense of obligation once I had started. My question for fellow trans people is this: is this normal? Is it normal to be suddenly misgendered during sex by someone who has been fully respectful of you up to that point? Is it something you have to just accept if you want to sleep with cis people? Seriously considering going t4t only because of this. \n\n\nEDIT: I have evidently been fed bad information regarding the \"each person is responsible for their own orgasm\" statement, so I retract that in full. Thank you to everyone for all of your advice and support!",
    "author_fullname": "t2_150aahbjfk",
    "title": "I (ftm) tried having sex with a cis man and it was the worst sex I've ever had. Is this normal?",
    "upvote_ratio": 0.96,
    "ups": 748,
    "created": 1734328841.0,
    "created_utc": 1734328841.0,
    "num_comments": 192,
    "author": "squirrelyd303",
    "id": "1hfcobf",
    "created_datetime": "2024-12-16 06:00:41"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "So my daughter is transgender, and we live in a very strict neighbourhood here in QLD, ozz , how should i support her? Im a very supportive father- and she, thought i wouldn’t support her, since i am a skinhead, she is very happy, but i dont know how to support transgender people, she is a boy to girl transgender, what should i do?",
    "author_fullname": "t2_19c0k2afql",
    "title": "My daughter is transgender",
    "upvote_ratio": 0.98,
    "ups": 625,
    "created": 1734695052.0,
    "created_utc": 1734695052.0,
    "num_comments": 128,
    "author": "Iloveviolencex",
    "id": "1hii1mk",
    "created_datetime": "2024-12-20 11:44:12"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Im a cis, straight female, who has recently been seeing a trans guy. I was telling one of my friends about how good my night was, and how we went down on eachother (im in college so i do kiss and tell to my close friends) and she says, “wait, you ate pussy?” And i was like “well no” because thats not REALLY what i did, i kinda just gave head like i would to any other guy. \n\nShe was telling me that she believed that i thought i was straight, but i wasn’t actually straight. I said i would never be with a girl as im not attracted to women. She said “would you be with a masculine lesbian” and i said “no” and she says, “is that not what (my partners name) is? Its really annoying because my partner is a MAN. \n\nthis girl isnt outright disrespectful or rude, but for some reason does not see this guy as a man like i do. We havent known him pre transition and its really annoying for his gender and my sexuality to not be valid to her. She doesn’t have a problem with me seeing this guy, she just, doesnt see him as a guy. She doesnt misgender him (i mean she uses the correct name and pronouns) but i just dont understand why she doesnt treat him like if i was seeing anyone else. \n\nI know theres not much i can do here, im just wondering if anyone has any tips on trying to change her mind? Or should i not even bother",
    "author_fullname": "t2_1dy22azcyr",
    "title": "Why do people not see me as straight?",
    "upvote_ratio": 0.96,
    "ups": 592,
    "created": 1733608529.0,
    "created_utc": 1733608529.0,
    "num_comments": 85,
    "author": "BeneficialYam7122",
    "id": "1h93anh",
    "created_datetime": "2024-12-07 21:55:29"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "My friend is a trans woman, and I am in love with her.  I’m looking for advice on how to win her heart. I want to support and care for her for the rest  of my life... Do you have any advice on how to open up to her and build a romantic relationship? What are some dos and don’ts? ",
    "author_fullname": "t2_1eedls5bob",
    "title": "Lesbian cis woman in love with my trans friend... Wha",
    "upvote_ratio": 0.97,
    "ups": 588,
    "created": 1734635451.0,
    "created_utc": 1734635451.0,
    "num_comments": 119,
    "author": "Qwertytrbr",
    "id": "1hi0i9c",
    "created_datetime": "2024-12-19 19:10:51"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "So I (38ftm) regularly attend trans-inclusive adult play parties. When I attend I am usually the only ftm, but I don’t mind. I just love attending to get my needs met. \n\nI have always been friendly with everyone at the events and I even thought I was making friends with a bunch of the trans women. \n\nWell the last two events, I couldn’t shake this feeling that all the women were giving me the cold shoulder. Later on I asked one of them what was going on and she told me that a bunch of the trans women don’t like me because they say I steal all the men from them. \n\nAnd a few of the more passing women, really really don’t like me because I have not had top surgery yet (I am planning to in 2025 🤞🏼🤞🏼🤞🏼), but they also don’t like the trans women that are at the beginning of their journeys. The criticism from the women that have had the most surgeries seems like bs because every has their own gender goals AND every one has to start somewhere. You don’t automatically wake up fully “transitioned” whatever that means. \n\nBut anyway, I’m so sad to find out this information. I really like the women in my community AND I want to be in community with them… I’m not sure if that makes sense. I am not competing. At these adult parties it’s about having consensual fun, and I want everyone to have a good time. \n\nI’m really sad that my actions are being taken negatively..\n\nI don’t know what to do next. Any advice?",
    "author_fullname": "t2_10xungbkff",
    "title": "FTMs clashing with MTFs at adult play parties",
    "upvote_ratio": 0.94,
    "ups": 568,
    "created": 1735628892.0,
    "created_utc": 1735628892.0,
    "num_comments": 107,
    "author": "SignificantFreud",
    "id": "1hq9d8r",
    "created_datetime": "2024-12-31 07:08:12"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Sorry for the language but I'm so so so god damn tired of grifters like JK \"Shitty McNovelist\" Rowling harping about trans people. Omg, I don't care. I don't fucking care. Seriously. I don't care. I don't care if they're in sports, I don't care if theyre in the bathrooms. I. Don't. Care. \n\nI'm not afraid of assaulted by trans people. Cis people do that on a daily fucking basis. Assholes are out there, cis, trans or not.\n\nI. DON'T. CARE. \n\nFUCK YOU JOANNE. YOUR BOOKS SUCK. YOU CAN'T FUCKING WRITE FOR SHIT. YOU NAMED YOUR ASIAN CHARACTER CHO FUCKING CHANG. YOU MADE THE BANKERS GOBLINS. YOU'RE JUST A MEDIOCRE FUCK WHO MADE IT BIG. FUCK YOU\n\n\n",
    "author_fullname": "t2_7dwja34d",
    "title": "WHO gives a fuuuuuuuuuuuuuck about who is trans or not. ",
    "upvote_ratio": 0.95,
    "ups": 558,
    "created": 1735704688.0,
    "created_utc": 1735704688.0,
    "num_comments": 83,
    "author": "Acceptable_Regular_5",
    "id": "1hqvclb",
    "created_datetime": "2025-01-01 04:11:28"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I know that they all have their own reasons, but doesn’t it go against the teachings of christ to hate a group of people for no reason?  Obviously Im not talking about all christian people, but a very VERY large group of them.  It makes me really sad how the teachings of a man who only wanted peace can be twisted in a way to bring hate to the world.",
    "author_fullname": "t2_38mrki03",
    "title": "Why do christians hate trans people?",
    "upvote_ratio": 0.96,
    "ups": 538,
    "created": 1734032761.0,
    "created_utc": 1734032761.0,
    "num_comments": 444,
    "author": "BuilderHaunting8754",
    "id": "1hctirc",
    "created_datetime": "2024-12-12 19:46:01"
  },
  {
    "subreddit": "asktransgender",
    "selftext": " Today I decided to hang out my sister to both humor her and try reconnecting with her in some meaningful way (due to me generally being distant from her and most of my family due to their ignorance and downright transphobia toward me). For a bit, I felt comfortable with her and I thought I might be able to actually open up with her later, but right when got over to her apartment (where she lives with her husband and child) I immediately felt a sense of dread and almost horror as I saw a big Trump 2024: Take Back America flag hanging on the window inside.\n\nIt completely doured how much potential I saw for their to still be a chance to bridge the gap between my sister and finally find an ally in my family somehow. It also didn't help that the first thing I saw when I got their was her husband playing Call of Duty on his PS5 and then (a bit later) some yelling at his kid for getting a bit too excited to see me their and acting too hyper (he's a very actively hyper kid overall). \n\nAll of this is to say, I don't really know what to do. My sister asked me if I was alright at certain points due to me phasing out, and I just told her I was alright. They weren't hateful towards me (neither her or her husband), nor did they seem to draw attention to it or bring it up in any way. I even tried taking a picture to show to one of my friends, which my sister seemed to catch, and she seemed to have no real idea what I was doing. I'm really confused as to what I can do here, since on the one hand we still had fun today, but she clearly still sees me as her brother (not bothering to even follow-up on any previous vein attempt to try to improve on our relationship through this divide). \n\nI think the most important question from all of this is if should bring this up to her or not.",
    "author_fullname": "t2_51osvj2m",
    "title": "I went to my sister's apartment and saw she had a Trump 2024 flag on the the window",
    "upvote_ratio": 0.96,
    "ups": 530,
    "created": 1734847546.0,
    "created_utc": 1734847546.0,
    "num_comments": 207,
    "author": "YourHyenass",
    "id": "1hjsmsw",
    "created_datetime": "2024-12-22 06:05:46"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I recently saw a video of trump reiterating his anti trans stance, and his plans to remove trans people from military service and to \"end the transgender lunacy\". Is there any hope to keep our access to gender affirming care? Is there going to more of a push of people into diy? I just wish all my trans and nb siblings safety and security this next 4 years. I'm personally plan on trying to help anyone I can near me. Not really sire what I want out this post, except maybe to vent my frustration with the current clime in the US towards us.\n\n-Ash",
    "author_fullname": "t2_8lyy73963",
    "title": "Any thoughts on Trumps recent day one announcement? ",
    "upvote_ratio": 0.97,
    "ups": 534,
    "created": 1734963069.0,
    "created_utc": 1734963069.0,
    "num_comments": 234,
    "author": "femdaedra",
    "id": "1hkojeo",
    "created_datetime": "2024-12-23 14:11:09"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Today I went to a women's bathroom at WDW. After I closed the stall and sat down, someone knocked on my door. I had my headphones on, but I'm pretty sure they asked \"are you a guy?\"\n\nAnd you know what I did? Nothing. I just sat on the toilet, did my business, washed my hands, and left. Honestly, some of these people are itching for a confrontation. The best way to fight them is to deprive them of that. ",
    "author_fullname": "t2_1qdpabd0",
    "title": "Bathroom experience in Florida",
    "upvote_ratio": 0.97,
    "ups": 512,
    "created": 1735435963.0,
    "created_utc": 1735435963.0,
    "num_comments": 100,
    "author": "MrSFedora",
    "id": "1hokv8m",
    "created_datetime": "2024-12-29 01:32:43"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I know cis men don’t want to transition or anything, so I know wanting to transition is a pretty good sign that I’m trans, but I feel like guys talk about being girls all the time in media and stuff. I feel like I hear jokes like, “it would be so sick to have a pair of boobs,” a lot, and I’ve just grown accustomed to the idea that guys aren’t generally repulsed by the idea of becoming women. I’ve also sort of observed that most people don’t fully like the person that they are. Maybe I’m way off, but I feel like most guys would choose to be women if they didn’t have to go through all of the steps of transition and if they could reverse it at any time.",
    "author_fullname": "N/A",
    "title": "Do cis men really not want to be women at all?",
    "upvote_ratio": 0.94,
    "ups": 506,
    "created": 1735577507.0,
    "created_utc": 1735577507.0,
    "num_comments": 235,
    "author": "N/A",
    "id": "1hprj92",
    "created_datetime": "2024-12-30 16:51:47"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "So shortly after i transitioned i decided to make myself look as female as possible so I started becoming a plastic bimbo. I’ve never felt at home inside my body until i started having lots of plastic surgery but now one of my “friends” told me that my behavior is transphobic ",
    "author_fullname": "t2_xgh8avhhc",
    "title": "Is it hurtful for other trans people that I turned myself into a bimbo after transitioning?",
    "upvote_ratio": 0.91,
    "ups": 443,
    "created": 1735476373.0,
    "created_utc": 1735476373.0,
    "num_comments": 119,
    "author": "Ill-Conference5019",
    "id": "1hovbyp",
    "created_datetime": "2024-12-29 12:46:13"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I mean, let's face it. The fraction of the population that is transgender is so small, that the rights of transgender people persisting are entirely dependent on people who have no personal stake on transgender rights. Considering the wave of far right political activity that has been spreading to a lot of countries, I can't see how it wouldn't cause a lot of existential dread about your existence.\n\nEdit: For clarification, came to the conclusion that I'm a transgender woman somewhat recently. I'm myself not all that happy about this aspect transitioning. I am not trying to be condesending.",
    "author_fullname": "t2_kl2dor6x",
    "title": "How do transgender people deal with the existential dread of being aware how fragile their position in society is?",
    "upvote_ratio": 0.95,
    "ups": 425,
    "created": 1735287946.0,
    "created_utc": 1735287946.0,
    "num_comments": 159,
    "author": "totesshitlord",
    "id": "1hnahle",
    "created_datetime": "2024-12-27 08:25:46"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "So Trump proudly exclaimed that he would end trans healthcare for minors “with a stroke of a pen”.  And Congress is currently working on a bill that would end trans healthcare for EVERYONE.  I know they have the votes so it’s not a matter of if, but when.  Having said that, how quickly can this be enacted?  Is it signed and now you don’t have healthcare or will this only be effective 1/1/26 kind of deal?  I’m worried bc I have BA scheduled and approved for March then SRS for Nov 25.  Are those now in jeopardy?  ",
    "author_fullname": "t2_vfmz1w9s",
    "title": " How fast will Trump executive order end trans healthcare?",
    "upvote_ratio": 0.94,
    "ups": 421,
    "created": 1735054131.0,
    "created_utc": 1735054131.0,
    "num_comments": 238,
    "author": "ramenchicka",
    "id": "1hlftgn",
    "created_datetime": "2024-12-24 15:28:51"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Not a damn thing. \n\nThere is so much weight placed on being a pretty passing young thing that so much life is lost just accepting, living as a normal, everyday looking kind of woman out in the world. As someone who has always loved and appreciated their friendships with girls, with women, who has had plenty of close and intimate relationships with women of all ages, as a worker who has chosen a field that has kept me in close proximity to women, who has served women in a front line kind of way throughout most of my working life, I know that there are precious few of us that would truthfully be considered world class beauties, no matter how we look at it or how we think about ourselves. It is what it is, and no amount of imagining will change that. The Bell Curve places most of us right in the middle of things. Not beautiful, not ugly, just who we are. Normal, everyday kinds of women.\n\nI know how women look at the crack of dawn, at the end of the day and know, from being there right alongside them, day in and day out, that most do their best to keep it pulled together, and some do it all the time, knowing that time, age, and societal expectations do a number on us all and know that there is not a damn thing we can do about it but throw money at it to try to slow it down. Most of us know that how we've lived our lives has colored our looks. Most of us know that we are never going to be Tik Tok stars, be well paid influencers, be splashed on the cover of Vogue. Most women I know make due with their looks, fret about those looks and know, without a doubt, that other women are doing the same. It is a vicious world and the more we do to back away from the false expectations of what women are supposed to look like, the better. But in so many ways we can't. It's a hardcore treadmill that we can't get off of. \n\nSome of us are just ugly old women. Can't be helped, we just arrive here at the bidding of life. I am almost 67. No way I can worry about that beauty thing. No amount of make up is going to get me a partner or land me a movie deal. Really, what is the problem folks have with us ugly old women? Afraid of your future? Girls, embrace it. In the meantime, while you are waiting to be a crone like me, cultivate self love, develop a sense of style, be courageous and learn not to care what others think about how you look. Beauty is only skin deep. And ours is only as deep as the life we've lived. Love, Cat",
    "author_fullname": "t2_5cnmt9qoq",
    "title": "What is wrong with being an ugly transgender woman?",
    "upvote_ratio": 0.97,
    "ups": 419,
    "created": 1734297778.0,
    "created_utc": 1734297778.0,
    "num_comments": 98,
    "author": "CatoftheSaints23",
    "id": "1hf2qsv",
    "created_datetime": "2024-12-15 21:22:58"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’m really curious how a transgender bathroom ban would actually be enforced. Let’s say a state like Ohio forbidding transgender people from using the bathroom matching their identity. How would that even work? For example, if someone is MtF, has changed all their legal documents, undergone surgeries, and passes 100%, how could they realistically enforce it? Are they going to randomly check everyone’s IDs or dig into people’s past records just to verify their gender? And what about cisgender people who might not conform to gender norms—would they get harassed too? It just seems impractical and invasive to enforce. Thoughts?\n\nThis also goes for the Nancy Mace bill. Let's assume there's a transgender politician who doesn't tell anybody that they are transgender wouldn't the bill have zero effect.",
    "author_fullname": "t2_1dy4w8fa1q",
    "title": "How would a transgender bathroom ban even work in practice?",
    "upvote_ratio": 0.95,
    "ups": 387,
    "created": 1734477251.0,
    "created_utc": 1734477251.0,
    "num_comments": 172,
    "author": "PurePin6351",
    "id": "1hgnov1",
    "created_datetime": "2024-12-17 23:14:11"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "(Or, at least more transphobic than other typical mainstream center-left media sources?)\n\nI just noticed today that the New York Times is flagged as red on the Shinigami Eyes extension. I visit the site somewhat frequently, so it must have been changed within the last week or so.\n\nDoes anyone know what this is referring to? Have they done or published something recently? Google has not been much help.\n\nEDIT: Wow thanks so much for all the information everyone! That's super disappointing... I was debating whether to get a subscription or not once my free student one expires, this definitely seals the deal.",
    "author_fullname": "t2_rd6qlfn",
    "title": "Is The New York Times transphobic?",
    "upvote_ratio": 0.95,
    "ups": 364,
    "created": 1734142887.0,
    "created_utc": 1734142887.0,
    "num_comments": 73,
    "author": "nancythethot",
    "id": "1hdsr9p",
    "created_datetime": "2024-12-14 02:21:27"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "My grandpa's mom wanted a girl and he looked feminine in his youth, so she forced him to grow up as a girl. He is still traumatized from that experience. Unfortunately, even though he knows what it's like to live in a gender you hate, he is still very transphobic. He thinks all trans people should be thrown to jail. What can I do to make him more empathetic to trans people?",
    "author_fullname": "t2_s8l8tq48",
    "title": " My grandpa grew up with reverse gender dysphoria. How to make him less transphobic? ",
    "upvote_ratio": 0.96,
    "ups": 363,
    "created": 1734096558.0,
    "created_utc": 1734096558.0,
    "num_comments": 34,
    "author": "Straight_Mission_381",
    "id": "1hdc7jq",
    "created_datetime": "2024-12-13 13:29:18"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I suck at social cues so I’m not sure if it’s a bit or not, but are people really putting progesterone up their ass?",
    "author_fullname": "t2_3hx91uv0",
    "title": "Are people really boofing progesterone?",
    "upvote_ratio": 0.97,
    "ups": 335,
    "created": 1734973186.0,
    "created_utc": 1734973186.0,
    "num_comments": 130,
    "author": "zlltt",
    "id": "1hks308",
    "created_datetime": "2024-12-23 16:59:46"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I'm not too much into the loop of transgender identity and everything so bare with me please.\n\nYears ago, I've had frequent thoughts of having a vagina, but was under the idea that you needed to be transgender and go through HRT (or another method that I'm unaware of).\n\nI started thinking about this again this year and have found out that you could get a vaginoplasty. This was news to me!\n\nImagining myself with a vagina but still as a male causes butterflies in my stomach and makes me wish I really had one.\n\nBut to keep things short, my question is: Is it normal to feel like this? Would I be considered trans? I feel alone and don't know how to even begin and feel very un-knowlesgable in this.\n\n.\n.\n\nEdit: Thank you everyone for all the comments and advice. I'm more knowledgeable about gender and understand that it's not about what you have physically but who you feel you are, and it's a diverse subject. I think I found a label for myself (and if it's not correct, please correct me) but demiboy seems to fit me most. I was extremely unknowledable about the lgbtq+ community.",
    "author_fullname": "t2_eu20f9h5",
    "title": "Cismale wanting a vagina, but still identifies as a male.",
    "upvote_ratio": 0.87,
    "ups": 333,
    "created": 1733685710.0,
    "created_utc": 1733685710.0,
    "num_comments": 82,
    "author": "AwaitedArrow",
    "id": "1h9qh9a",
    "created_datetime": "2024-12-08 19:21:50"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "My son came out to me last night as trans (aged 12). Hes not sure about what to do just yet as hes still finding himself. Hes already come out to his friends and theres been signs for a couple of months in terms of trying to grow his hair out, shaving his legs, wanting an handbag to carry around and previous christmases wanted tea sets as gifts and such.\n\nIve seen a lot of similar posts on here but the kids are older and the advice is uaually quite sound and obvious in terms of just being supportive and offer mental and medical support if wanted. I understand that suicide and mental health concerns can sky rocket if hes not supported. Im more than supportive although im quite a pragmatic old school bloke. Didnt throw up any resistance when he told me and just told him that it was ok but it was clear that he had been talking to his mother about this.\n\nHes also autistic and adhd and i dont want to start with anything medical while hes pre pubescent and its early days but any advice would be greatly appreciated as my head is spinning. \n\n\nEdit-\nWere uk based so no puberty blockers are out of the question as of 2 days ago (fantastic timing right). Theyre not sure about the medical transition yet as theyre still young and dont know what to do yet. Also yes i know ive misgendered them in my earlier bit, its a habit im going to have to break.\n",
    "author_fullname": "t2_m3vqw",
    "title": "My son cane out as trans (aged 12)",
    "upvote_ratio": 0.92,
    "ups": 327,
    "created": 1734164693.0,
    "created_utc": 1734164693.0,
    "num_comments": 187,
    "author": "dohraymeh",
    "id": "1hdyguf",
    "created_datetime": "2024-12-14 08:24:53"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’m sure many have seen [Jael Holzman’s excellent reporting](https://www.rollingstone.com/politics/politics-features/trump-trans-health-care-republicans-democrats-1235198473/) on Republican efforts to use the anti-abortion Hyde Amendment to force hospitals and other clinics that receive federal funds to stop offering trans healthcare. It’s not certain that this will come to pass, but if it does, what other options exist for HRT?\n\nThere are of course specialized clinics providing abortions outside of hospitals. Which such places exist that could prescribe hormones? I know Planned Parenthood used to offer HRT, do they still and will that remain a possibility? It seems to me now is a good time to think about changing doctors in advance of something like this happening. Get away from hospitals and toward specialized private practice where possible.\n\nDoes anyone have insight on this?",
    "author_fullname": "N/A",
    "title": "Hyde Amendment as HRT Ban",
    "upvote_ratio": 0.98,
    "ups": 325,
    "created": 1733930747.0,
    "created_utc": 1733930747.0,
    "num_comments": 34,
    "author": "N/A",
    "id": "1hbvxbk",
    "created_datetime": "2024-12-11 15:25:47"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "TW: Mentions of suicide, Transphobia, bullying, violence, mental health struggles, dysphoria\n\nI wrote a coming-out post that I'm still pretty scared to share with friends/family.  I would love to hear any thoughts on improvements or encouragement.\n\n[https://open.substack.com/pub/violetsays/p/dear-society-fuck-you](https://open.substack.com/pub/violetsays/p/dear-society-fuck-you)\n\nIf you don't want to click the link, here is the full text:\n\n\\-------------------------------\n\n# Dear Society: Fuck You.\n\nWhen I was born, you declared me **a boy**.\n\nWhen I was six years old, you knew I was different and so you bullied me relentlessly.\n\nWhenever I expressed myself in a way you deemed non-conforming—such as crossing my legs, speaking the wrong way, or wearing the wrong thing—you called me a faggot or a pussy. It didn’t stop at verbal abuse; it escalated to physical violence. I would come home from school with large bumps protruding from my head after having my skull slammed into the concrete walls of the hallway.\n\nNo one was there to protect me; that much was clear. It was my fault after all. I was acting in a way that deserved punishment. I needed to adapt or I would not survive. So, I became a chameleon. I acted like the exact person you thought I should be.\n\nEach decision I made was never about what I wanted. It was about making my peers happy, making my parents happy, making my teachers happy. It was about making *you* happy.\n\nYou laid out my whole life plan even before I was born. First, I would go to school where I would get the best grades. These grades would let me get into the best college. In college, I would get the best grades so that I could get a job at the best company. Then I would work for this company as hard as I could. I would do such a good job so that I could get promotions and raises so that I could make as much money as possible. With that financial stability I could attract a woman who would have kids with me. My kids would then have the same set of expectations placed on them as you placed on me and the process would complete anew.\n\nI was such a good fucking kid. I listened and obeyed like no-one else. I got the best grades, went to the best school, made the most money. I did everything you told me to do.\n\nI’m not sad. I’m not depressed. No, that is not a tear, I AM NOT CRYING. Those feelings are for the weak. I am the embodiment of success.\n\nSo, the years go by, and I get older and older. They seem to be going by so fast, each one blending with the last. Some of the people and places change, but the story remains the same. At some point it hits me that I am going to die one day. I am going to die without ever having lived. And I knew, much like when I was a little child, that no one was coming to save me. I was going to have to save myself.\n\n# Confronting Reality\n\nThese last few decades, I lived my life for you. It has brought me so much suffering. As a child, I thought nothing could be worse than your lack of acceptance of me. I thought nothing could be worse than the verbal and physical abuse. And now, fully realizing the extent of the sacrifice I made, the sacrifice of myself and everything I am, I know that I would rather die than live for one more day under your terms.\n\nYou tell me that I’m mentally ill, that I have a mental health condition, that I’m crazy, that I’m denying reality. The entire foundation of my life thus far is built upon lies. It is built upon me pretending to be something for you. And you want to talk about denying reality?\n\nYou want me to pretend that I like wearing shorts more than wearing a skirt? You want me to pretend that I like wearing suits better than dresses? You want me to pretend that I like being dominant more than submissive? You want me to pretend that I’d rather penetrate my partner than be penetrated by them? You want me to pretend like I don’t want long flowing hair? You want me to pretend that I like having facial hair?\n\nWhy should I pretend this? Who is denying reality—me or you?\n\n# Sex & Gender\n\nI know I was born with a penis. I know that the cells in my body have XY chromosomes. I also know that I love to sing, and sew, and cook, and show emotion, and dress and act in a way that feels good to me.\n\nYou tell us that because we were born a certain sex, we automatically have 1000 predetermined personality traits. And yes, some of the time you are right. I was born a boy and I like legos more than barbie dolls. Good job, you got that one correct. But there are so many others that you got wrong. Because you don’t know me—only I know who I am. I am the one living in this body. I know my needs, desires, and wants more than you could ever hope to.\n\nAll of these traits which you associate with someone’s sex are called **gender**. It’s so important to distinguish between sex and gender. Sex is biological, but gender is something created by you, our society. Gender is a set of expectations that society puts on sex. These expectations shift and change over time, but they are always present.\n\nGender is like The Matrix — a completely fabricated world, but because it is all around us and we know nothing else, it appears to be immutable and real. But there is nothing real about saying “a boy can’t like pink” or “a boy can’t like to wear a skirt”.\n\nLike Neo, I wish I could escape The Matrix and enter a world where gender didn’t exist, where I could simply like what I like without being categorized or classified. As of yet though, I am stuck here in the matrix.\n\n# Categories & Boxes\n\nDon’t get me wrong — categorizing is useful. It helps us predict how others might behave based on limited data, which is key to survival\n\nIf I tell you that someone supports the right of every person to own a firearm, you could predict, with pretty high accuracy, that this same person would also be in favor of lowering taxes. These categorizations exist because they are useful tools for our brains to predict things about people. Sometimes the categorization is wrong — for example, there are plenty of people who support the right to own a firearm who also are interested in raising taxes to support social programs. But as long as the categorization is right *most of the time*, it is useful to people.\n\nImagine I attend an NRA convention because I support the right to bear arms. Someone smiles at me, pats a ‘Proud Republican’ sticker on my shirt, and says, ‘Thanks for supporting our cause.’ Now, let’s say I agree with Republicans on this one issue, but for 999 others, I’m a Democrat.\n\nWith this “Proud Republican” sticker stamped on me, let’s analyze what happens when I interact with different people. A republican sees my sticker and invites me over to their house for dinner. At dinner, the conversation turns awkward very quickly. “What do you mean, you support abortion?!” “You’re not a real republican! Who gave you that sticker?!!!”. And any democrat who I come across will see my sticker and immediately turn away from me saying, “eww, a republican!”. Wearing this sticker effectively sabotages almost every interaction I have with other people.\n\nGender operates in much the same way as that sticker. I am walking around the world with a sticker that says “I’m a boy”. Even though, if you look individually at the 1000 characteristics that categorize people into “boy” vs “girl”, I would fall into the “girl” category for the vast majority of them. Because of the incongruence between my actual internal identity and the category in which I am placed, I am perfectly positioned to fail miserably with almost every interaction I have with people. The people who think they like me realize that I’m not the person they think I am. The people who look at me and immediately decide that they don’t like me miss out on what could have been a very rewarding connection.\n\nThese boxes and categories—created by YOU—are both artificial and powerful. This is why I can’t just ignore gender. This is why I can’t just be “a boy who wears a dress”. The category matters way more than any individual interest or trait.\n\nThe next time you see someone you ‘suspect’ is transgender because one trait doesn’t align with the others, just know that this person is not “pretending” to be a man or “pretending” to be a woman. This person was pretending their whole lives to be something else for you and they finally had the courage to be who they really are.\n\nDo you really think I enjoy this or that it’s just for attention? I spent my entire life trying to hide. I minimized myself constantly in order to make other people more comfortable. I don’t want your attention, I just want to live my life as me. “Life, Liberty, and the Pursuit of Happiness”. That’s what I want, just to be left alone to live life in the way that makes me happy. Is it really so difficult?\n\n# Difficult Topics\n\nThe conversation becomes more fraught when people perceive trans rights as infringing on the rights of other people. The biggest topics lately have been about access to gender-affirming care for adolescents, access to bathrooms, and access to sports.\n\nPeople are being told that their kids are going to get “trans’d” at school, come home, and want to get their genitals cut off. Fear has taken over, leaving logic, reason, and compassion behind.\n\nWhen considering these issues, reflect on my story and those of other trans people. Think about what would have helped us vs hurt us. Talk to trans people and listen to their perspectives—we’re rare, but we exist. You may have never met one of us before, but maybe you should before you make sweeping decisions that affect all of us.\n\nFor me, I wish I had been born in a time when people openly talked about gender in school. I wish I had figured this out much sooner. I wish I had access to puberty blockers and hormones as a kid. Undoing the effects of male puberty as an adult is an enormous challenge. It’s expensive, it’s painful, and the results are never as good as they could have been if I’d had access to care earlier.\n\n# Waves Goodbye\n\nLike being gay, being trans is just one possible part of the human experience—and it is not a choice. I would never have chosen this for myself. Yet every time I’ve tried to ignore it or deny it, it has felt like standing in the ocean, trying to fight the waves.\n\nI hope the world becomes a more accepting place for us, even though it seems to grow more hostile each day. We make up just 1% of the population, yet we are demonized by mobs with pitchforks—people who bear an unsettling resemblance to the bullies of my youth. We are 4x more likely to be victims of violence, and 40% of us attempt suicide. Being trans is already hard, but the relentless pressure and hostility we endure often make life unbearable.\n\nIf you had been with me in the hallways of my school all those years ago, I hope you would have stood by me against the bullies. I hope you would have seen me as worth protecting—as human, and as worthy of living. I hope you can stand by me now.\n\nYou may have met me before, but you didn’t really know me—just a meticulously crafted mask that I created to protect myself. I am taking it off now.\n\nMy name is Violet, nice to meet you.",
    "author_fullname": "t2_1eit24xhet",
    "title": "Dear Society: Fuck You.",
    "upvote_ratio": 0.96,
    "ups": 313,
    "created": 1734277901.0,
    "created_utc": 1734277901.0,
    "num_comments": 52,
    "author": "violet-says",
    "id": "1hevdlw",
    "created_datetime": "2024-12-15 15:51:41"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Its winter where i live and the most ive seen him in is this loose thin Hawaii vest zipper down. He goes to school with that and jorts and wears just a vest zipper down at his job\n\nIts 6 fahrenheit out. I've seen him in the fit on a target run even though the man is broke. Genuinely worried bout what i should do so he doesnt freeze to death",
    "author_fullname": "N/A",
    "title": "Transmasc friend hasnt worn shirt since double masectomy and i need advice",
    "upvote_ratio": 0.92,
    "ups": 298,
    "created": 1734414855.0,
    "created_utc": 1734414855.0,
    "num_comments": 64,
    "author": "N/A",
    "id": "1hg43t1",
    "created_datetime": "2024-12-17 05:54:15"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hey all, I'm a 16yo trans girl trying to get through life and find ways to deal with it all by reading through this subreddit. But I'm seeing a lot of posts that just aren't... Right, so to say.\n\nTo clarify, there's quite a lot of posts where (cis) people are asking about certain behaviors from their trans partners, and tbh none of it has anything to do with being trans. I can't help but wonder if they think being trans means we're different somehow, like we're all the same person just because we share one thing in common.\n\nI don't like it. I understand its not malicious behavior, but can it please stop? I'd like it if a new rule were put in place for this subreddit, where making posts about other trans people's behavior was no longer allowed (with certain exceptions ofc). Who here agrees??\n\nEDIT: I've noticed some people don't understand what I mean (SnooObjections9416). I'm trying to make posts unrelated to this subreddit against the rules. For example (nsfw); I recently saw a post where a cis person was asking why their trans partner wants a threesome. THAT'S NOT RELATED!!! Posts like that are screaming \"I think you're all the same because you're trans, and I'm not a real ally\". They're pretty much telling us they are closeted transphobes who see us as a 'type of person' by being trans.",
    "author_fullname": "t2_rqinsc5h",
    "title": "I'm tired of this sh*t.",
    "upvote_ratio": 0.89,
    "ups": 298,
    "created": 1733589865.0,
    "created_utc": 1733589865.0,
    "num_comments": 127,
    "author": "Ramenaddict12",
    "id": "1h8wgnr",
    "created_datetime": "2024-12-07 16:44:25"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Heyyy I’m not a member of the trans community but I am a lesbian. I wanted to respectfully ask a question that I genuinely hope is not offensive in any way. This is a sincere question because I am wanting to be just the opposite of offensive!! Sending love. 🫶🏻 \nHere goes… as I said I’m a lesbian. I like all the girls. I find it really attractive if someone I’m with has a lady dick. I think it’s hot. I think it’s hot when girls have strap-ons. This isn’t limited to trans girls. But I am so attracted to a pretty girl with a dick. Would this be offensive to anyone or considered a fetish? I don’t want to make anyone feel like I like them BECAUSE they’re trans. That seems invalidating to them as an individual. I would appreciate some feedback and again, I hope this isn’t an offensive question.",
    "author_fullname": "N/A",
    "title": "Trans Girlies",
    "upvote_ratio": 0.92,
    "ups": 284,
    "created": 1733626790.0,
    "created_utc": 1733626790.0,
    "num_comments": 73,
    "author": "N/A",
    "id": "1h99aex",
    "created_datetime": "2024-12-08 02:59:50"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "As it says on the tin.\n\nI (cis female) have a close friend (let’s call her Emily) who recently started hormones, she’s MTF. I love her to bits, we met in college and have been super close ever since. She is truly someone I hope to have in my life and see flourish into the best version of herself as we grow old.\n\nNow, to the issue. \n\nOver the years we have been friends, she’s made comments here and there about me speaking about my love/sex life (which we mutually discuss) where she’s expressed a sense of inferiority. I am heavily sympathetic towards this, she is very outwardly masc presenting due to her family being unaccepting and deals with a lot of dysphoria due to this due to not looking how she wants in order to date. I have always been able to talk her down from these episodes and when she’s made a comment I’ve made sure we talked it out.\n\nRecently, though, she’s been mentally through the wringer and the comments have hurt a bit more.\n\nWe were driving together earlier and I mentioned horrible pain I had been having the past few days. I have Polycystic Ovarian Syndrome (PCOS) and struggle with a lot of health complications due to it. She knows this. \n\nAfter I had mentioned the pain I was in she sighed and went “well at least you have ovaries!” and it made me feel like absolute shit. I told Emily how it made me feel and she kind of apologized, but I felt heavily iced out for the rest of the night. I told her when it happened that she does not want the issues I face and that I wouldn’t wish them on my worst enemy, and she told me “I wouldn’t either” and ended up glossing over the whole thing entirely.\n\nI love Emily dearly, but comments like this make me feel heavily alienated & uncomfortable. I feel like an asshole for being as upset as I am about it, but it really fucking hurt.\n\nThis combined with another comment she made in relation to me getting gross dms/harassed by men in general (in response to some complaining I did about it she said she “wished she got attention” basically) really rubbed me the wrong way.\n\nShould I unpack why I feel upset like this, or am I justified in how I feel? ",
    "author_fullname": "t2_8x7to66n",
    "title": "MTF best friend told me “at least you have ovaries!” in response to me venting about PCOS pain. Am I a shitty person for being upset over it?",
    "upvote_ratio": 0.92,
    "ups": 287,
    "created": 1735027288.0,
    "created_utc": 1735027288.0,
    "num_comments": 143,
    "author": "criedthewholewayhome",
    "id": "1hl8y2m",
    "created_datetime": "2024-12-24 08:01:28"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I am a gender queer person with a vulva. I’m not on T and don’t have top surgery. To give you an idea about how my gender is externally perceived, I think most people who know about non-binary people assume I am non-binary, and anyone else assumes I am a masc queer woman. I am occasionally assumed to be a man in passing, but not in conversation. \n\nProbably at least 20%-30% of the time I go through airport scanners, my crotch gets flagged and I have to get a pat down in the area. I know generally how these scanners work in that they pre-select a gender, but I don’t understand why my crotch is flagging? If they thought I was a woman, nothing should flag because my anatomy matches. If they thought I was a man, my chest might flag as extra material, or maybe my crotch might flag because I don’t have a dick, but I doubt I’m being mistaken as a guy 20-30% if the time. Also, often when I’m pulled aside they automatically have a woman pat me down, so they don’t think I’m a man. \n\nI have a few theories, but none seem to fully fit. \n\n1. The extra fabric I don’t fill in my boxers sometimes flags the sensors. However, I’ve recently switched to “women’s” boxers which don’t have any extra fabric, and have still been pulled aside. Also, I wore them quite high waisted and there really wasn’t much extra fabric. \n\n2. My genital piercing is flagging it. However, from my research, this is only an issue at super large gauge piercings. It does not protrude at all. Also, getting flagged predates the getting the piercing. \n\n3. Originally it was the boxers flagging it, but since I’ve switched underwear and gotten a piercing, it’s now the piercing flagging it. This does line up timeline wise, but I don’t think either would be substantial enough to flag the sensor that often in the first place. \n\nAny ideas? It happens across different countries and cultures. It’s not too much of an issue, I mainly want to find out what might be causing this as a curiosity. However, I definitely have had uncomfortable experiences getting pat down so often and have had staff say weird things about my gender. Thanks! ",
    "author_fullname": "t2_xm1oq3",
    "title": "Why does my crotch get flagged at the airport? ",
    "upvote_ratio": 0.95,
    "ups": 287,
    "created": 1733622077.0,
    "created_utc": 1733622077.0,
    "num_comments": 78,
    "author": "aint-noise-pollution",
    "id": "1h97v7o",
    "created_datetime": "2024-12-08 01:41:17"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hey,\n\nI'm a transfem and recently talked with a couple friends about my dysphoria. All of them are cis men. I've been confronted with the sentence from the title once I talked about how dense and long most of my legs, belly, and chest hairs are and that I am going to remove them eventually permanently. \n\nI had no argument that changed their minds about it. Apparently It's normal for women to have lots of black hairs all over your body.",
    "author_fullname": "t2_14so1fhbnx",
    "title": "How to deal with an \"cis women also have body hairs\"?",
    "upvote_ratio": 0.95,
    "ups": 265,
    "created": 1733787011.0,
    "created_utc": 1733787011.0,
    "num_comments": 107,
    "author": "a_sl13my_squirrel",
    "id": "1hanpx0",
    "created_datetime": "2024-12-09 23:30:11"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "AMA 😭😭😭",
    "author_fullname": "t2_smu7h4y",
    "title": "Im a Trans woman in a fraternity",
    "upvote_ratio": 0.96,
    "ups": 263,
    "created": 1734474398.0,
    "created_utc": 1734474398.0,
    "num_comments": 84,
    "author": "Bip_03",
    "id": "1hgmn63",
    "created_datetime": "2024-12-17 22:26:38"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I just want to be very clear about this before you read this shitstorm of a post. I've never used reddit and that i am very bad at the \"LGBTQ- lingo\"... Sorry in advance.\n\nMy best friend came out as trans...\n\nOk, i just really need to write this out because i've just been hit with a bombshell and my teeny tiny straight brain can't comprehend the news that i just heard. Feel free to comment and give advice. I just need to write my feelings on this topic. (There are going to be spelling mistakes, English is my second language.) FYI Before you read. I'm fully aware that i am a stupid uncultured and ignorant asshole... But i really want to help my friend...\n\nMy friend who i've known now since i was 16 (now 24) just recently had a lot to drink when we played video games this last night. In his drunken stupor he talked a lot of his mental health and how he struggles alot with it to me and his other friend on a voice call (Depression and self harm were the big topics)\n\nWe play and hang out as much as we can when we're not working opposing shifts. As you do. We are best friends after all!\n\nAbout a year ago we were sitting on his couch having some beers and got totally shitfaced, laughing and telling jokes...but as it so often happens he started to tell me about his feelings, he starts opening up to me about his insecurites and such. I, as the good friend that i try to be listens to him of course. And he tells me he is Bisexual.\n\nHe tells me that he doesn't see gender as a defining factor of why he likes someone as a romantic partner. He was troubled by having to be drunk to tell me this but i reasured him that i was fine with it. \"Whatever floats your boat\" i said.\n\nBut i feel like an asshole... Because i became uncomfortable with these news. I didn't know what to think. Of course i knew that he wasn't hitting on ME and was going to confess his love or something. I know that much. But it kind of... Rubbed of on me in a uncomfortable way. I don't know how to describe it.\n\n A couple days pass and we don't really talk about it. Things move on, i unintentually or intentually, forget about it.\n\nFast forward to this past night. We were having a great time playing some video games and my friend starts drinking a bit more than just a few beers... \"Hell yeah bro, get wasted, its a saturday night who cares\"... or something like that i said...\n\nHe starts making jokes about wearing thigh highs and a skirt, which in hind sight he has made before... I've just not thought about it. I laugh it off and we continue playing.\n\nLater when we've finished playing we just start talking on the call with no game to play in the meantime and his other friend joins. We laugh and talk about work and make jokes as good friends do. But the tone suddenly changes after some time. The jokes my friend makes are getting a bit too self depricating. We try to figure out how he is doing and he goes on a tangent that has me stunned. \n\nHe has been doing the forbidden self harm on his arms and legs and we try to get him to open up about why he has been doing it. Me being a stupid idiot gets mad and tells him of, trying to make him \"get a grip\" and speak up. I suggest talking to a therapist and such.\nHe then realizes that he maybe has said to much being drunk but luckily doesn't shut down the conversation as he has done before...\n\nWe talk some more about why he has been feeling sad and it comes down to a bombshell that hit me so hard in the face that i just sat there... stunned... Didn't really know how to feel.\n\nMy best friend for about 10 years tells me that he is living in the wrong body, being uncomfortable with how he looks and feels being a guy. is sitting on a voice call in a girl outfit and tells me he is wanting to become transgender, Male to female.\n\nMe being a straight guy that has never had any gay experiences or have had any real knowledge of the LGBTQ+ community is feeling... Vexed, confused. These things only happen on TV or in the big cities i thought.\n\nI am completly the WRONG guy i thought to be on my best friends side and telling him that i fully support him. But then again, who else is going to? \n\nI talk with him and his friend about this topic and i tell them that i don't understand, and that i probably never will. But i will support him, always. As this conversation dragged on for a long while it ended a bit abrupt. We said our goodbyes as i needed to go to bed.\n\nAlas i am laying here on my bed writing this shitty post. I realize that all this time my friend has been totally shitfaced and is probably not going to remember alot of what we have been talking about. He is most definetly going to wake up tomorrow feeling hung over and regreting all that he has said. \n\nAll i know is that i want him to feel better, he got stupidly happy when i said that i support him and that i will be by his side.\n\nHe said that he has been scared about coming out with this information to me as i am not a person who has been vocal about LGBTQ rights.\n\nI know i am just word vomiting but this was something i think i needed to write down. \n\nWhat i am going to do is try to make my friend talk to a professional, like a therapist., I do think it is a VERY hard thing to do for him. Probably the most hard thing that he is ever going to do. But i think that will help him alot. There are of course other things in his life that he needs to talk about. Not just about the trans thing. \n\nI might be a dumbass who doesn't know anything about this topic but i just want my friend to not be sad anymore and not become another victim beacuse nobody would listen to him.\n\nAgain, if you are reading this i am so sorry if my incompitance has made your eyes burn. This is one of the first times i \"vent\" online and write a post for that matter since i can't really talk to anyone about this. Hope you have a wonderful day!\n\n-D",
    "author_fullname": "t2_ry5sdszp",
    "title": "My best friend came out as trans",
    "upvote_ratio": 0.98,
    "ups": 253,
    "created": 1733636424.0,
    "created_utc": 1733636424.0,
    "num_comments": 21,
    "author": "DueDish8544",
    "id": "1h9c0yo",
    "created_datetime": "2024-12-08 05:40:24"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Since the election, I have been keeping my distance from my family bc most, including my parents, voted for Trump.  Everyone has been tolerant of my transition (although not outright supportive) and I know that they love me, but their vote for Trump really cuts deep.  My parents don’t speak English very well and they are staunch anti-communists so that’s why they voted for Trump.  The rest voted for him bc they own businesses and investments that they think will fare better under Trump.  So while I get why they voted for Trump, I still can’t help but feel that they voted for my not existing so I can’t stop but feel like I can’t be around them.  How do I reconcile everything?  ",
    "author_fullname": "t2_vfmz1w9s",
    "title": "Do I have a right to resent my tolerant parents and family for voting for Trump?",
    "upvote_ratio": 0.95,
    "ups": 252,
    "created": 1735105173.0,
    "created_utc": 1735105173.0,
    "num_comments": 77,
    "author": "ramenchicka",
    "id": "1hluop1",
    "created_datetime": "2024-12-25 05:39:33"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Last hour of Xmas, my parents randomly launched into a TERF tirade. I'm completely at sea as they are both old hippies with majority LGBTQ (or rather LGBQ) friends and have been staunch allies for decades. I believe they have been politicised but I don't really understand how. \n\nThey have done what they called a 'deep, deep dive' and have a few main talking points, which I'd like to counter next time I see them.\n\n1. Puberty blockers and pre-adult transitioning. They are against under-18s being allowed to make these kind of decisions. I kind of agree but can see the point of puberty blockers, although I have zero scientific understanding of why they are necessary and what the pros and cons are (specifically medical ramifications).\n\n2. Trans women in cis female spaces (the classic bathroom/changing room debate). They insist this poses dangers to cis women. I pointed out that the same arguments were probably being made around gay men in cis male spaces and that threw them a bit. But they also said that a predatory male could just declare themselves a woman and enter freely. Looking for any stats / studies that may have looked at this, as it seems very unlikely. I also pointed out that trans women would face much higher dangers in cis male spaces, but they simply said 'there are more cis women'. Would also like some examples of trans women experiencing violence in cis male spaces.\n\n3. Medical dangers of transitioning. Specifically some shit about bones crumbling. Scientific articles I have found dispute this, no idea where that came from. Other dangers positioned as 'well we just don't know what the bad effects could be'. Looking for long-term studies on physiological effects - most of the ones I found were looking at psychological.\n\n4. Peer pressure / mis-identifying dissatisfaction. Saying a lot of youth are simply buying into the hype and misplacing typical angst with gender dysphoria. Randomly threw out an example of 12 students from the same class all wanting to transition. Is this happening? Any evidence? I can believe a bit is happening but I can't imagine it's that widespread.\n\n5. Regret. This was framed through the lens of still being unhappy. I made the point that trans people aren't widely accepted in society so how can they know that the unhappiness isn't from not being accepted as the gender they identify as.\n\n6. Radical feminism. My mom specifically thinks being trans exclusionary is being feminist, because 'trans women aren't women'. Looking for literature that examines trans women in feminism. \n\n7. A bit tenuous, but - parental trauma. My mom's friend has a trans son and is clearly struggling with it, apparently called it a 'daily trauma'. I can't help but not give a fuck about that 'trauma', but any literature on this matter might help.\n\nThey are both rational and mostly accepting so I believe they can be swayed. They were quite shook that I had heard almost identical arguments from homophobes about gay people, so even a book or article comparing the two movements and their struggles might help. \n\nI should mention that my wife and I are both cis and don't know any trans people directly, so while we consider ourselves allies, we don't know much about the trans experience at all. We both want to use this as an opportunity to learn, as well as gather data we can use to counter bigotry. That being said, I am mainly looking for scientific or at least non-fiction books / articles / studies. If you would like to recommend a book that focuses on trans experience, I'd love to read it, but please label it as such so I know.\n\nThank you SO much to everyone who responds. I know the onus isn't on you to educate the community and appreciate you taking the time to help me guide my parents towards non-bigoted views, while educating my wife and I on the realities of the trans experience!\n",
    "author_fullname": "t2_btlvd",
    "title": "Mom just outted herself as a TERF. I need resources to combat her various stances please!",
    "upvote_ratio": 0.92,
    "ups": 244,
    "created": 1735316476.0,
    "created_utc": 1735316476.0,
    "num_comments": 83,
    "author": "ReverendJack",
    "id": "1hnifv9",
    "created_datetime": "2024-12-27 16:21:16"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Anything from articles, books, videos, or your own personal advice is very appreciated.\n\nThe way i became a terf was when i was 14 and groomed into the TERF mindset by a transphobic pedophile. I remained that way until i was 15 and 1) realized i was being groomed and 2) realized that trans women are actually oppressed and when i brought that up to my terf mutuals, i was bullied out of the community. I was then just so fed up  with them bc it was just an echochamber cult. i asked some questions on trans subs what being trans actually means. And i realized my entire ideology was based on misunderstandings and hate. I believed being trans was about gender roles. I thought ppl were trans because they liked things associated with the other sex. but when i actually asked trans ppl, i learnt it's pretty much about your self perception and who you really are on the inside. \nIt's been like 6 months, I'm 16 now, and I've watched a lot of videos and read a lot about trans experiences and I'm understanding it all better. \n\nThere are some things that give me the ick though and idk how to address it. It's just the whole egg_irl memes about questioning if they're women bc they wanna be a lesbian weirds me out so much. And the weird infantilizing way women on r/mtf talk about being a girl. I dont get it. I find it weird. Am i transphobic if I find the whole \"good girl\", \"uwu i wanna be a catgirl\" \"i wanna be a lesbian still cis tho :3\"  thing just infantilizing and weird????",
    "author_fullname": "t2_1bouvn5qg1",
    "title": "Ex-TERF here. How do i totally stomp out my past viewpoints and become the best ally i can be?",
    "upvote_ratio": 0.89,
    "ups": 244,
    "created": 1733889990.0,
    "created_utc": 1733889990.0,
    "num_comments": 99,
    "author": "throwingaway-5632",
    "id": "1hbl2hp",
    "created_datetime": "2024-12-11 04:06:30"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hey everyone!\n\nCis lesbian here, currently dating a trans girl. It's been amazing so far, we have so much in common, and I genuinely feel great when I'm around her.\n\nFor the first couple of dates, the fact that she's trans didn’t come up. I obviously didn’t bring it up, and she didn’t mention it either, which I totally respected.\n\nThe other day, she shared that she’d felt a bit stressed during those earlier dates—before she had come out as trans to me — wondering if I \"knew\". In an attempt to reassure her, I clumsily was like, “Oh, no worries, hun, I had figured it out, and I really didn't care!”\n\nLooking back, I realize that probably wasn’t the most affirming thing to say. I feel bad because I might have unintentionally rubbed the fact that she doesn’t pass in her face, which was never my intention. She definitely did not seem pleased with my response.\n\nI really want to make sure I respect her identity as an important part of who she is and her story, while also not making it a big deal that it feels alienating or like I’m fixating on it (I myself don't love it when people keep bringing up my sexual orientation, like who cares, it's the least interesting thing abt me forreal). I care about her so much and want to strike the right balance between being supportive and keeping things natural. \n\nWhat would have been a better, more supportive way to respond to her sharing that? Should I bring it up again and apologize, or is it better to move forward without reopening the conversation?\n\nThanks in advance for your advice!",
    "author_fullname": "t2_wn9vy4v2n",
    "title": "How Can I Apologize for a Clumsy Response About My Girlfriend Being Trans?",
    "upvote_ratio": 0.96,
    "ups": 238,
    "created": 1734968467.0,
    "created_utc": 1734968467.0,
    "num_comments": 54,
    "author": "Impressive_Appeal_95",
    "id": "1hkqdar",
    "created_datetime": "2024-12-23 15:41:07"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "What's the difference to regular horny?",
    "author_fullname": "t2_zl9l07voh",
    "title": "What do people mean when they say \"girl horny\"?",
    "upvote_ratio": 0.96,
    "ups": 239,
    "created": 1734222995.0,
    "created_utc": 1734222995.0,
    "num_comments": 47,
    "author": "upsidedownsweater",
    "id": "1hegu2x",
    "created_datetime": "2024-12-15 00:36:35"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Do most trans girls look like cis girls in public? Why do people say \"you will never be cis\" if most girls I see on the internet look like regular women? I'm just afraid I might have unrealistic expectations from HRT. My faceapp looks really good, but it heavily changes my face and makes it sharper.\nIf I do not pass in my country, I might get jumped and beaten. So I'd rather stay in closet as an okay man than an ugly woman for now. \n\nFor context: even my cis male friend is getting bullied and approached by less than stellar people for having long hair. And he is your average straight white guy gym goer. He gets constantly misgendered by older folks especially.",
    "author_fullname": "t2_11ie4b7gvf",
    "title": "Is the average trans woman passing? ",
    "upvote_ratio": 0.89,
    "ups": 231,
    "created": 1734188149.0,
    "created_utc": 1734188149.0,
    "num_comments": 162,
    "author": "OkEffect71",
    "id": "1he4k5n",
    "created_datetime": "2024-12-14 14:55:49"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "When I look at my family, school, you know just the genrall community around me it feels like people won't talk about somone who's quear but they won't have distain for them. Shure somone might shout the f slure in the pe changing room but they wont activley hate on somone whos gay (or atleast not infront of them) but when somone is gender quear then there \"mentally ill\" or a \"sexual deviant who wants to invade female spaces\". It just doesn't make sense to me like  trans people have always existed and so have gay people but when people started to except gay people they just what pushed trans people to the side or what.\n\nIt just kinda scares me because when I grow up and transition will people except me? I mean are the people around me going to change?,will everyone change and be more exepting?. I don't know because puberty blockers have been banned for me in the uk and even if they weren't it's not like my parents would be excepting enough to get them and the future doesn't look very great either since ( I'm not in America but) trumps been elected and the tory leader is a raging transphobe.",
    "author_fullname": "t2_cyesibyb",
    "title": "Why aren't trans people as accepted as the other parts of the lgbtqia+",
    "upvote_ratio": 0.94,
    "ups": 231,
    "created": 1735489778.0,
    "created_utc": 1735489778.0,
    "num_comments": 66,
    "author": "Foreign-Jackfruit554",
    "id": "1hozk9h",
    "created_datetime": "2024-12-29 16:29:38"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I think my roommate is trans\n\nA little backstory before I get into it: I’m a 20 year old guy, and so is my roommate. We became friends recently, we’re both college students, sharing a dorm at a fairly liberal college, it’s in my home state. He grew up in a conservative Christian family and moved across the country to be here. He told me early on that it felt strange at first because it was so different from what he was used to. The first few weeks we were roommates sucked. He came off as a bit of a dick, he made some questionable comments, didn’t clean up after himself and he always did homework at like midnight with the light on. We have fixed these problems now. But one day, he vented to me about how one of the required classes for his major was doing a bit on LGBTQ history, and he wasn’t happy about it. I don’t know if it was how I look or how I play a lot of ‘masculine games’ and shit or whatever but he apparently thought I was on board. So I took the chance to tell him I was trans, and he was fairly shocked, which I can tell you felt pretty good because he told me he couldn’t tell. Anyways it was pretty awkward after that for a while but a week or two later he saw me playing a game he liked and I guess that was enough for him to get over it because he watched me play for a while and then he apologized to be for complaining about the assignment and he told me that he hadn’t met anyone trans or anyone gay, and he said I was nothing like he had been taught. And long story short we’re friends now. \nNow to the actual story: After finals, I decided to take my roommate to see I Saw the TV Glow as a little treat. It was playing in a small indie theater in town, and I’d heard about it from a friend who saw it when it first came out. They told me it was about a trans girl, so I thought it might be an interesting watch, and maybe even good for my roommate to see. What my friend didn’t tell me was how absolutely devastating the movie is. It's a pretty hard watch, not because it's bad but how visceral everything is. Safe to say the car ride back to our dorm was absolutely silent and we both cried a bit.\nBut in the weeks since we saw it he hasn’t really bounced back to his usual self. He’s been sticking around campus over winter break since it’s too expensive for him to fly back home, and I invited him to a family gathering because I didn’t want him to spend the holidays completely alone. He seemed okay there, but after that, he slipped back into being unusually sullen and withdrawn.  \nA day or so after we saw the movie, I had asked him what was wrong. He only said, “It was a pretty intense movie.” which is true, but since he still wasn’t back to normal a week later I began to feel like there was more to it than that. Now, I don’t want to overanalyze this, but I can’t shake the feeling that watching it might’ve made him realize something about himself.  \nThere have been a few moments that make me wonder if he’s grappling with his identity. For one, I remember him getting visibly uncomfortable when someone casually asked him what he identified as. At first, I chalked it up to his conservative upbringing. But now, I’m not so sure. He also always chooses female characters in video games, which I think some people do to like see tits or whatever but he’s not really like that. I remember finding him painting his nails one time, which I really don’t care about, but I could tell he did because he started laughing about how stupid it was, he has also gotten almost frozen when we met a trans woman at a party, like he was impressed out at how good she looked but shocked that she was trans, and again I thought it was because his family is weird, but I have come to a different conclusion now. \nMaybe I’m reading too much into it, but if there’s even a chance he’s questioning or coming to terms with something, I want to be there for him. If anyone could offer some advice at all that would be great. I also posted this in r/trans and it got removed for some reason, but to be clear I am also trans.",
    "author_fullname": "t2_1btinmjtxo",
    "title": "I think my roommate is trans",
    "upvote_ratio": 0.97,
    "ups": 226,
    "created": 1735603249.0,
    "created_utc": 1735603249.0,
    "num_comments": 35,
    "author": "Doomed_Explorer",
    "id": "1hq1g5w",
    "created_datetime": "2024-12-31 00:00:49"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I've noticed that when I'm feeling depressed I end up compulsively doing this, and I don't understand why. Like, trans person/concept mentioned in YouTube video? Better scroll the comments until I find someone being transphobic. \n\nI had it happen to me yesterday in real life, which is what prompted this post. I was at the thrift store and a book about feminism caught my eye, when I saw it was from the 80s I thought \"there's probably some really fucked up shit about trans people in there\" and started looking through the table of contents. Sure enough there was one chapter about it, I started skimming it and ruined my whole day. After I put the book back I just kept thinking \"why the fuck did I just do that?\" I'm very familiar with that era of feminist literature, and I knew what I would find and that it wouldn't make me feel good, but I did it anyway. Is this just a form of self harm?\n\nP.S. To add some levity to this post, on the same shelf just a few books over from the feminist one, there was just a straight up hardcore gay furry porn novel. Every page I flipped to had some wild shit, and I was cackling in the Goodwill when I found it. NSFW: https://imgur.com/a/dMKcwYS",
    "author_fullname": "t2_1bjbh19s81",
    "title": "Does anyone else find themselves compulsively looking for transphobia, almost like a method of self-harm?",
    "upvote_ratio": 0.96,
    "ups": 226,
    "created": 1735405425.0,
    "created_utc": 1735405425.0,
    "num_comments": 36,
    "author": "deadhead_girlie",
    "id": "1ho9yi4",
    "created_datetime": "2024-12-28 17:03:45"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hello everyone, I am here asking for information/input/opions on my current situation. My son is 16, he identifies as Male , however he want to appear female (specifically, wider hips, smaller waist,softer skin, softer appearance I. General ) he does Not want breast. What he does want is; no facial hair and less wider jaw and chest.\n\nMy question is what are his options?  I looked into puberty blockers but they seem expensive and stop erections which might not be what he wants(he is in a serious relationship)\n\nEstrogen from what I understand grows breast which can be permanent (which he does not want)\n\nAnother concern for either is the mood changes! He is already struggling with mental health, adding to it might not be the smartest idea. \n\nDoes insurance cover this type of stuff? (We have state assistance insurance btw)\n\nplease any advise, if you been through/or are in a similar situation, and your experience and advice on the topic anything helps ty!!!\n",
    "author_fullname": "t2_ymucyrktq",
    "title": "My son is a Fem-boy ",
    "upvote_ratio": 0.91,
    "ups": 222,
    "created": 1735508799.0,
    "created_utc": 1735508799.0,
    "num_comments": 101,
    "author": "Catcat0000",
    "id": "1hp6s19",
    "created_datetime": "2024-12-29 21:46:39"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "The two big(as in insults) transphobic women who have confronted me did so both times when we were alone and hurled insults and were very aggressive. I'm definitely not the only trans girl with this type of story. It feels like the whole they are transphobic because they are scared of men is just some bs excuse. At least id never treat anyone I'm scared of like that. Well I wouldn't treat anyone like that but especially if I was scared of them.",
    "author_fullname": "t2_hb89votk",
    "title": "Does anyone believe transphobic women are actually scared of us?",
    "upvote_ratio": 0.93,
    "ups": 217,
    "created": 1734117437.0,
    "created_utc": 1734117437.0,
    "num_comments": 67,
    "author": "FlamingoWorking7598",
    "id": "1hdjwby",
    "created_datetime": "2024-12-13 19:17:17"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I'm in a discord group that calls Washington state, particularly Seattle the \"Trans Mecca of the World,\" but a few trans people I know feel safe in Montana of all places, while I know one trans man who swears by New York. What state do you think is the safest for trans people, and will remain so in the coming years regardless of what happens?",
    "author_fullname": "N/A",
    "title": "What US state do you feel is the safest for trans people?",
    "upvote_ratio": 0.98,
    "ups": 213,
    "created": 1734351328.0,
    "created_utc": 1734351328.0,
    "num_comments": 205,
    "author": "N/A",
    "id": "1hfhstg",
    "created_datetime": "2024-12-16 12:15:28"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I just don’t get it. I genuinely don’t get it. What did we ever do wrong except try to be ourselves? I’ve been out for a few years, and I’m afraid. I’m afraid to go out in public, to use my preferred bathroom, to openly be trans because people hate trans people so much, especially recently. I’ve been doomscrolling on the lgbt and trans subreddit and the amount of anti-trans bills and laws, as well as so much hate recently makes me extremely depressed. My mental health has been in the gutter. I’ve even thought of detransitioning. Or even worse, ending it all. ",
    "author_fullname": "N/A",
    "title": "Why do people hate us so much?",
    "upvote_ratio": 0.95,
    "ups": 235,
    "created": 1734167261.0,
    "created_utc": 1734167261.0,
    "num_comments": 122,
    "author": "N/A",
    "id": "1hdz66y",
    "created_datetime": "2024-12-14 09:07:41"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "So.... WHAT THE FUCK WAS THIS-\n\nSo.... my body did a thing.... let me explain.... cause I have never felt this shit before-\n\nSo... I'm 23 (MTF \"4 Months HRT: 1 Month Of Injections\"). I just took my estradiol injection this morning and decided to do it in my thigh but a lot deeper into the fat as I had gotten a decent bit thicker since last week. The injection hurt a bit more than usual but that doesn't matter-\n\nSo... I have a boyfriend (20) and he is VERY flirtatious and more often than not... down bad sexual with me. We do calls and texts because we live a state apart currently and I was doing a video call with him a little bit ago. Things were going fine and all was well until he took his shirt off-\n\nI'm not usually a super down bad horny girl, but for some reason... This time it hit different, like 1,000,000% different- I started explaining to him why he's my type and my voice was starting to flood itself with lust, which happens sometimes but not often...\n\nNormally I calm down after this fairly easily but this time instead of calming down, I just got even more aroused- The details of my description of why I find him so attractive kept getting more and more graphic and my voice was instinctually getting higher and more lustful by the second...\n\nI just kept getting more and more down bad until my face starting tingling, which turned to a seriously intense sensation only comparable to your leg going numb after sitting on it for too long. Only difference is this didn't hurt, but rather felt extremely euphoric and blissful-\n\nShortly after my face went numb, my thoughts faded and I was trailing off into a mumbling, drooling state...\n\nThen, it happened... My entire body lost all it's strength, and that same tingle in my face, rapidly rushed to my privates, especially my breasts... It was like an intense yet painless burning warmth that started in my crotch and chest and then shot all over my body followed by paralysis and bodily twitches.\n\nI couldn't talk, move, or even reposition my eyes- In fact, my eyes were rolled into the back of my head  as all I could do is lay there, trembling with drool running down my cheek and a relentless feeling of euphoria.\n\nThis lasted for roughly 2 minutes before it slowly faded and I sat up with a long lost feeling of pure relaxation and immense confusion.\n\nCan somebody PLEASE explain... WHAT THE F U C K THAT WAS-",
    "author_fullname": "t2_jobjqmxn",
    "title": "Um... What the hell... Just happened to me...?",
    "upvote_ratio": 0.87,
    "ups": 206,
    "created": 1733899295.0,
    "created_utc": 1733899295.0,
    "num_comments": 119,
    "author": "RestlessShiro",
    "id": "1hbnl5u",
    "created_datetime": "2024-12-11 06:41:35"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "It’s illegal / harder to get testosterone there , so what would you do about your testosterone dosages once you move to china ? Do you just come off of them \n\n\nIn the future , Id to like to have gender affirming care *and* be able to live in china if it’s possible but like now idk 😭 ",
    "author_fullname": "t2_qvl8nmbn",
    "title": "Transgender men who have moved to china , wtf do you do about testosterone ? 😭",
    "upvote_ratio": 0.93,
    "ups": 201,
    "created": 1735044797.0,
    "created_utc": 1735044797.0,
    "num_comments": 28,
    "author": "Kurapika_69",
    "id": "1hlcxqt",
    "created_datetime": "2024-12-24 12:53:17"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I'd rather just be misgendered",
    "author_fullname": "t2_fwnqwat",
    "title": "It's so awkward when someone visibly goes through a quick time event every single time they have to gender you",
    "upvote_ratio": 0.98,
    "ups": 199,
    "created": 1734277258.0,
    "created_utc": 1734277258.0,
    "num_comments": 12,
    "author": "sharksplitter",
    "id": "1hev5ck",
    "created_datetime": "2024-12-15 15:40:58"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Edit: just to clarify, I did research what the name means, whether it was of a sacred figure or not (it isn't) and found out that it's also a name existing in my country, it's just spelled a bit differently.\n\nEdit 2: enough non-white people told me it's racist/appropriation. If you want to add your opinion, feel free to. I decided that, even though I don't truly understand why it's appropriation rather than appreciation, since it's not my call whether it is a bad thing or not, I'll listen to y'all. I'm going to change it to the equivalent of it existing in my country. I'm sorry if I came off as racist or anything of the sort, I didn't mean to, thank you for giving me your advice.\n\nEdit 3: another clarification, since this seems to be getting misunderstood. I chose this name from an anime because the character I resonated with happened to be from it. If it were from any other form of media and resonated the way it did, I would've felt the same and probably chose that, the fact that it's a character from an anime is purely just random chance.\n\nSo, as the title says, I'm transmasc and I'm white. I'm 18 and have been going with this name since I was 13. It is a Japanese name, taken from an anime character that I resonated deeply with.\n\nI am very honest and upfront when asked why I chose the name I did.\n\nRecently enough, however, I saw on Twitter a whole discourse blown by a white trans girl using a Japanese name, and, after using it for about 5 years with no issue, I started questioning whether my choice was okay or not, as well as started feeling guilty.\n\nSo, I want to ask the non-white people here, especially the japanese, if this is racist/cultural appropriation? If so, I'd also like some advice on how to go about re-transitioning socially after choosing another name, please.",
    "author_fullname": "t2_15fcpcxkxd",
    "title": "I'm a transmasculine white person. Is my chosen name cultural appropriation?",
    "upvote_ratio": 0.84,
    "ups": 196,
    "created": 1733486862.0,
    "created_utc": 1733486862.0,
    "num_comments": 288,
    "author": "ThrowRA_anon_boi",
    "id": "1h7zwxu",
    "created_datetime": "2024-12-06 12:07:42"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Please and thank you. ",
    "author_fullname": "t2_lukmf3op",
    "title": "Are there some animals or other creatures existing outside the gender binary? ",
    "upvote_ratio": 0.96,
    "ups": 185,
    "created": 1734527824.0,
    "created_utc": 1734527824.0,
    "num_comments": 102,
    "author": "Flat_Wash5062",
    "id": "1hh1d6q",
    "created_datetime": "2024-12-18 13:17:04"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I don't know why being transgender and being lgbt is all of a sudden an issue. Sure lgbt have been hated for thousands of years I feel but at the same time why does it feel like it's been at the highest it's ever been. You have transphobic people who claim by doing stuff to trans people they are pleasing god who they are christant of course. \n\nI am tired of hearing all the transphobic people who say horrible things like do they not get what being transgender is. I feel the issue with society is we can never progress because thier is always a side that refuses to progress. Such as the world is becoming more and more accepting of lgbt people as lgbt grows so does the hate that is associated with it. \n\nI talked to one of my German trans friend once who told me thiers been a a raise of the nazi party again in thier Country. \n\nI feel that transphobia will never go away for the same racism will never go away. And from what I understand is that transphobic people most of the time don't even know what they are hating. They are just told to hate it and the reason it continue is because it's passed down. And no one breaks the cycle and or stops it hence it's allowed to go generation to generation. \n\nAre trans people just something people need to pin thier anger and frustration on? \n",
    "author_fullname": "t2_a9d7y1zw",
    "title": "Why is transgenderism all of a sudden a full issue. ",
    "upvote_ratio": 0.81,
    "ups": 183,
    "created": 1734937512.0,
    "created_utc": 1734937512.0,
    "num_comments": 86,
    "author": "RecentMonk1082",
    "id": "1hkids3",
    "created_datetime": "2024-12-23 07:05:12"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Why do they force the fact that you must “accept yourself for who you are” but their idea of who I am is submitting myself to the “norm” and looking how they want me to look. I always get stumped when I hear this and sometimes I’m convinced they are right, but at the same time I want to change my body for the better and in a way that makes me happier. What’s worse is that stopping HRT for me would be devastating and I’d be suicidal. They think that gender dysphoria needs to be “treated” and that people who become suicidal because they are restricted from HRT are mentally ill and unstable. \n",
    "author_fullname": "t2_mmaakn4z",
    "title": "Why do cis people say this?",
    "upvote_ratio": 0.94,
    "ups": 181,
    "created": 1733770645.0,
    "created_utc": 1733770645.0,
    "num_comments": 49,
    "author": "Totatus",
    "id": "1haha9o",
    "created_datetime": "2024-12-09 18:57:25"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Title",
    "author_fullname": "t2_arts3etv",
    "title": "What do you wish cis people would stop asking?",
    "upvote_ratio": 0.96,
    "ups": 182,
    "created": 1735335068.0,
    "created_utc": 1735335068.0,
    "num_comments": 194,
    "author": "Sriracha11235",
    "id": "1hnpihx",
    "created_datetime": "2024-12-27 21:31:08"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "My boyfriend (23M) and I (24MTF) have been dating for around 6-7 months and most things have been going great. He's very sweet and fun to talk with, but I'm really starting to worry about the physical attraction/sexual side of our relationship. It's important to note that he knew me pre-transition before we dated.\n\nI knew that he was attracted to trans women before we dated, but I fear it's in a way that doesn't sit right with me. The first thing that worried me is when he told me he's really into \"sissy\" porn with feminine men, and it's the majority of what he watches. Not really porn with trans women, but more skewed to cross-dressing men and people who are feminine, but still definitely men.\n\nHe hasn't explicitly said it, but also through numerous talks and interactions since we've started dating, he's shown pretty clearly that his type is really clocky trans women, as well as feminine men. Learning this made me sick to my stomach, I thought I generally passed pretty well and all that, but the sheer interest he's expressed in people that are his \"type\", and saying how much im his type, has been making me doubt my self-image a lot. From his interactions with me as well as my other MTF friends, I'm starting to feel like he views trans women as some sort of \"femboy+\". \n\nAnother thing that bothers me is his obsession with seeming more sexually experienced to his friends? They have a document where they track how \"pure\" everyone is, based on things that they have done, a lot of which are sexual. Before we'd ever gotten sexual, it often felt like his desire to have sex with me stemmed less from desiring me, and more from his desire to check boxes on that stupid purity test. He brought it up in at least 50% of our sexual conversations, and it just added to the feeling that I'm some sexual object to him, both to please his fetish and to obtain bragging rights amongst his friends. To tack onto this, after our first time, his interest seemed to decrease a bit which further lead me to believe that a chunk of his interest was based on bragging rights. \n\nIt's worth mentioning that his interest in \"sissy\" porn could definitely stem from a desire to take on a more feminine role, but I don't know how comfortable I am with that. He's expressed interest in bottoming before but I told him very very explicitly at the start of our relationship that I will never ever dom him in any way because it makes me feel awful.\n\nIs this an overreaction? Am I jumping to too many conclusions with this? Are we even compatible? I can't tell if I'm just in my own head about it, or if it's actually weird behavior.",
    "author_fullname": "t2_6njqndip",
    "title": "Is my partner fetishizing me?",
    "upvote_ratio": 0.98,
    "ups": 178,
    "created": 1735141817.0,
    "created_utc": 1735141817.0,
    "num_comments": 32,
    "author": "SnooQualifications50",
    "id": "1hm32c7",
    "created_datetime": "2024-12-25 15:50:17"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’m 18, closeted transfemme/girl. \n\nI don’t know if stuff like HRT will be banned for everyone or if I’d be putting myself in danger I just know that I don’t think I can live like this any longer. \n\nEdit: thank you for all the supportive comments (except certain people who know who they are( I read through all of them I just don’t feel like replying a bunch right now. ",
    "author_fullname": "t2_vhesykph",
    "title": "Should I start my transition even though Trump will be president?",
    "upvote_ratio": 0.94,
    "ups": 174,
    "created": 1733924329.0,
    "created_utc": 1733924329.0,
    "num_comments": 104,
    "author": "WeatherBrief3396",
    "id": "1hbtnly",
    "created_datetime": "2024-12-11 13:38:49"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I did this question in other subreddit but i just got a single answer and was not helpful at all. \n\nI know that many ancient/pre-colonial cultures recognized (social) gender transition and/or third genders: hijra in India, kathoey in Thailand, Fakaleiti in Tonga, Fa'afafine in Samoa, Muxe in southern Mexico, Calabai in bugis culture, mahu in Hawaii, Wintek in lakota culture, binabinaaine in Kiribati and Tuvalu, fakafifine in Niue, vakasalewalewa in Fiyi, whakawakine in Maori culture, Apwint in Myanmar, akav'ine in the Cook Islands, etc.\n\nHowever, i only could find two examples in FtM/AFAB individuals: calalai in bugis culture and fa'afatama in Samoa.\n\nWhy is this difference? And also, most of transgender and non-binary history, cases and transitions before the pandmey were atoshingly in MtF/AMAB individuals. Why?",
    "author_fullname": "t2_zkx97",
    "title": "Why most of cultures who recognized third gender or trans people were mostly in MtF/AMAB/intersex individuals?",
    "upvote_ratio": 0.94,
    "ups": 173,
    "created": 1734398473.0,
    "created_utc": 1734398473.0,
    "num_comments": 64,
    "author": "fedricohohmannlautar",
    "id": "1hfz79p",
    "created_datetime": "2024-12-17 01:21:13"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "EDIT: Thank you all for taking the time to give your advice and suggestions! You have all been very helpful and I appreciate it. \nI have decided that it’s best that I ask her before correcting any customers who misgender her to ensure that she feels comfortable with me doing so.\n\n\nMy coworker, who is a trans woman, gets misgendered regularly by customers. Customers will often come up to me and refer to my coworker as “he” or “that chap over there” and it’s starting to wind me up. I feel like I should correct them and I will often state her name hoping they’ll get the hint and realise their mistake but they never do.\n\nI don’t want to burden my coworker with this issue or even bring it to her attention because I don’t want her to feel uncomfortable or be hurt by this so I thought I should bring this to reddit. \n\nShe presents as female, wears makeup, has a feminine haircut etc. so I feel like they shouldn’t be getting her gender wrong all the time. So, should I start (politely) correcting customers or should I continue to hold my tongue?\n",
    "author_fullname": "t2_a2rwe7cr",
    "title": "Customers often misgender my trans (mtf) coworker. Should I correct them?",
    "upvote_ratio": 0.96,
    "ups": 172,
    "created": 1735157566.0,
    "created_utc": 1735157566.0,
    "num_comments": 54,
    "author": "Ok_Dog_2543",
    "id": "1hm81cg",
    "created_datetime": "2024-12-25 20:12:46"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I feel like transgender people (lesbians too) are sexualised more in the media. If this is true, why?",
    "author_fullname": "t2_13py4i8rpp",
    "title": "Is it true that transgender people are sexualised more?",
    "upvote_ratio": 0.98,
    "ups": 170,
    "created": 1734591474.0,
    "created_utc": 1734591474.0,
    "num_comments": 91,
    "author": "Crickeklover1991",
    "id": "1hhn6dh",
    "created_datetime": "2024-12-19 06:57:54"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I always found this interesting for one simple reason. If christants where true to thier beliefs then they wouldn't have any medical intervention done to them. Such as they would refuse a blood transplant because god didn't want them to have good blood so giving them a blood transplant is against God's will. \n\nWhat about the people or children with cancer that didn't ask for that. Would it be wrong to give them medical intervention to stop thier cancer. \n\nRealistically no christant thinks like this but I wonder why they don't think gender affirmative surgery is also just medical intervention.\n\n",
    "author_fullname": "t2_a9d7y1zw",
    "title": "Why do transphobic christans draw the line at gender affirmative surgery ",
    "upvote_ratio": 0.95,
    "ups": 169,
    "created": 1735374588.0,
    "created_utc": 1735374588.0,
    "num_comments": 53,
    "author": "RecentMonk1082",
    "id": "1ho1i8g",
    "created_datetime": "2024-12-28 08:29:48"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’ve always loved this song, and still do.\nI think for the most part it speaks of Lola with respect, compassion and love in a way that was truly radical considering the openly queer phobic society in which the song was released in 1970, almost 55 years ago.\n\nFor the UK (where The Kinks are from), homosexuality for men was only decriminalised in 1970, and people could only legally apply to change their gender since 2005. “Lola” was a song truly ahead of its time.\n\nHowever, when held up to modern standards, a few things have aged.\n\nIn particular, the line “…I’m a man, and so’s Lola”. There’s also a description where she “walks like a woman but talks like a man”. The narrator also has a bit of a crisis at realising she is trans, before it is ultimately resolved with his acceptance of Lola.\n\nHow do you personally feel about the song “Lola”?",
    "author_fullname": "t2_k68b5jq8",
    "title": "How do you feel about the song “Lola” by The Kinks?",
    "upvote_ratio": 0.95,
    "ups": 170,
    "created": 1735421355.0,
    "created_utc": 1735421355.0,
    "num_comments": 57,
    "author": "myearrings",
    "id": "1hoftcy",
    "created_datetime": "2024-12-28 21:29:15"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’m genuinely starting to think republicans see trans people as objects that are sexual… I mean when you look at the corn rates for trans women, it’s higher than other areas and yet they call us “sexual”. I think they literally see us as their deep dark secret and loss of control of their “sin”. Idk, just an observation I’ve seen. Not the only thing that plays into this but definitely a motivation they have. I think at least ",
    "author_fullname": "t2_lfwbfoh8t",
    "title": "Do right wingers see trans people as fedish’s? ",
    "upvote_ratio": 0.92,
    "ups": 169,
    "created": 1734192794.0,
    "created_utc": 1734192794.0,
    "num_comments": 69,
    "author": "Interesting_Sell2552",
    "id": "1he66u1",
    "created_datetime": "2024-12-14 16:13:14"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I really don't understand how so many trans people are so compassionate, I know not all trans people are like that, there are obviously also bad trans people, but it just seems like trans people are so much more likely to be cool when compared to cis people, I only know one cis person who is actually cool ",
    "author_fullname": "t2_hdwtsew",
    "title": "How are trans people so cool and compassionate?",
    "upvote_ratio": 0.94,
    "ups": 168,
    "created": 1734084803.0,
    "created_utc": 1734084803.0,
    "num_comments": 48,
    "author": "BaseAI",
    "id": "1hd9733",
    "created_datetime": "2024-12-13 10:13:23"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "they are growing and I don't want to mess them up but sometimes they hurt and it feels good to just.. squish them\n\nis this bad for growth or shape?\n\n💕izz",
    "author_fullname": "t2_eq2ehy8z",
    "title": "is it okay to massage the boobs?",
    "upvote_ratio": 0.96,
    "ups": 165,
    "created": 1733773742.0,
    "created_utc": 1733773742.0,
    "num_comments": 40,
    "author": "bella1138",
    "id": "1haijbr",
    "created_datetime": "2024-12-09 19:49:02"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "4 years ago I realized that I'm not comfortable in the body in which I was born and started to make various feminine changes: female perfume, remove hair on the whole body, female manicure, dress unisex.\n\nAfter a while I realized that I was non-binary and presented myself with a gender neutral name, then I started to realize that I wanted to be more feminine, that I might be a trans woman, changed my voice through training, changed my pronouns to “she”, started HRT, I had a lot of external changes to feminize my body, but my breasts grew small (as I wanted) and after a year I had a bottom vaginoplasty surgery and planned to change my gender and name to feminine in my documents.\n\nAfter 3 months post SRS surgery I recovered and realized I no longer wanted a woman's manicure, I wanted to wear more unisex clothes and I didn't want a complete social transition to woman. I probably won't even change my ID to female and socially I prefer to remain non-binary and I will probably keep my male ID and name. Plus I realize it's easier for me to be socially more muscular or non-binary than to be a woman. Now I can use any pronouns and any name for myself, but I love my new body and don't want to stop feminine HRT.\n\nIt turns out I'm making a mini-transition from trans woman to non-binary because after vaginoplasty my body dysphoria is completely gone, I'm happy to be in my body, but I don't want to make a complete social transition, I like that I can dress however I want, use my male voice and not have to change my gender on my name documents.\n\nThis unexpected change happened after a vaginoplasty with a trans woman who thought she was going to do a full transition, now I'm not sure about it and it's even weird, but I'm comfortable with it.\n\nThere is a difficulty in how I will be perceived in society and whether I should change my documents to female for easier access to swimming pools or doctors because I live in a transphobic country with bad laws.\n\nIt's like being a masculine lesbian or butch. It's very interesting... It's partly like FTM because I have male documents.  \nAnyone out there with a similar experience after SRS surgery?",
    "author_fullname": "t2_1f2kpxpt6k",
    "title": "After buttom surgery (SRS), I`m doing transition from t- woman to non-binary",
    "upvote_ratio": 0.92,
    "ups": 159,
    "created": 1734441490.0,
    "created_utc": 1734441490.0,
    "num_comments": 30,
    "author": "Worldly_Copy2131",
    "id": "1hgaevk",
    "created_datetime": "2024-12-17 13:18:10"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "hey, MTF here. by protected, i mean will GAC still be accessible for everyone? sorry for the short post, just a question about it. heard something about newsome trying to protect us from trump, but im not caught up to date on that. thanks for any info!",
    "author_fullname": "t2_d9pv7g11d",
    "title": "Will california be protected from trump's anti-trans laws?",
    "upvote_ratio": 0.95,
    "ups": 158,
    "created": 1735108980.0,
    "created_utc": 1735108980.0,
    "num_comments": 46,
    "author": "Muted_Curve_6466",
    "id": "1hlvj9s",
    "created_datetime": "2024-12-25 06:43:00"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "  \nWell, I don't even like men, I'm a transbian, but this whole thing invalidate . But I'm really tired of seeing trans girlimplying that a man who dates trans girls(binary) is in a gay relationship or that he is not straight. Maybe because of internalized transphobia or because they think they were gay man before transition, but this just feel so wrong, invalidating the whole trans community. Trans women are women as trans men are men. Doesn't matter if you have a dick or a pussy, reducing people to their genitals is bigotry and just stupidity.",
    "author_fullname": "t2_8ld8wd7",
    "title": "I hate how even among trans people they say men attracted to a transfem are gay/bi",
    "upvote_ratio": 0.89,
    "ups": 151,
    "created": 1735002890.0,
    "created_utc": 1735002890.0,
    "num_comments": 121,
    "author": "FirebenderAnnie",
    "id": "1hl2dby",
    "created_datetime": "2024-12-24 01:14:50"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "",
    "author_fullname": "t2_18sblx1may",
    "title": "Help Amplify Trans Voices: Support the Petition for an Independent Evaluation of the Cass Review on Child Gender Services",
    "upvote_ratio": 0.99,
    "ups": 153,
    "created": 1735216956.0,
    "created_utc": 1735216956.0,
    "num_comments": 1,
    "author": "GeekOnALeash01",
    "id": "1hmnlp2",
    "created_datetime": "2024-12-26 12:42:36"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I'm at month 6 and don't have a lot yet and am worried that I won't get more",
    "author_fullname": "t2_ve7sikbq",
    "title": "Is it true most breast development happens in months 3-6?",
    "upvote_ratio": 0.91,
    "ups": 147,
    "created": 1734467268.0,
    "created_utc": 1734467268.0,
    "num_comments": 110,
    "author": "idle_scrolling",
    "id": "1hgjze8",
    "created_datetime": "2024-12-17 20:27:48"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Recently, someone posted on a subreddit about how they don't think children should be able to get gender-affirming surgery. I am a cis man, but I have always thought banning gender affirming surgery for minors is wrong because of how harmful that could be to some people (though it's very few and far between when minors do get gender affirming surgeries). Do I think there should be a process and steps to take before arriving at that kind of a decision? Of course. But should any and all gender affirming care be banned? Absolutely not, that will always be extremely harmful no matter how many detransitioners there are. People often try to use detransitioners as an argument against gender affirming care, which is a problem in and of itself but that's another topic. I wanted to share my thoughts on such things and see if you all can add to my current view or if a change in my view is warranted and in what way:\n\nPeople in those comments are citing the potential harms of puberty blockers, hormone replacement, and the surgery.\n\nLet's look at another medical example: your child gets an infection in the arm which has a 20% chance of becoming septic and killing them if we do not amputate their arm. This will forever change their life, so you need to make a decision as their parent, with the doctor's guidance. If you choose to amputate because you don't want to risk them losing their life, would you like it if people called you a \"child abuser\" or \"child mutilator\"? If you chose to leave it up to fate and you didn't amputate, and then your child becomes septic and they either 1) Die, or 2) Barely survive and now they have severe medical problems for the rest of their life and they're severely mentally impaired.. you would wish that you had amputated their arm, and you'd never forgive yourself as that child's parent.\n\nAll this to say, in literally ANY medical decision a parent is forced to make for their child, you have to weigh the pros and the cons. The risks and the benefits. If the risks outweigh the benefits, then you should probably not perform the surgery. If the benefits outweigh the risks, however, and you think the chances of your child dying if you \\*don't\\* perform the surgery are high enough, then any parent worth their weight in salt would choose to perform the surgery. Obviously, that child will be affected negatively for the rest of their life--they literally don't have an arm because of you. But the alternative may have been much worse. And my question is, what percent chance of death would the child need to have for you to agree with the parent's decision to amputate? Is a 10% chance high enough? Or what about a 50% chance of death? When is it considered \"child abuse and mutilation\" to amputate versus \"necessary to save the child's life/health\"?\n\nAnd why should YOU--someone who is not this child's parent, someone who has no idea what situation the child is in, no idea what the parents have already tried and how hard they've worked to try and stop the infection from spreading without resorting to amputation, you, who has no medical expertise whatsoever, who is not a doctor, who is not a health professional—why should you have the authority to say \"no, that's child mutilation, and should always be banned, in every single case, because that child isn't old enough to consent to having their arm chopped off.\"? Why should you have that kind of jurisdiction? Why should lawmakers have that kind of jurisdiction? Waving a wand and banning all amputations for children is so harmful and deadly, but these lawmakers are \"doing it for the children\"?? When they don't even know what these children's individual situations are?? When these lawmakers have no medical expertise whatsoever, and they're not the parents of these children?? They're not doing it \"for the sake of the children,\" they're doing it to give THEMSELVES peace of mind! If they allow these surgeries to take place, then they feel morally responsible for them. But if they ban the surgeries, then all the child death and suffering that occurs as a result of that are just a \"secondary effect\" of the ban, and \"not the intended result\", so these lawmakers don't have to feel morally responsible for the harm that their ban has caused to children (and parents and doctors). They can have plausible deniability now because, in their minds, they banned something that would cause harm. So even if more children are suffering, and even if more children die due to their ban on gender affirming care, that doesn't matter to them because \"well, that's not the intended result\". \n\nIn my opinion, your intent does not excuse your impact. You don't get to weaponize your ignorance and lack of medical expertise against a vulnerable population of people just to make yourSELF feel better. That's very callous and self-righteous.\n\nIf my child has been on puberty blockers, hormones, and therapy for years and years now, and their genitalia is the one thing that is causing them severe dysphoria to the point where I've had to resuscitate my own child 6 times now due to their 6 suicide attempts, how much longer should I wait as a parent? How many suicide attempts should it take before I finally say \"this is the only thing we haven't tried, and I'm desperate to save my child's life\"? Or should I just watch as my child continues to commit suicide over the years until one day they finally succeed? At least then I can say to myself, \"well, I did the right thing because at least I didn't mutilate their genitalia,\" right? My child is now dead, but AT LEAST I didn't mutilate their genitalia. They would thank me, if they were still alive today. And all the transphobic bigots of the world thank me for my decision too, so I should feel content, right?\n\nI think trans people's very existence in this world has been politicized by us cisgender people to where they've been dehumanized so much that cis people can't even see how such discussions (on whether or not parents should be able to make informed medical decisions with their doctors to save their children’s lives/health/wellbeing) continue to harm trans people and their families. I personally hate having to talk about this to bigots who are so ignorant on the topic yet somehow feel they have the right to make these medical decisions on behalf of trans people (even adults). \n\nAnd I hate having to paint such an extreme scenario with a child who has attempted suicide 6 times just to make them understand the severity of what they're advocating for when they advocate to ban something so universally and absolutely. \n\nAnyway, thanks for reading. I hope I didn't upset anyone with how I talked so bluntly about this issue. ",
    "author_fullname": "t2_n37cv6fm",
    "title": "A Recent Post About How Children Shouldn't Be Able to Get Gender-Affirming Surgery",
    "upvote_ratio": 0.9,
    "ups": 150,
    "created": 1735600589.0,
    "created_utc": 1735600589.0,
    "num_comments": 54,
    "author": "SzayelGrance",
    "id": "1hq0h3z",
    "created_datetime": "2024-12-30 23:16:29"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hi I am 39 years old male, cis, and mostly consider myself straight. My wife recently told me she is considering transition to male. I told her I love her and will support her through the process. I would never leave her. She is mostly considering top transition.  We have a good relationship and got married earlier this month. I promised her I wouldn't reveal it to anyone. I feel like I am keeping my promise but looking for advice from others who understand my emotions.  ",
    "author_fullname": "t2_d9y6zmgs",
    "title": "I'm a cis male married to a woman considering transition ",
    "upvote_ratio": 0.92,
    "ups": 144,
    "created": 1735668620.0,
    "created_utc": 1735668620.0,
    "num_comments": 35,
    "author": "Ok-Abbreviations3859",
    "id": "1hqkfgf",
    "created_datetime": "2024-12-31 18:10:20"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I met a guy at my college a while ago and he’s super in love with me, we aren’t dating yet but i’m definitely considering it. (He’s bisexual and knows i’m a trans guy) He often jokes about sex, like about having a big dick or whatever (classic guy stuff ik) but also about sex with me specifically. The other day, he jokingly said i can fuck him any day, but then followed it up with “Wait no it would have to be the other way around thinking about it.” I said it wouldn’t have to, but chickened out and refused to elaborate when he asked what i meant. I don’t know what position he prefers in the bedroom (we’re both pretty young so he could still be a virgin too), but i’m worried me wanting to top will scare him off. I’m still a virgin but i really can’t stand the thought of bottoming, it’s just too dysphoric i guess. Besides, i can barely stand to see my naked body in the mirror, i can’t imagine trusting someone enough for them to see it. I wasn’t really planning on having sex till i’ve had surgery, but the waiting lists in the UK are so fucking long that it feels like it’s gonna take forever. Anyways, i really don’t know what to do. Do i just wait till it comes up in conversation, or do i tell him soon so he doesn’t get his hopes up or anything? He’s a sweet guy and i doubt a lack of sex would put him off, but i still worry.",
    "author_fullname": "t2_4s6zux3xm",
    "title": "My soon-to-be-boyfriend assumes i’m a bottom cuz i’m trans, how do i let him know i wanna top?",
    "upvote_ratio": 0.9,
    "ups": 137,
    "created": 1734769993.0,
    "created_utc": 1734769993.0,
    "num_comments": 41,
    "author": "sussymary",
    "id": "1hj5ppj",
    "created_datetime": "2024-12-21 08:33:13"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Seriously worried, I could never leave this country because no country that wants transfolk wants someone who's disabled and can't work. I'd end up in their welfare/disability system too and somehow I don't think another country would just up and allow that. ",
    "author_fullname": "t2_4y70nn5g",
    "title": "I'm on disability and get my HRT through Medicaid and PP, how screwed am I over Trump's new policies?",
    "upvote_ratio": 0.97,
    "ups": 141,
    "created": 1735183536.0,
    "created_utc": 1735183536.0,
    "num_comments": 49,
    "author": "Sophiadorbs",
    "id": "1hmfrzk",
    "created_datetime": "2024-12-26 03:25:36"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Hi,\n\nWith the government’s decision to ban puberty blockers for under 18s, there’s been so much misinformation and confusion surrounding their use. It’s devastating to see such a vital part of gender-affirming care for young people being dismissed, despite decades of research showing their safety and importance.\n\nTo help counter the misinformation, our team has collated a range of research and resources that provide evidence supporting the use of puberty blockers. You can find it all here: https://linktr.ee/prideinhealth \n\nHopefully, this can help those wanting to learn more, advocate for change, or share information with others. If you have any additional research or resources, feel free to share them in the comments.\n\nSending support t everyone navigating this difficult time💜",
    "author_fullname": "t2_1472a02tyk",
    "title": "Evidence supporting puberty blockers ",
    "upvote_ratio": 0.96,
    "ups": 140,
    "created": 1734207918.0,
    "created_utc": 1734207918.0,
    "num_comments": 4,
    "author": "PrideinHealthUK",
    "id": "1hebn03",
    "created_datetime": "2024-12-14 20:25:18"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I call my friends who are girls guys. I call my friends who are boys guys. I call my friends who are nb guys. All of my friends are okay with it. Also ive called all of them 'girly pop' at least once and theyve called me 'girly pop' at least once and they've seen no problem and neither have I. I'm transmasc and I don't see the problem BUT multiple times online ive gotten corrected on it and im like 'wait. maybe its not gender neutral???' so now im confused. Maybe it just depends on the person?",
    "author_fullname": "t2_71uge6ma8",
    "title": "Do you think 'guys', 'bro', 'sis', etc. are gender neutral terms?",
    "upvote_ratio": 0.9,
    "ups": 137,
    "created": 1735228788.0,
    "created_utc": 1735228788.0,
    "num_comments": 158,
    "author": "3mmett-kun",
    "id": "1hmr934",
    "created_datetime": "2024-12-26 15:59:48"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "my friend came out to me and i need to stop referring to them as a bitch, babe, or tell them to go make me a sandwich women.\n\ni swear i am not trolling i actually have a problem with this and i want to be inclusive when making fun of them.\n\nEdit: i've shown them this. it has now massively backfired on me as they are spamming me with insults",
    "author_fullname": "t2_1d3sm06fnf",
    "title": "what insults are gender inclusive",
    "upvote_ratio": 0.96,
    "ups": 135,
    "created": 1735494006.0,
    "created_utc": 1735494006.0,
    "num_comments": 72,
    "author": "gwendy__",
    "id": "1hp15vj",
    "created_datetime": "2024-12-29 17:40:06"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Vent post, Sorry. I don’t want to do it. So I’m still questioning shit and it sucks. But I want it to stop. I’m tired of this, I don’t want this. I feel like the more I think about it the more I fall in love with the idea but I can’t. I can’t be trans, I can’t be a girl, I have to stay a man. I respect all my trans folks but holy shit I can’t. I just need these thoughts to end. I don’t want this, I didn’t choose this. This is life altering shit that I don’t want. Especially since the election shits just getting worse and worse than before and that was bad already. It’s just not worth it. There gotta be a way to get rid of these thoughts that’s not conforming to them and allowing my self to try and be fem. I’m cis not trans. I’m probably just delusion since I’ve had no real friends in so long. I just want a community I need this gone. I know when I was younger I use to love watching mtf transformation comics and videos and even tried a fake website to turn into a girl when I was younger but I can’t do it. I have to be cis. Please help me, I’m tired of being me, tired of being a failure of a person and now son. My family would disown me and abandon me. I can’t lose those I care about. Help me.\n\nEdit: I’m not gonna try to explore anything. The more I explore the less I wanna know about myself. I’m don’t wanna know if I am or not trans. There gotta be a way to avoid it all together.\n\nWhy does a part of my want to be trans and then other not? It’s confusing. I just can’t wrap my head around it.\n\nEdit 2: Sorry I have more questions but when I’m told I’m not trans or it’s something else I get saddened or disappointed for some reason like a longing to fit into that criteria. Is that bad or good?",
    "author_fullname": "t2_diw4242y",
    "title": "I don’t want to be Trans",
    "upvote_ratio": 0.95,
    "ups": 140,
    "created": 1734750494.0,
    "created_utc": 1734750494.0,
    "num_comments": 121,
    "author": "Short-Yam-6696",
    "id": "1hj0u9n",
    "created_datetime": "2024-12-21 03:08:14"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "Does this make me a chaser? Can’t I just be attracted to females with whatever genitals? ",
    "author_fullname": "t2_15ssh5dc8x",
    "title": "I am attracted to femininity regardless of genitalia",
    "upvote_ratio": 0.91,
    "ups": 129,
    "created": 1734699493.0,
    "created_utc": 1734699493.0,
    "num_comments": 63,
    "author": "Smutty-Bi-Babe",
    "id": "1hij8lx",
    "created_datetime": "2024-12-20 12:58:13"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I already missed out on a real childhood as a girl. I’ll never get to have a girl’s teenage years either, and I know that I matter what I’ll probably never get to be the girl that my brain desperately wants me to be anyway, so I’ll never have the real future I should be having either. I’m kinda screwed over by being very masculine so hrt will only be so effective, and I’m starting to get old enough where it will be less efficient. I really doubt I’ll ever get to fully be the girl my brain needs me to be. Maybe I can be half of her. Anyway, it all just feels so pointless. I’m not even really living my own life. I can barely try in college because I’m too sad in the present and the future feels so hopeless. Really all I get to do everyday is feel miserable that I’m not a girl. What even is there for me if my past is ruined, my present is miserable, and my future will probably never work out well enough?",
    "author_fullname": "t2_gl2opkj3",
    "title": "Life being trans feels pointless",
    "upvote_ratio": 0.96,
    "ups": 129,
    "created": 1734922717.0,
    "created_utc": 1734922717.0,
    "num_comments": 69,
    "author": "youthinkyouknowme444",
    "id": "1hkeiwx",
    "created_datetime": "2024-12-23 02:58:37"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I once had a dream where I was able to get estrogen gumballs, and I'd love to see what other creative things folks can come up with ",
    "author_fullname": "t2_2bifaj",
    "title": "For fun: what method of HRT delivery do you wish existed?",
    "upvote_ratio": 0.99,
    "ups": 130,
    "created": 1734517038.0,
    "created_utc": 1734517038.0,
    "num_comments": 118,
    "author": "Rocket-kun",
    "id": "1hgynaw",
    "created_datetime": "2024-12-18 10:17:18"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’ve been thinking about going on HRT for a while (mtf) and am just curious about what changes have happened to those who have been on it that you weren’t expecting. For me specifically I hope that my hands change, I hate how manly my hands look, even with no hair and nail polish",
    "author_fullname": "t2_klav2myo",
    "title": "What parts of the body does HRT change that you wouldn’t expect?",
    "upvote_ratio": 0.98,
    "ups": 128,
    "created": 1734274317.0,
    "created_utc": 1734274317.0,
    "num_comments": 161,
    "author": "One_Inspection_8297",
    "id": "1heu4d1",
    "created_datetime": "2024-12-15 14:51:57"
  },
  {
    "subreddit": "asktransgender",
    "selftext": "I’ve argued with many TERFs before, but for some reason, they always just get definitions wrong and play it off as fact? And if you try to explain it, they cherry pick wording… what’s wrong with these people? 😭",
    "author_fullname": "t2_fu0ni5cx",
    "title": "Why do TERFs only use semantics in their arguments?",
    "upvote_ratio": 0.91,
    "ups": 128,
    "created": 1733595910.0,
    "created_utc": 1733595910.0,
    "num_comments": 38,
    "author": "Routine_Tiger7589",
    "id": "1h8ypgs",
    "created_datetime": "2024-12-07 18:25:10"
  }
]