[
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_ulg9u",
    "title": "Transgender 10-year-old worries about being murdered and other trans kids share their concerns on CNN. Violet DuMont says she fears that \"I’m gonna be walking down the street and somebody’s gonna come up and, like, shoot me or something.”",
    "upvote_ratio": 0.96,
    "ups": 1136,
    "created": 1733696928.0,
    "created_utc": 1733696928.0,
    "num_comments": 61,
    "author": "southpawFA",
    "id": "1h9unzv",
    "created_datetime": "2024-12-08 22:28:48"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "81 Democrats Voted To Pull Care From Service Member's Trans kids. Here Are The Names.",
    "upvote_ratio": 0.99,
    "ups": 1129,
    "created": 1733971648.0,
    "created_utc": 1733971648.0,
    "num_comments": 144,
    "author": "ErinInTheMorning",
    "id": "1hcbb9z",
    "created_datetime": "2024-12-12 02:47:28"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Libs Of TikTok banned from Bluesky after just 9 days on the site",
    "upvote_ratio": 0.99,
    "ups": 969,
    "created": 1733588668.0,
    "created_utc": 1733588668.0,
    "num_comments": 33,
    "author": "OverallEcho9694",
    "id": "1h8w0zl",
    "created_datetime": "2024-12-07 16:24:28"
  },
  {
    "subreddit": "transgender",
    "selftext": "“For transgender Americans looking for help or protection from the Biden administration in its dying days, Raquel Willis has a stark assessment.”\n\n\"Unfortunately, the signals coming from our government right now, under a Democratic president, are telling us that we’re essentially on our own,\" the 33-year-old activist tells The Independent.”\n\n“That is nothing new for the woman behind last week’s headline-grabbing Congressional bathroom sit-in, protesting Republicans’ attempt to ban trans people from using the correct bathrooms for their gender on any federal property.”\n\n“Alongside former US Army whistleblower and trans rights advocate Chelsea Manning, Willis was among 15 people arrested by Capitol police for occupying the women’s bathroom and the hallway outside House speaker Mike Johnson’s office.”\n\n“But that protest wasn’t only aimed at Republicans. It was also meant to push Democrats to abandon what Willis describes as \"a pattern of ignoring and sidelining the trans community\" in the face of escalating conservative attacks.”\n\n“Just hours after Willis’s interview with The Independent, House and Senate negotiators revealed a bipartisan compromise spending bill that would ban military health insurance from covering transition care for children. On Wednesday, 50 House Democrats who previously denounced that provision voted in favor, and key Senate Democrats said they would reluctantly back it too.”\n\n“Now, with Republicans taking control of all three branches of government and both houses of Congress in January, Willis is gearing up for a fight – and she does not believe trans people can afford to take their cues from Democrats.”\n\n\"We have to be prepared to take care of ourselves, and speak for ourselves, and fight for ourselves, because there are not enough political leaders who are sticking up for us,” she says.”\n",
    "author_fullname": "t2_igjus2v7",
    "title": "The woman behind Capitol bathroom protest says trans people can't trust Democrats to protect them",
    "upvote_ratio": 0.99,
    "ups": 833,
    "created": 1734277114.0,
    "created_utc": 1734277114.0,
    "num_comments": 50,
    "author": "OverallEcho9694",
    "id": "1hev3jt",
    "created_datetime": "2024-12-15 15:38:34"
  },
  {
    "subreddit": "transgender",
    "selftext": "“President-elect Donald Trump on Sunday pledged to ‘stop the transgender lunacy’ on day one of his presidency, as Republicans -- set to control both chambers of Congress and the White House -- continue their push against LGBTQ rights.\n\n\"’I will sign executive orders to end child sexual mutilation, get transgender out of the military and out of our elementary schools and middle schools and high schools,’ the president-elect said at an event for young conservatives in Phoenix, Arizona.\n\n“He also vowed to ‘keep men out of women's sports,’ adding that ‘it will be the official policy of the United States government that there are only two genders, male and female.’”\n\n“Transgender issues have roiled US politics in recent years, as Democratic- and Republican-controlled states have moved in opposite directions on policy such as medical treatment and what books on the topic are allowed in public or school libraries.\n\n“Last week, when the US Congress approved its annual defense budget, it included a provision to block funding of some gender-affirming care for the transgender children of service members.”",
    "author_fullname": "t2_supmldzm",
    "title": "Trump vows to 'stop transgender lunacy' as a top priority",
    "upvote_ratio": 0.97,
    "ups": 821,
    "created": 1734905341.0,
    "created_utc": 1734905341.0,
    "num_comments": 347,
    "author": "onnake",
    "id": "1hk91k9",
    "created_datetime": "2024-12-22 22:09:01"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Gender-affirming surgeon wishes politicians would ‘listen’ to her trans patients",
    "upvote_ratio": 0.99,
    "ups": 780,
    "created": 1735113390.0,
    "created_utc": 1735113390.0,
    "num_comments": 23,
    "author": "jackmolay",
    "id": "1hlwh9a",
    "created_datetime": "2024-12-25 07:56:30"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://archive.is/DK8NJ\n\n“Last month, when Speaker Mike Johnson made a rule banning Rep. Sarah McBride, D-Del., from women’s bathrooms on the House side of the Capitol, the first openly transgender member of Congress agreed to obey.\n\n“‘I’m not here to fight about bathrooms,’ she wrote on X.\n\n“The news sent a shudder through the trans community, and prompted journalist Baily Wayne Hundl of the Meteor to write, ‘Girl, why?’\n\n“I’ll tell you why: McBride had no choice and no allies. She knew Republicans wanted a fight and a spectacle so they could keep trans people (of which I am one) at the center of media attention after an election campaign that scapegoated and demonized us nonstop.”\n\n“When a winning candidate uses 41% of his messaging to attack a group comprising less than 1% of the population, what is the impact on that minority?\n\n“I’ll tell you: they become an untouchable caste, with no allies.”\n\n“If it sounds like I’m terrified, I am — as are many trans Americans and their families.”\n\n“But what terrifies me most doesn’t just concern trans people. I’ll pose my fear as a question: What percentage of the German population was Jewish at the time of Hitler’s rise? The answer — 0.75% — is lower than most people guess.”",
    "author_fullname": "t2_supmldzm",
    "title": "2024 was the year trans people like me became untouchables",
    "upvote_ratio": 0.98,
    "ups": 711,
    "created": 1735657084.0,
    "created_utc": 1735657084.0,
    "num_comments": 82,
    "author": "onnake",
    "id": "1hqgcew",
    "created_datetime": "2024-12-31 14:58:04"
  },
  {
    "subreddit": "transgender",
    "selftext": "“A transgender woman filed a court petition Tuesday arguing that her transfer to a men’s prison, where she has been in solitary confinement for months, constitutes cruel punishment.\n\n“Amber Kim, 36, had been incarcerated at the Washington Corrections Center for Women in Pierce County for nearly four years, receiving gender-affirming care in gender-affirming housing. This June, she was transferred to the Monroe Correctional Complex, a men’s prison, after receiving an infraction, as HuffPost originally reported.\n\n“It’s the first time in state history that a transgender person has been moved from gender-affirming housing back to housing that aligns with the gender they were assigned at birth.”\n\n“Kim’s transfer came about three months after she received an infraction for having sex with another incarcerated woman. The infraction report was leaked to a right-wing magazine and picked up by larger conservative media outlets, which misgendered Kim and implied it could not have been consensual. Kim says it was.\n\n“DOC policy says incarcerated transgender people placed in a gender-affirming facility may be transferred ‘due to documented, objective safety and security concerns.’”\n\n",
    "author_fullname": "t2_supmldzm",
    "title": "Trans woman argues move to Wash. men’s prison is cruel punishment",
    "upvote_ratio": 0.98,
    "ups": 711,
    "created": 1734532844.0,
    "created_utc": 1734532844.0,
    "num_comments": 63,
    "author": "onnake",
    "id": "1hh2zpv",
    "created_datetime": "2024-12-18 14:40:44"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Puberty blockers to be banned indefinitely for under-18s across UK | Transgender",
    "upvote_ratio": 0.97,
    "ups": 694,
    "created": 1733926152.0,
    "created_utc": 1733926152.0,
    "num_comments": 146,
    "author": "jackmolay",
    "id": "1hbu9sk",
    "created_datetime": "2024-12-11 14:09:12"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Black trans woman Cameron Thompson, 18, shot to death in Alabama",
    "upvote_ratio": 0.98,
    "ups": 697,
    "created": 1734688493.0,
    "created_utc": 1734688493.0,
    "num_comments": 26,
    "author": "OverallEcho9694",
    "id": "1higiv4",
    "created_datetime": "2024-12-20 09:54:53"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "JK Rowling Falsely Claims \"There Are No Trans Kids\"",
    "upvote_ratio": 0.96,
    "ups": 689,
    "created": 1735498339.0,
    "created_utc": 1735498339.0,
    "num_comments": 160,
    "author": "ErinInTheMorning",
    "id": "1hp2te0",
    "created_datetime": "2024-12-29 18:52:19"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_t859s7gn",
    "title": "The FL Department of Corrections is attempting to \"reverse\" the gender identity of transgender people in its custody, referring to trans identities as \"short-term delusions\" and withholding hormone therapy",
    "upvote_ratio": 0.98,
    "ups": 682,
    "created": 1733864227.0,
    "created_utc": 1733864227.0,
    "num_comments": 82,
    "author": "NorCalFrances",
    "id": "1hbc2sr",
    "created_datetime": "2024-12-10 20:57:07"
  },
  {
    "subreddit": "transgender",
    "selftext": "“To all the idiots who claimed the shooter was trans with no information whatsoever to believe that, f‑‑‑ off. Your ignorance speaks volumes. Your hate is consuming your brains (or what’s left of them),”\n\n–Rep. Mark Pocan (D-Wis.), chair of the Congressional Equality Caucus",
    "author_fullname": "t2_145hjveotc",
    "title": "Equality Caucus chair tells ‘idiots’ who claimed Wisconsin shooter was trans to ‘f‑‑‑ off’",
    "upvote_ratio": 0.99,
    "ups": 670,
    "created": 1734484522.0,
    "created_utc": 1734484522.0,
    "num_comments": 31,
    "author": "Professor603",
    "id": "1hgq5w5",
    "created_datetime": "2024-12-18 01:15:22"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_9ej7q",
    "title": "Judith Butler, philosopher: ‘If you sacrifice a minority like trans people, you are operating within a fascist logic’",
    "upvote_ratio": 1.0,
    "ups": 667,
    "created": 1734280710.0,
    "created_utc": 1734280710.0,
    "num_comments": 7,
    "author": "LocutusOfBorges",
    "id": "1heweds",
    "created_datetime": "2024-12-15 16:38:30"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3dfr109u",
    "title": "Biden ‘Strongly Opposes’ Anti-trans Legislation, But Signs It Anyway ",
    "upvote_ratio": 0.97,
    "ups": 632,
    "created": 1735052961.0,
    "created_utc": 1735052961.0,
    "num_comments": 122,
    "author": "DCGirl20874",
    "id": "1hlffjd",
    "created_datetime": "2024-12-24 15:09:21"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Netflix's trans stars urge fighting hatred with visibility: 'We must persist'",
    "upvote_ratio": 0.99,
    "ups": 624,
    "created": 1734084749.0,
    "created_utc": 1734084749.0,
    "num_comments": 24,
    "author": "jackmolay",
    "id": "1hd96n4",
    "created_datetime": "2024-12-13 10:12:29"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_kt846",
    "title": "GOP Senator Introduces Bill To Legally Erase Transgender People ⋆ Officially titled the “Defining Male and Female Act of 2024,” Marshall’s bill will apparently put an end to what he considered the Biden administration’s attempt to “replace biological sex with dangerous radical gender ideology,”",
    "upvote_ratio": 0.98,
    "ups": 620,
    "created": 1733601157.0,
    "created_utc": 1733601157.0,
    "num_comments": 125,
    "author": "Newsboy13",
    "id": "1h90nid",
    "created_datetime": "2024-12-07 19:52:37"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_1qxg3fw0",
    "title": "Costco: At LAST a company that pushes back on the anti-DEI bullies",
    "upvote_ratio": 0.99,
    "ups": 613,
    "created": 1735368232.0,
    "created_utc": 1735368232.0,
    "num_comments": 31,
    "author": "FreeClimbing",
    "id": "1ho0179",
    "created_datetime": "2024-12-28 06:43:52"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Bluesky faces first LGBTQ+ safety test as users call for anti-trans podcaster Jesse Singal ban",
    "upvote_ratio": 0.98,
    "ups": 620,
    "created": 1734191184.0,
    "created_utc": 1734191184.0,
    "num_comments": 40,
    "author": "OverallEcho9694",
    "id": "1he5m47",
    "created_datetime": "2024-12-14 15:46:24"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_1blw5c51s0",
    "title": "Disney Pulls Transgender Storyline from Pixar’s 'Win or Lose'",
    "upvote_ratio": 0.98,
    "ups": 611,
    "created": 1734471357.0,
    "created_utc": 1734471357.0,
    "num_comments": 91,
    "author": "ItsRenaBaker",
    "id": "1hglhmk",
    "created_datetime": "2024-12-17 21:35:57"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "California passes law preventing schools from forcing teachers to out LGBTQ+ kids",
    "upvote_ratio": 0.99,
    "ups": 596,
    "created": 1735379138.0,
    "created_utc": 1735379138.0,
    "num_comments": 14,
    "author": "jackmolay",
    "id": "1ho2hp4",
    "created_datetime": "2024-12-28 09:45:38"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_dd31er6a",
    "title": "‘Very disheartened’: trans actor speaks out as Disney changes her Pixar character to be cisgender",
    "upvote_ratio": 0.99,
    "ups": 601,
    "created": 1734546559.0,
    "created_utc": 1734546559.0,
    "num_comments": 32,
    "author": "GenderPettifogging",
    "id": "1hh84qz",
    "created_datetime": "2024-12-18 18:29:19"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "Nancy Mace Calls Trans People A Slur After Sit-Ins In Capitol Bathrooms",
    "upvote_ratio": 0.99,
    "ups": 590,
    "created": 1733511958.0,
    "created_utc": 1733511958.0,
    "num_comments": 71,
    "author": "ErinInTheMorning",
    "id": "1h89008",
    "created_datetime": "2024-12-06 19:05:58"
  },
  {
    "subreddit": "transgender",
    "selftext": "“President-elect Donald Trump said transgender issues only affect a ‘very small number of people.’\n\n“Trump was named TIME Magazine's 2024 Person of the Year on Thursday. In his interview with the magazine, he said ‘the bathroom issue’ only pertains to a small amount of people and it's tearing the country apart. He also advocated for people to go ‘along with’ the Supreme Court's rulings.\n\n\"’I don't want to get into the bathroom issue. Because it's a very small number of people we're talking about, and it's ripped apart our country, so they'll have to settle whatever the law finally agrees,’ Trump said after being asked about whether ‘transgender people could use whatever bathroom they chose.’”\n\n“A spokesperson for Trump said that he has plans for Day 1 in office, which range from settling the Russian and Ukrainian war to removing protections for transgender students.\n\n\"’I am a big believer in the Supreme Court, and I'm going to go by their rulings, and so far, I think their rulings have been rulings that people are going along with,’ Trump said, ‘but we're talking about a very small number of people, and we're talking about it, and it gets massive coverage, and it's not a lot of people.’”\n\n“Trump said in his interview with TIME that he does agree with [Sarah] McBride, suggesting the lawmakers should be focused on more important issues.\n\n\"’I do agree with that,’ Trump said. ‘On that—absolutely. As I was saying, it's a small number of people.’”",
    "author_fullname": "t2_supmldzm",
    "title": "Donald Trump Downplays Transgender Issues: 'Very Small Number of People'",
    "upvote_ratio": 0.96,
    "ups": 558,
    "created": 1734034298.0,
    "created_utc": 1734034298.0,
    "num_comments": 301,
    "author": "onnake",
    "id": "1hcu400",
    "created_datetime": "2024-12-12 20:11:38"
  },
  {
    "subreddit": "transgender",
    "selftext": "“During the final hours of Ohio legislature’s 135th Congressional Session, lawmakers passed a piece of legislation limiting transgender Ohioans’ ability to run for public office.\n\n“Members of the Ohio Senate voted to pass the legislation after members of the House Government Oversight Committee rolled its language into Senate Bill (SB) 71 – a separate piece of legislation regarding electoral policy.\n\n“Aside from an explicit exception that allows married women to omit their maiden names via the same candidacy petition, Ohioans are already required to list any legal name changes that occurred within the last five years on their petitions for candidacy. \n\n“SB 71 will further codify the requirement by updating the existing candidacy form to include a designated space to list former legal names and allowing voters registered under any political party to challenge the legitimacy of any candidate based on the suspected existence of prior legal names – both of which could affect transgender candidates disproportionately.”\n\n“Democrats introduced their own legislation to help protect transgender candidates from discrimination throughout the candidacy application and election processes, but the bill failed to gain traction in the Ohio House.”\n\n“SB 71 now awaits Gov. Mike DeWine’s signature.”",
    "author_fullname": "t2_supmldzm",
    "title": "Republican lawmakers quietly pass bill targeting transgender Ohioans’ ability to run for public office",
    "upvote_ratio": 0.99,
    "ups": 547,
    "created": 1735573785.0,
    "created_utc": 1735573785.0,
    "num_comments": 45,
    "author": "onnake",
    "id": "1hpq38a",
    "created_datetime": "2024-12-30 15:49:45"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://archive.is/cyj6V\n\n“The Air Force lieutenant colonel left the Pentagon one day and returned the next — with a new name and a new gender identity.\n\n“Bree Fram remembers the atmosphere in 2020 as welcoming and supportive. Her colleagues brought cookies. When the Pentagon officially changed her gender in employment records, she felt her journey was complete.\n\n“Fram is one of thousands of transgender people working openly in government positions, including the Defense and State departments, intelligence agencies and various other federal branches. An estimated 15,000 transgender people work in the military alone. They say acceptance and support has surged in recent years.\n\n“But many are now worried that the broad advances they achieved over the last decade will be reversed under President-elect Donald Trump, who has likened gender transition to “mutilation,” vowed to roll back job protections and healthcare for trans workers and threatened to reimpose a ban against transgender people serving in the military.”",
    "author_fullname": "t2_supmldzm",
    "title": "Transgender people working in U.S. government see peril under Trump",
    "upvote_ratio": 0.99,
    "ups": 543,
    "created": 1734624595.0,
    "created_utc": 1734624595.0,
    "num_comments": 35,
    "author": "onnake",
    "id": "1hhwa6m",
    "created_datetime": "2024-12-19 16:09:55"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_ulg9u",
    "title": "New Florida Policy on Trans Care in Prison Like “Conversion Therapy”. With new restrictions on gender-affirming care, prisons confiscate underwear from trans people and compel them to cut their hair.",
    "upvote_ratio": 0.98,
    "ups": 538,
    "created": 1733870947.0,
    "created_utc": 1733870947.0,
    "num_comments": 45,
    "author": "southpawFA",
    "id": "1hbenta",
    "created_datetime": "2024-12-10 22:49:07"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "A Last Moment Of Warmth Before The Anti-Trans Storm",
    "upvote_ratio": 0.99,
    "ups": 534,
    "created": 1735241759.0,
    "created_utc": 1735241759.0,
    "num_comments": 10,
    "author": "ErinInTheMorning",
    "id": "1hmw1ll",
    "created_datetime": "2024-12-26 19:35:59"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Florida Judge Allows State Prison Officials to Withhold Medical Care for Transgender Incarcerated People | American Civil Liberties Union",
    "upvote_ratio": 0.99,
    "ups": 500,
    "created": 1735594732.0,
    "created_utc": 1735594732.0,
    "num_comments": 50,
    "author": "OverallEcho9694",
    "id": "1hpy8ot",
    "created_datetime": "2024-12-30 21:38:52"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Police chief begs transphobes to stop saying Wisconsin school shooter was trans",
    "upvote_ratio": 0.99,
    "ups": 505,
    "created": 1734445139.0,
    "created_utc": 1734445139.0,
    "num_comments": 34,
    "author": "OverallEcho9694",
    "id": "1hgblvd",
    "created_datetime": "2024-12-17 14:18:59"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_145hjveotc",
    "title": "Gender-affirming surgery disappeared from the U.S. for decades. Now the field is fighting to keep its gains",
    "upvote_ratio": 0.99,
    "ups": 486,
    "created": 1734955833.0,
    "created_utc": 1734955833.0,
    "num_comments": 9,
    "author": "Professor603",
    "id": "1hkmgac",
    "created_datetime": "2024-12-23 12:10:33"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "Our Wedding, From The Woman Who Loves Zooey Zephyr",
    "upvote_ratio": 0.98,
    "ups": 475,
    "created": 1734457134.0,
    "created_utc": 1734457134.0,
    "num_comments": 40,
    "author": "ErinInTheMorning",
    "id": "1hgg2v1",
    "created_datetime": "2024-12-17 17:38:54"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Montana Supreme Court upholds lower court ruling that allows gender-affirming care for minors",
    "upvote_ratio": 0.99,
    "ups": 466,
    "created": 1733944578.0,
    "created_utc": 1733944578.0,
    "num_comments": 11,
    "author": "OverallEcho9694",
    "id": "1hc1g6a",
    "created_datetime": "2024-12-11 19:16:18"
  },
  {
    "subreddit": "transgender",
    "selftext": "“It feels like we are regressing as a society when it comes to LGBTQ rights. Here in the UK, the Labour government recently upheld a ban on puberty blockers for transgender kids under the age of eighteen, while debates about trans athletes dominated the Olympics, despite no trans person competing. Our general existence has become a political punching bag. It sucks, and as a trans person, it can be hard to keep going sometimes.\n\n“But you turn this anger into hope, and remain confident that there are more good people in this world than bad who either don’t think much about transgender people living their lives (the vast majority), or do all they can to support them. We also search for purpose and representation in popular culture, which for younger audiences normally means the shows they watch, video games they play, and people they follow online. There is plenty of positive queer reinforcement to be found, but again and again, the biggest corporations on the planet have made it clear we are nothing more than a demographic to be taken advantage of.”\n",
    "author_fullname": "t2_supmldzm",
    "title": "Disney Erasing Trans Stories Is A Symbol Of Our Regression",
    "upvote_ratio": 0.99,
    "ups": 465,
    "created": 1734623692.0,
    "created_utc": 1734623692.0,
    "num_comments": 22,
    "author": "onnake",
    "id": "1hhvxrb",
    "created_datetime": "2024-12-19 15:54:52"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Watch: Disney’s Transgender Bathroom Scene Leaks Online - Inside the Magic",
    "upvote_ratio": 0.98,
    "ups": 459,
    "created": 1735467789.0,
    "created_utc": 1735467789.0,
    "num_comments": 40,
    "author": "jackmolay",
    "id": "1hota2k",
    "created_datetime": "2024-12-29 10:23:09"
  },
  {
    "subreddit": "transgender",
    "selftext": "“The Supreme Court declined Monday to hear an appeal from a group of parents who say their Wisconsin school district is hiding transgender support plans involving their children.\n\n“Three conservatives said they would have heard the case: Justices Brett Kavanaugh, Samuel Alito and Clarence Thomas. While the Supreme Court didn’t say why it declined to hear the case, a lower court had ruled against the parents because, it said, they didn’t have standing to sue since they didn’t demonstrate the policy affected their children.”\n\n“The parents claim the school’s policy facilitates ‘gender identity transitions at school’ and keeps the effort ‘hidden from parents who would disagree that it is in their child’s best interest.’\n\n“Eau Claire Area School District officials counter that gender support plans are included in a student’s record and are available for parents to see. The policy, school officials said, is intended ‘to provide support to students who express concern about their gender identity.’\n\n“‘The issue in the Wisconsin case is less about the underlying question of parental rights, and more about what plaintiffs have to show before they’re allowed to challenge government actions that may not have happened and may not ever happen,’ said Steve Vladeck, CNN Supreme Court analyst and professor at Georgetown University Law Center.”\n\n“Similar cases have made their way to the Supreme Court before. The justices in May denied an appeal from a group of parents in suburban Washington who made the same argument. The challenge for the parents groups is being able to demonstrate that they were specifically harmed by the policy.”",
    "author_fullname": "t2_supmldzm",
    "title": "Supreme Court turns away Wisconsin parents who say schools are hiding transgender support plans as Alito dissents",
    "upvote_ratio": 0.99,
    "ups": 462,
    "created": 1733757872.0,
    "created_utc": 1733757872.0,
    "num_comments": 33,
    "author": "onnake",
    "id": "1hac5so",
    "created_datetime": "2024-12-09 15:24:32"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_lqcol",
    "title": "Trump's FTC pick lays out agenda target transgender people",
    "upvote_ratio": 0.98,
    "ups": 450,
    "created": 1733528964.0,
    "created_utc": 1733528964.0,
    "num_comments": 88,
    "author": "newly_me",
    "id": "1h8fb5r",
    "created_datetime": "2024-12-06 23:49:24"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_t859s7gn",
    "title": "Democratic senators introduce defense bill amendment to block GOP transgender restriction. This allows them to vote for the defense bill and if the amendment doesn't pass, well, they tried.",
    "upvote_ratio": 0.98,
    "ups": 435,
    "created": 1734398192.0,
    "created_utc": 1734398192.0,
    "num_comments": 53,
    "author": "NorCalFrances",
    "id": "1hfz3v7",
    "created_datetime": "2024-12-17 01:16:32"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://archive.is/Xi2n8\n\n“At least eight Los Angeles County sheriff’s deputies have been relieved of duty amid a federal investigation into the beating of a transgender man last year in a 7-Eleven parking lot, according to several law enforcement sources.\n\n“Last week, nearly two years after the incident, Deputy Joseph Benza III agreed to plead guilty to one felony civil rights violation in federal court. In his plea agreement, Benza admitted that he lied to the FBI about the incident and alleged that numerous other deputies and sergeants helped obstruct the investigation and cover up the misconduct.”\n\n“Sheriff’s officials would not specify how many employees have been sidelined, but half a dozen sources in the department told The Times that eight people — including several sergeants — were relieved of duty. The sources requested anonymity because they were not authorized to speak publicly.”\n\n“Benza is due back in court Jan. 17, when he is expected to plead guilty to one count of deprivation of rights under color of law, a charge that carries a maximum penalty of 10 years in federal prison.”\n",
    "author_fullname": "t2_supmldzm",
    "title": "Multiple L.A. sheriff’s deputies relieved of duty as feds probe beating of trans teacher",
    "upvote_ratio": 0.99,
    "ups": 430,
    "created": 1735166305.0,
    "created_utc": 1735166305.0,
    "num_comments": 27,
    "author": "onnake",
    "id": "1hmapug",
    "created_datetime": "2024-12-25 22:38:25"
  },
  {
    "subreddit": "transgender",
    "selftext": "“President Joe Biden is abandoning his efforts to provide some protections for transgender student athletes and cancel student loans for more than 38 million Americans, the first steps in an administration-wide plan to jettison pending regulations to prevent President-elect Donald Trump from retooling them to achieve his own aims.\n\n“The White House expects to pull back unfinished rules across several agencies if there isn’t enough time to finalize them before Trump takes office. If the proposed regulations were left in their current state, the next administration would be able to rewrite them and advance its agenda more quickly.”\n\n“As the pending Biden regulations are withdrawn, nothing prevents Trump from pursuing his own regulations on the same issues when he returns to the White House, but he would have to start from scratch in a process that can take months or even years.”\n\n“For the regulation on transgender students, the department said it was withdrawing the proposal because of ongoing litigation over how Title IX, the landmark law preventing sex discrimination, should handle issues of gender identity. In addition, the department said there were 150,000 public comments with a range of feedback, including suggestions for modifications that needed to be considered.”\n\n“Biden’s rule on transgender sports was proposed in 2023 but was delayed multiple times. It was supposed to be a follow-up to his broader rule that extended civil rights protections to LGBTQ+ students under Title IX.”",
    "author_fullname": "t2_supmldzm",
    "title": "White House starts scrapping pending regulations on transgender athletes and student debt",
    "upvote_ratio": 0.98,
    "ups": 428,
    "created": 1734732827.0,
    "created_utc": 1734732827.0,
    "num_comments": 101,
    "author": "onnake",
    "id": "1hiv7e0",
    "created_datetime": "2024-12-20 22:13:47"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "For transgender people, now living in the United States amounts to living in enemy territory, and putting their agency to sleep, at least for the next four years.",
    "upvote_ratio": 0.94,
    "ups": 428,
    "created": 1735113980.0,
    "created_utc": 1735113980.0,
    "num_comments": 57,
    "author": "jackmolay",
    "id": "1hlwlwu",
    "created_datetime": "2024-12-25 08:06:20"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_1cesc3k0td",
    "title": "Current Draft of 2025 Health and Human Services Appropriations Bill (funding medicare/medicaid) Includes Blanket Restrictions on Funding Any Transition Care for Adults or Minors",
    "upvote_ratio": 0.99,
    "ups": 431,
    "created": 1734333922.0,
    "created_utc": 1734333922.0,
    "num_comments": 107,
    "author": "MyNextTransThrowaway",
    "id": "1hfdv6t",
    "created_datetime": "2024-12-16 07:25:22"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_t859s7gn",
    "title": "From the UKtransgender sub, in case you missed it: New guidance on \"deception as to sex\" charges. If you pass, don't disclose that you are trans, and have sex with someone, it may be considered r*pe.",
    "upvote_ratio": 0.99,
    "ups": 424,
    "created": 1734923957.0,
    "created_utc": 1734923957.0,
    "num_comments": 38,
    "author": "NorCalFrances",
    "id": "1hkevqb",
    "created_datetime": "2024-12-23 03:19:17"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://archive.is/vmfDj\n\n“Zoei Montgomery is so nervous about President-elect Donald Trump’s second presidency that she is making plans to escape to Canada if life in the United States becomes intolerable for her as a transgender woman.\n\n“The middle school custodian fears the incoming president will follow the lead of Republican governors who have restricted access to gender-affirming care and made it illegal for people to change their gender markers on official documents.\n\n“‘I would hate to leave home,’ said Montgomery, 25, who lives in Washington state. ‘But it makes me less anxious to have an exit plan in place.’\n\n“As Trump’s inauguration nears, some LGBTQ+ people are anxiously preparing for what they fear will be a rollback of their rights. Some in same-sex relationships are making plans to marry or adopt children. Others are moving to states that they believe will offer them more protection. Transgender people are stockpiling medications, worried that their access to gender transition care will be cut off.\n\n“Trump has vowed to prohibit gender transition care for children and eliminate any federal spending on those treatments for adults. He has also promised to ask Congress to pass a bill stating that there are only two genders and that they are assigned at birth. And the incoming president wants to use Title IX protections to ensure that transgender women can’t play on women’s sports teams.”\n\n",
    "author_fullname": "t2_supmldzm",
    "title": "LGBTQ+ Americans stockpile meds and make plans to move after Trump’s win",
    "upvote_ratio": 0.99,
    "ups": 423,
    "created": 1733786875.0,
    "created_utc": 1733786875.0,
    "num_comments": 52,
    "author": "onnake",
    "id": "1hano69",
    "created_datetime": "2024-12-09 23:27:55"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "Democratic Senators Refuse Vote To Remove Anti-Trans Amendment From Military Budget",
    "upvote_ratio": 1.0,
    "ups": 421,
    "created": 1734562621.0,
    "created_utc": 1734562621.0,
    "num_comments": 79,
    "author": "ErinInTheMorning",
    "id": "1hheaij",
    "created_datetime": "2024-12-18 22:57:01"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "37 Democratic Senators Voted To Pass Anti-Trans NDAA. Here Are Their Names.",
    "upvote_ratio": 0.98,
    "ups": 411,
    "created": 1734622514.0,
    "created_utc": 1734622514.0,
    "num_comments": 54,
    "author": "ErinInTheMorning",
    "id": "1hhvifg",
    "created_datetime": "2024-12-19 15:35:14"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Sandi Toksvig: Anti-trans people don’t have any trans friends",
    "upvote_ratio": 0.98,
    "ups": 397,
    "created": 1734604191.0,
    "created_utc": 1734604191.0,
    "num_comments": 36,
    "author": "jackmolay",
    "id": "1hhq1q5",
    "created_datetime": "2024-12-19 10:29:51"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "The UK’s Puberty Blocker Ban is State-Sanctioned Child Abuse",
    "upvote_ratio": 0.98,
    "ups": 404,
    "created": 1734251592.0,
    "created_utc": 1734251592.0,
    "num_comments": 12,
    "author": "jackmolay",
    "id": "1heoeoj",
    "created_datetime": "2024-12-15 08:33:12"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Trans activists hold dance party in a Capitol women’s restroom in protest of bathroom ban",
    "upvote_ratio": 0.99,
    "ups": 397,
    "created": 1733755405.0,
    "created_utc": 1733755405.0,
    "num_comments": 21,
    "author": "OverallEcho9694",
    "id": "1hab8ok",
    "created_datetime": "2024-12-09 14:43:25"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Transgender woman wins court case for transfer to female prison",
    "upvote_ratio": 0.98,
    "ups": 389,
    "created": 1734853006.0,
    "created_utc": 1734853006.0,
    "num_comments": 14,
    "author": "jackmolay",
    "id": "1hjtulq",
    "created_datetime": "2024-12-22 07:36:46"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Hate crimes against transgender people are up 125% in LA",
    "upvote_ratio": 0.99,
    "ups": 394,
    "created": 1734169457.0,
    "created_utc": 1734169457.0,
    "num_comments": 15,
    "author": "jackmolay",
    "id": "1hdzmim",
    "created_datetime": "2024-12-14 09:44:17"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Transgender men and women are increasingly having crucial hormone treatment withdrawn by NHS doctors, an investigation has found.\n\n“Trans patients and staff at NHS gender services have said that cases of people being refused hormone replacement therapy (HRT) or having the medication withdrawn are on the rise.”\n\n“Sources within gender services and primary care point to lack of funding, uncertainty from GPs about whether they can prescribe the treatment, and the Cass Review as factors in the trend. One GP said that, even though the Cass Review looked at children’s care, the recommendations about exercising caution in providing hormones have had a knock-on impact on adult services, with practitioners ‘genuinely scared’ about doing something wrong.”\n\n\n\n",
    "author_fullname": "t2_supmldzm",
    "title": "UK GPs halting transgender patients’ hormone treatment or refusing prescriptions, investigation reveals",
    "upvote_ratio": 0.99,
    "ups": 386,
    "created": 1733613925.0,
    "created_utc": 1733613925.0,
    "num_comments": 37,
    "author": "onnake",
    "id": "1h955zi",
    "created_datetime": "2024-12-07 23:25:25"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_6ypir",
    "title": "Senate Democrats Are About To Vote Into Law the First Anti-LGBTQ National Legislation in Decades. Contact Your Senator Now.",
    "upvote_ratio": 0.98,
    "ups": 385,
    "created": 1734139734.0,
    "created_utc": 1734139734.0,
    "num_comments": 19,
    "author": "TheLiberalLover",
    "id": "1hdrs6y",
    "created_datetime": "2024-12-14 01:28:54"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_6ypir",
    "title": "The GOP's Transphobia Is As Much of A \"Distraction\" As Hitler's Anti-Semitism Was. Will Democrats Learn From History?",
    "upvote_ratio": 0.99,
    "ups": 374,
    "created": 1733968260.0,
    "created_utc": 1733968260.0,
    "num_comments": 29,
    "author": "TheLiberalLover",
    "id": "1hca7xz",
    "created_datetime": "2024-12-12 01:51:00"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Judge forces Montana to let trans people correct their drivers licenses & birth certificates",
    "upvote_ratio": 0.99,
    "ups": 380,
    "created": 1734603916.0,
    "created_utc": 1734603916.0,
    "num_comments": 6,
    "author": "jackmolay",
    "id": "1hhpzht",
    "created_datetime": "2024-12-19 10:25:16"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Maxim Magnus: ‘We Are Creating A Generation Of Trans People That Is Going To Be Traumatised’",
    "upvote_ratio": 0.99,
    "ups": 368,
    "created": 1734769379.0,
    "created_utc": 1734769379.0,
    "num_comments": 39,
    "author": "jackmolay",
    "id": "1hj5l00",
    "created_datetime": "2024-12-21 08:22:59"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_fm74r",
    "title": "Nancy Mace Calls Police on Foster Youth Advocate who Supports Trans Rights",
    "upvote_ratio": 0.96,
    "ups": 365,
    "created": 1733897519.0,
    "created_utc": 1733897519.0,
    "num_comments": 63,
    "author": "amadeoamante",
    "id": "1hbn5q7",
    "created_datetime": "2024-12-11 06:11:59"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Biden signs defense bill despite objections to ban transgender healthcare to military children",
    "upvote_ratio": 0.99,
    "ups": 365,
    "created": 1735025442.0,
    "created_utc": 1735025442.0,
    "num_comments": 162,
    "author": "OverallEcho9694",
    "id": "1hl8imi",
    "created_datetime": "2024-12-24 07:30:42"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "120 Anti-Trans Bills Filed Across The United States Before 2025 Has Even Started",
    "upvote_ratio": 0.98,
    "ups": 370,
    "created": 1734791158.0,
    "created_utc": 1734791158.0,
    "num_comments": 32,
    "author": "ErinInTheMorning",
    "id": "1hjav52",
    "created_datetime": "2024-12-21 14:25:58"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Restrictions on gender-affirming care proposed by Republicans in Congress and President-elect Donald Trump could be devastating for transgender youths, doctors say, especially for teens with eating disorders.\n\n“Gender-affirming care — which includes mental health counseling and sometimes puberty-suppressing medication and hormone therapy — is a critical part of care for trans teens with eating disorders, said Jessie Menzel, a psychologist and vice president of development at Equip Health, which provides virtual mental health care for people with eating disorders.\n\n“Eating disorders are pervasive among young people who identify as trans. Many starve themselves or develop other harmful eating behaviors to make their bodies conform to a masculine or feminine ideal. Studies estimate that 25% to more than 50% of trans people have had eating disorders, compared with 9% of the overall population.\n\n“Yet transition-related care is increasingly out of reach for minors struggling with gender dysphoria, the acute distress that results from a mismatch between one’s sex assigned at birth and one’s gender identity. Most U.S. medical associations consider transition-related care to be essential for minors struggling with gender dysphoria.”\n",
    "author_fullname": "t2_supmldzm",
    "title": "Bans on transgender care for minors may complicate eating disorder treatment",
    "upvote_ratio": 0.98,
    "ups": 352,
    "created": 1734799404.0,
    "created_utc": 1734799404.0,
    "num_comments": 17,
    "author": "onnake",
    "id": "1hjdm3r",
    "created_datetime": "2024-12-21 16:43:24"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "Transgender Assault Case Leads to Dismissal of Eight Deputies",
    "upvote_ratio": 0.98,
    "ups": 349,
    "created": 1735212173.0,
    "created_utc": 1735212173.0,
    "num_comments": 15,
    "author": "ohbricki",
    "id": "1hmmggb",
    "created_datetime": "2024-12-26 11:22:53"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Kris Campbell’s (no relation) op-ed about building bridges and de-escalation is full of very moral and good ideas.\n\n“Kris’s argument is one with which I largely agree — in theory. It would be nice if everyone could calm down a little and meet each other halfway. De-escalation is ideal. And, to be clear, what follows is not a condemnation, simply a difference of opinion.\n\n“The rhetoric against transgender people like Kris and me has reached a point that renders de-escalation moot.”\n",
    "author_fullname": "t2_supmldzm",
    "title": "There is no bridge building with those who don’t think you have a right to exist",
    "upvote_ratio": 0.99,
    "ups": 346,
    "created": 1734209858.0,
    "created_utc": 1734209858.0,
    "num_comments": 6,
    "author": "onnake",
    "id": "1hecbn0",
    "created_datetime": "2024-12-14 20:57:38"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_ulg9u",
    "title": "A Washington city council cuts a pizza program for LGBTQ+ youth after concerns about turning kids transgender. The Ellensburg community raised more funds than the city had previously allocated to rescue the program that provided pizza and a safe space for LGBTQ+ teens.\n",
    "upvote_ratio": 0.99,
    "ups": 340,
    "created": 1733871603.0,
    "created_utc": 1733871603.0,
    "num_comments": 37,
    "author": "southpawFA",
    "id": "1hbewlo",
    "created_datetime": "2024-12-10 23:00:03"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_tfr21moo",
    "title": " Emma Dumont who portrayed J. Robert Oppenheimer's sister-in-law in 'Oppenheimer' announced via social media they are now transmasculine and non-binary ",
    "upvote_ratio": 0.97,
    "ups": 336,
    "created": 1733563034.0,
    "created_utc": 1733563034.0,
    "num_comments": 5,
    "author": "S4v1r1enCh0r4k",
    "id": "1h8ot8k",
    "created_datetime": "2024-12-07 09:17:14"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "UK’s largest doctors’ union condemns Cass Review’s attacks on gender-affirming care",
    "upvote_ratio": 0.99,
    "ups": 331,
    "created": 1735552525.0,
    "created_utc": 1735552525.0,
    "num_comments": 8,
    "author": "jackmolay",
    "id": "1hpjyg3",
    "created_datetime": "2024-12-30 09:55:25"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "   ‘LGB Without the T’? Backlash Builds Over LGBT Center Rebrand",
    "upvote_ratio": 0.98,
    "ups": 329,
    "created": 1735114285.0,
    "created_utc": 1735114285.0,
    "num_comments": 33,
    "author": "jackmolay",
    "id": "1hlwo32",
    "created_datetime": "2024-12-25 08:11:25"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Former Mermaids chief Susie Green vows to defy puberty blocker ban at Anne Trans Healthcare clinic",
    "upvote_ratio": 0.99,
    "ups": 331,
    "created": 1734769519.0,
    "created_utc": 1734769519.0,
    "num_comments": 11,
    "author": "jackmolay",
    "id": "1hj5m2h",
    "created_datetime": "2024-12-21 08:25:19"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Stephen Fry called a 'disappointment' for saying he no longer supports Stonewall",
    "upvote_ratio": 0.97,
    "ups": 324,
    "created": 1734768432.0,
    "created_utc": 1734768432.0,
    "num_comments": 45,
    "author": "jackmolay",
    "id": "1hj5dph",
    "created_datetime": "2024-12-21 08:07:12"
  },
  {
    "subreddit": "transgender",
    "selftext": "“In the marble halls of the battle dome of American lawfare on December 4, Tennessee’s deputy solicitor general performed a brazen act of legal gymnastics: He argued to the Supreme Court that protecting transgender children requires denying them health care. That same day, UnitedHealthcare CEO Brian Thompson—architect of an AI-powered claims denial system with a reported 90 percent error rate—was shot, allegedly by a man driven to desperation by America’s predatory and labyrinthine health care system, which causes as many as 66.5 percent of American bankruptcies.\n\n“The grim symmetry was impossible to ignore. The parallel path of these two events perfectly encapsulates the cynical sleight of hand at the heart of the American establishment’s current political strategy. While millions struggle under the weight of medical debt and economic precarity, our political class has masterfully redirected public anger toward a manufactured crisis: the supposed threat of transgender Americans. By scapegoating trans people, they divert attention from the systemic failures killing and impoverishing our neighbors. This phenomenon is what sociologists call displacement, where economic anger and despair are redirected onto marginalized groups rather than the systems and structures that are actually causing the suffering. While the threats to trans people are real and growing, the threat of trans people is a nonexistent distraction, and attacking us will do nothing to address Americans’ real material concerns.”",
    "author_fullname": "t2_supmldzm",
    "title": "America’s Anti-Trans Panic Is a Scam",
    "upvote_ratio": 0.98,
    "ups": 319,
    "created": 1734540309.0,
    "created_utc": 1734540309.0,
    "num_comments": 8,
    "author": "onnake",
    "id": "1hh5ptq",
    "created_datetime": "2024-12-18 16:45:09"
  },
  {
    "subreddit": "transgender",
    "selftext": "“[I]n the face of escalating anti-trans rhetoric and legislation on Capitol Hill, Democrats have remained eerily silent.\n\n“That is why, in a commitment to affirm the basic human dignity and respect all people deserve, I helped lead a group of trans women, non-binary people, and cis allies in holding a sit-in in a women’s bathroom in Congress. \n\n“Holding a banner that read ‘Flush Bathroom Bigotry’, we openly disobeyed House policy and defied Mace and House speaker Mike Johnson’s hate.\n\n“We are inspired by the long and proud tradition of everyday people coming together to confront injustice – people willing to take a risk to uphold a vision for the future we deserve, from the 1960 sit-in at a Woolworth lunch counter in Greensboro, North Carolina, that helped to catalyze the Black Freedom Movement, to the 1966 sip-in at Julius’ Bar in New York City that helped to ignite the movement for queer liberation.”\n\n“Mace followed along to the US Capitol police headquarters. With a megaphone magnifying her hate, she hurled anti-trans slurs at us while we sat locked in our cells. So far, only a single member of Congress, the representative Maxwell Frost, has condemned her abhorrent hate speech.”",
    "author_fullname": "t2_supmldzm",
    "title": "Why aren’t more politicians condemning Nancy Mace’s vicious anti-trans stunts?",
    "upvote_ratio": 0.99,
    "ups": 324,
    "created": 1734448867.0,
    "created_utc": 1734448867.0,
    "num_comments": 50,
    "author": "onnake",
    "id": "1hgcwsz",
    "created_datetime": "2024-12-17 15:21:07"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Texas City Council that targeted LGBTQ+ people gets voted out — and replaced with first gay member",
    "upvote_ratio": 0.99,
    "ups": 321,
    "created": 1734168718.0,
    "created_utc": 1734168718.0,
    "num_comments": 5,
    "author": "jackmolay",
    "id": "1hdzh2j",
    "created_datetime": "2024-12-14 09:31:58"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "N/A",
    "title": "trump transgender lunacy: Trump declares open war on 'transgender lunacy', says 'there are only two genders'. What has he vowed to do? - The Economic Times",
    "upvote_ratio": 0.86,
    "ups": 314,
    "created": 1734959154.0,
    "created_utc": 1734959154.0,
    "num_comments": 76,
    "author": "N/A",
    "id": "1hkncmo",
    "created_datetime": "2024-12-23 13:05:54"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_9ej7q",
    "title": "Cass vs France • The French Society of Pediatric Endocrinology and Diabetology commissioned its own version of the Cass Review, unsurprisingly it almost completely contradicts Cass.",
    "upvote_ratio": 0.99,
    "ups": 313,
    "created": 1735097230.0,
    "created_utc": 1735097230.0,
    "num_comments": 12,
    "author": "LocutusOfBorges",
    "id": "1hlsszr",
    "created_datetime": "2024-12-25 03:27:10"
  },
  {
    "subreddit": "transgender",
    "selftext": "Hospitals in Sarasota County Florida are asking for gender assigned at birth on intake forms. Another ploy by the DeFascist administration to put trans people on a registry in order to limit and take away their healthcare. \n\nIs this happening in other Florida counties? ",
    "author_fullname": "t2_js39v748a",
    "title": "Florida hospitals asking gender assigned at birth during intake. ",
    "upvote_ratio": 0.96,
    "ups": 310,
    "created": 1734274530.0,
    "created_utc": 1734274530.0,
    "num_comments": 44,
    "author": "jessicats9",
    "id": "1heu6sp",
    "created_datetime": "2024-12-15 14:55:30"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "Shifting Sands of Care: The Global Retreat on Transgender HRT",
    "upvote_ratio": 0.99,
    "ups": 308,
    "created": 1733659172.0,
    "created_utc": 1733659172.0,
    "num_comments": 36,
    "author": "ohbricki",
    "id": "1h9hdhk",
    "created_datetime": "2024-12-08 11:59:32"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Protests outside of Supreme Court capture growing fears for transgender Americans",
    "upvote_ratio": 0.99,
    "ups": 305,
    "created": 1733478630.0,
    "created_utc": 1733478630.0,
    "num_comments": 18,
    "author": "jackmolay",
    "id": "1h7xx2m",
    "created_datetime": "2024-12-06 09:50:30"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://www.change.org/p/reinstate-the-transgender-storyline-in-pixar-s-win-or-lose",
    "author_fullname": "t2_yxx3s",
    "title": "Petition to Reinstate the Transgender Storyline in Pixar's 'Win or Lose\"",
    "upvote_ratio": 0.96,
    "ups": 303,
    "created": 1734927942.0,
    "created_utc": 1734927942.0,
    "num_comments": 15,
    "author": "usrthea",
    "id": "1hkfzl3",
    "created_datetime": "2024-12-23 04:25:42"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "Biden Scraps Trans Athlete Protections to Block Trump Agenda",
    "upvote_ratio": 0.96,
    "ups": 285,
    "created": 1734875765.0,
    "created_utc": 1734875765.0,
    "num_comments": 53,
    "author": "ohbricki",
    "id": "1hjyy1z",
    "created_datetime": "2024-12-22 13:56:05"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_68inq",
    "title": "Transgender Americans rush to finalize name changes, healthcare proxies and estate planning before the inauguration",
    "upvote_ratio": 0.99,
    "ups": 277,
    "created": 1734614397.0,
    "created_utc": 1734614397.0,
    "num_comments": 49,
    "author": "Bidofthis",
    "id": "1hhsqbf",
    "created_datetime": "2024-12-19 13:19:57"
  },
  {
    "subreddit": "transgender",
    "selftext": "I was surprised at how many passed the house.",
    "author_fullname": "t2_86o3yhru",
    "title": "Senators plan to remove gender affirming care ban for minors from government spending bill.",
    "upvote_ratio": 0.98,
    "ups": 270,
    "created": 1734400285.0,
    "created_utc": 1734400285.0,
    "num_comments": 10,
    "author": "Independent_Visual99",
    "id": "1hfzsc6",
    "created_datetime": "2024-12-17 01:51:25"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Tia Kofi: 'We need to stand side-by-side with trans people more than ever'",
    "upvote_ratio": 1.0,
    "ups": 269,
    "created": 1734680610.0,
    "created_utc": 1734680610.0,
    "num_comments": 8,
    "author": "jackmolay",
    "id": "1hieu1j",
    "created_datetime": "2024-12-20 07:43:30"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "SCOTUS Refuses to Hear Challenge, WI Trans Policy Remains",
    "upvote_ratio": 0.98,
    "ups": 269,
    "created": 1733829019.0,
    "created_utc": 1733829019.0,
    "num_comments": 38,
    "author": "ohbricki",
    "id": "1hazfgo",
    "created_datetime": "2024-12-10 11:10:19"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "Post-Election 2024 Anti-Trans Risk Assessment Map",
    "upvote_ratio": 1.0,
    "ups": 266,
    "created": 1733934193.0,
    "created_utc": 1733934193.0,
    "num_comments": 46,
    "author": "ErinInTheMorning",
    "id": "1hbx93n",
    "created_datetime": "2024-12-11 16:23:13"
  },
  {
    "subreddit": "transgender",
    "selftext": "“After the presidential election, Nathaniel Gray saw an increase in worried callers phoning in to the Pride Center of the Capital Region, an advocacy group for the LGBTQ+ community in upstate New York”\n\n“And these calls to the upstate New York group aren’t just coming from locals — but from out of state, too.”\n\n“‘I’m seeing a huge increase in requests for changes in their hormone therapy,’ [upstate medical director for Planned Parenthood of Greater New York Corinne] McLeod said. ‘Or changes in the diagnosis code to obscure the fact that they’re trans so hopefully, to allow them to continue medication after Trump becomes president.’\n\n“Megan O’Meara, executive director of mental health provider Prism Counseling & Advocacy, said they’ve also seen an increase in requests for letters. \n\n“They said for some, the election was a catalyst for those who have been considering surgery to take the next step before a potential ban or restriction is put in place.”\n\n“Unlike other states, New York has certain laws and protections in place that advocates say will help protect access to transgender health care during the Trump administration. For example, the implementation of the New York Equal Rights Amendment into the state constitution, as well as state shield laws that protect those who practice gender-affirming care. \n\n“As a result, some, like Gray, expect to see an influx of LGBTQ+ people move to upstate New York.\n\n‘He said he’s received calls and emails from those in other states, such as Oklahoma or South Dakota, where anti-transgender and anti-LGBTQ+ laws have passed in recent years. Many call with hopes that moving to New York will provide protection for them.”",
    "author_fullname": "t2_supmldzm",
    "title": "New York State advocates, health providers brace for changes to transgender health care under Trump",
    "upvote_ratio": 0.99,
    "ups": 264,
    "created": 1735312557.0,
    "created_utc": 1735312557.0,
    "num_comments": 35,
    "author": "onnake",
    "id": "1hngzrj",
    "created_datetime": "2024-12-27 15:15:57"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_4au6kbff",
    "title": "With the Senate's vote for an anti-trans military bill, Joe Biden has to make a choice",
    "upvote_ratio": 1.0,
    "ups": 265,
    "created": 1734640996.0,
    "created_utc": 1734640996.0,
    "num_comments": 58,
    "author": "felis__cactus",
    "id": "1hi2kyi",
    "created_datetime": "2024-12-19 20:43:16"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "House Democrats who voted yes on NDAA lament transgender restrictions",
    "upvote_ratio": 0.95,
    "ups": 260,
    "created": 1734169394.0,
    "created_utc": 1734169394.0,
    "num_comments": 32,
    "author": "jackmolay",
    "id": "1hdzm0z",
    "created_datetime": "2024-12-14 09:43:14"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_t859s7gn",
    "title": "DEMOCRAT Kentucky Governor Andy Beshear says he \"does not support gender reassignment surgery for inmates\". ",
    "upvote_ratio": 0.96,
    "ups": 264,
    "created": 1734058922.0,
    "created_utc": 1734058922.0,
    "num_comments": 64,
    "author": "NorCalFrances",
    "id": "1hd2sjl",
    "created_datetime": "2024-12-13 03:02:02"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Senate votes 85-14 to pass National Defense Authorization Act, which has [a] provision preventing gender-affirming care to transgender children of military members.”",
    "author_fullname": "t2_supmldzm",
    "title": "Senate passes $895bn Pentagon spending bill despite provision denying transgender care to minors",
    "upvote_ratio": 0.99,
    "ups": 262,
    "created": 1734553678.0,
    "created_utc": 1734553678.0,
    "num_comments": 102,
    "author": "onnake",
    "id": "1hhawc5",
    "created_datetime": "2024-12-18 20:27:58"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Los Angeles County saw the highest number of hate crimes in 2023 since the county began tracking hate crime data in 1980 with a spike in discrimination and violence against transgender and Jewish people, according to a new report. \n\n“The Los Angeles County Commission on Human Relations said in its annual report that there were 1,350 hate crimes reported to law enforcement agencies across the county, a 45% increase from 2022.”\n\n“The transgender community appears to have experienced most hate crimes with 99 reports, an 125% surge from the year before. \n\n“Most of the anti-transgender crimes were violent, including assaults, intimidation and robbery, according to the report. \n\n“Some 75% of the anti-transgender hate crimes targeted transgender women with the overwhelming majority of the suspects being male.”",
    "author_fullname": "t2_supmldzm",
    "title": "Hate crimes spike in Los Angeles County with more attacks on Jewish and transgender people",
    "upvote_ratio": 0.99,
    "ups": 260,
    "created": 1733959610.0,
    "created_utc": 1733959610.0,
    "num_comments": 39,
    "author": "onnake",
    "id": "1hc7am8",
    "created_datetime": "2024-12-11 23:26:50"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_t859s7gn",
    "title": "45 Democratic senators to Appropriations Chairs: “partisan, discriminatory, and harmful policy riders have no place in must-pass legislation such as appropriations bills.” ",
    "upvote_ratio": 0.98,
    "ups": 251,
    "created": 1734039452.0,
    "created_utc": 1734039452.0,
    "num_comments": 21,
    "author": "NorCalFrances",
    "id": "1hcw4eh",
    "created_datetime": "2024-12-12 21:37:32"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_8i6jpd",
    "title": "President Biden Signs Defense Bill Blocking Health Care For Trans Military Children, First Anti-LGBTQ+ Federal Law Enacted Since ‘Defense of Marriage Act’",
    "upvote_ratio": 0.97,
    "ups": 248,
    "created": 1735115909.0,
    "created_utc": 1735115909.0,
    "num_comments": 79,
    "author": "needhelpwithmath11",
    "id": "1hlwzwm",
    "created_datetime": "2024-12-25 08:38:29"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "What will it take for you to care about transgender people? – Baptist News Global",
    "upvote_ratio": 0.99,
    "ups": 251,
    "created": 1735290112.0,
    "created_utc": 1735290112.0,
    "num_comments": 19,
    "author": "jackmolay",
    "id": "1hnaytj",
    "created_datetime": "2024-12-27 09:01:52"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "all of the available data we have suggests that this election was mostly about inflation and incumbency—not trans rights…",
    "upvote_ratio": 0.96,
    "ups": 248,
    "created": 1735025928.0,
    "created_utc": 1735025928.0,
    "num_comments": 24,
    "author": "jackmolay",
    "id": "1hl8moa",
    "created_datetime": "2024-12-24 07:38:48"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Hate crime numbers fall but rise in violence against trans people",
    "upvote_ratio": 0.98,
    "ups": 240,
    "created": 1735552950.0,
    "created_utc": 1735552950.0,
    "num_comments": 8,
    "author": "jackmolay",
    "id": "1hpk27e",
    "created_datetime": "2024-12-30 10:02:30"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "Disney Strips Trans Identity from Pixar’s ‘Win or Lose’ Episodes",
    "upvote_ratio": 0.96,
    "ups": 239,
    "created": 1734519820.0,
    "created_utc": 1734519820.0,
    "num_comments": 21,
    "author": "ohbricki",
    "id": "1hgz9gj",
    "created_datetime": "2024-12-18 11:03:40"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "Justice Sought for Cameron Thompson, a Black Trans Teen Killed",
    "upvote_ratio": 0.99,
    "ups": 230,
    "created": 1734952072.0,
    "created_utc": 1734952072.0,
    "num_comments": 1,
    "author": "ohbricki",
    "id": "1hkljc7",
    "created_datetime": "2024-12-23 11:07:52"
  },
  {
    "subreddit": "transgender",
    "selftext": "“[E]ven before she is sworn in on Friday, her reception from congressional Republicans has been tumultuous. Rep. Nancy Mace of South Carolina targeted her by proposing to ban transgender people from U.S. Capitol restrooms that correspond to their gender identity — a ban that House Speaker Mike Johnson, R-La., enacted.\n\n“For her part, McBride tried to defuse the situation, saying she would follow the rules. ‘I’m not here to fight about bathrooms,’ the 34-year-old wrote in a statement.\n\n“While some activists want her to fight harder, to those who know her, the move was classic Sarah — a pragmatist with a reputation of bipartisanship, a person who values diplomacy over pugilism.\n\n“‘There is so much joy and so much awe in having this opportunity, and I will not let anyone take that away from me,’ McBride told The Associated Press. ‘I am simply there to do the job just like anyone else.’\n\n“Her political home of the last four years, the Delaware Senate, is small — just 21 members — much like the state itself, not even 100 miles (155 kilometers) from north to south. That proximity creates the kind of collegiality that, while not constant, is often lacking these days in Washington.”\n",
    "author_fullname": "t2_supmldzm",
    "title": "Transgender trailblazer Sarah McBride heads to her debut in Congress, hoping for a touch of grace",
    "upvote_ratio": 0.95,
    "ups": 234,
    "created": 1735655810.0,
    "created_utc": 1735655810.0,
    "num_comments": 37,
    "author": "onnake",
    "id": "1hqfxha",
    "created_datetime": "2024-12-31 14:36:50"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Montana Court Blocks State From Refusing to Correct Sex Markers on Transgender People's Birth Certificates and Driver's Licenses | American Civil Liberties Union",
    "upvote_ratio": 0.99,
    "ups": 228,
    "created": 1734449928.0,
    "created_utc": 1734449928.0,
    "num_comments": 16,
    "author": "OverallEcho9694",
    "id": "1hgdaoq",
    "created_datetime": "2024-12-17 15:38:48"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "Trump Picks Chloe Cole's Anti-Trans Lawyer Harmeet Dhillon To Lead DOJ Civil Rights Post",
    "upvote_ratio": 0.98,
    "ups": 228,
    "created": 1733846703.0,
    "created_utc": 1733846703.0,
    "num_comments": 24,
    "author": "ErinInTheMorning",
    "id": "1hb54z4",
    "created_datetime": "2024-12-10 16:05:03"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "Study Finds Physical Activity Gap in Transgender Adolescents",
    "upvote_ratio": 0.98,
    "ups": 229,
    "created": 1733483988.0,
    "created_utc": 1733483988.0,
    "num_comments": 26,
    "author": "ohbricki",
    "id": "1h7z65t",
    "created_datetime": "2024-12-06 11:19:48"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "She Sued Over Transgender ‘Conversion Therapy,’ a First for China",
    "upvote_ratio": 0.98,
    "ups": 225,
    "created": 1733644232.0,
    "created_utc": 1733644232.0,
    "num_comments": 5,
    "author": "jackmolay",
    "id": "1h9dwzw",
    "created_datetime": "2024-12-08 07:50:32"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Cases implicating transgender rights are piling up at the Supreme Court as it begins drafting its opinion on whether states can ban gender-affirming care for minors. \n\n“The justices at their recent closed-door conferences have considered petitions to take up disputes involving what school sports teams transgender athletes can play on, parental rights and whether government-funded health care plans must cover transgender care.”\n\n“[T]he court appears to have concluded there is enough of an overlap that most of the petitions should be punted until the current dispute is resolved, which concerns whether Tennessee’s ban on gender-affirming care for minors amounts to unconstitutional sex discrimination. The decision, which is expected by summer, stands to impact similar laws passed in half the country. \n\n“Last month, the justices at two consecutive conferences mulled whether to take up appeals from Idaho and West Virginia defending their bans on transgender girls competing on women’s school sports teams. \n\n“The justices took no action and did not relist the petitions for discussion at any of their December conferences, court dockets show, effectively placing the cases in indefinite limbo. Though the court provided no explanation, that pattern typically occurs when the justices have decided to hold a petition pending the disposition of a current case.\n\n“The American Civil Liberties Union (ACLU) did not object to the move.”\n\n“Both West Virginia and Idaho unsuccessfully cautioned the Supreme Court against waiting.”\n\n",
    "author_fullname": "t2_supmldzm",
    "title": "More battles over transgender rights await Supreme Court  ",
    "upvote_ratio": 0.99,
    "ups": 226,
    "created": 1735424297.0,
    "created_utc": 1735424297.0,
    "num_comments": 17,
    "author": "onnake",
    "id": "1hogv29",
    "created_datetime": "2024-12-28 22:18:17"
  },
  {
    "subreddit": "transgender",
    "selftext": "Fuck. This. Shit. How dare they.",
    "author_fullname": "t2_145hjveotc",
    "title": "House passes massive defense bill with ban on gender-affirming care for transgender kids",
    "upvote_ratio": 0.98,
    "ups": 220,
    "created": 1733963486.0,
    "created_utc": 1733963486.0,
    "num_comments": 50,
    "author": "Professor603",
    "id": "1hc8mie",
    "created_datetime": "2024-12-12 00:31:26"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Earlier this month, the Supreme Court heard oral arguments in what is likely to be the term’s blockbuster case, United States v. Skrmetti. The case considers the constitutionality of state laws that ban gender-affirming care for transgender minors. While the case itself addresses only a law from Tennessee, 26 states have passed similar laws that will be affected by the outcome.\n\n“A blanket ban on such care risks devastating effects for those youth who need it. But as the argument made clear, that is not all that is at stake. The case is also about women’s rights, and a fundamental legal principle that helped to secure them: Courts should be skeptical of laws that discriminate on the basis of sex.\n\n“With the defenders of Tennessee’s law challenging that bedrock principle, it is not only transgender equality, but sex equality more broadly that is in doubt. Depending on the outcome, Skrmetti could be the next Dobbs, adding another nail in the coffin to women’s legal freedoms — and freedoms we all enjoy regardless of sex.”\n\n“The Tennessee law — and trans discrimination more generally — is not only about discrimination against trans people, but about ensuring that we all keep in our gender lanes. As [U.S. Solicitor General Elizabeth] Prelogar explained, the law here is ‘one that prohibits inconsistency with sex,’ requiring that children born as boys and girls ‘look and live like boys and girls.’ Tennessee’s argument would call into question the longstanding freedom we all enjoy to live our lives as we wish, regardless of sex.\n\n“Far from being a neutral law that applies evenhandedly to males and females, the law at issue here is of a piece with a gender hierarchy that prizes masculinity while narrowly circumscribing femininity. \n\n“Medical treatments that would reduce the fertility of trans boys and men threaten the idea of women being mothers first (and anything else second or not at all). A friend-of-the-court brief from leading conservative anti-abortion group, Alliance Defending Freedom, worried that, ‘If both a boy and a girl are considering a mastectomy, only the girl gives up the ability to breastfeed her future child.’  Scare tactics about girls renouncing maternity are part of anti-trans politics, with the cover of conservative critic Abigail Shrier’s book, Irreversible Damage: The Transgender Craze Seducing Our Daughters, showing a young girl with a blank space where her uterus would be. \n\n“These anxieties about women rejecting motherhood are the very same ones that motivate much of the opposition to abortion — and they are grounded upon the very same sex stereotypes that the equal protection clause is meant to abolish.”",
    "author_fullname": "t2_supmldzm",
    "title": "Opinion | The Supreme Court Case Over Trans Youth Could Also Decimate Women’s Equality",
    "upvote_ratio": 0.98,
    "ups": 216,
    "created": 1735056891.0,
    "created_utc": 1735056891.0,
    "num_comments": 22,
    "author": "onnake",
    "id": "1hlgqqf",
    "created_datetime": "2024-12-24 16:14:51"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3inz2u4b",
    "title": "Opinion: Washington Post Editorial Board Misleadingly Attacks Care Of Trans Youth",
    "upvote_ratio": 0.98,
    "ups": 221,
    "created": 1734390397.0,
    "created_utc": 1734390397.0,
    "num_comments": 14,
    "author": "ErinInTheMorning",
    "id": "1hfwcrn",
    "created_datetime": "2024-12-16 23:06:37"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "J.K. Rowling’s ‘No Trans Kids’ Claim and the 2024 Backlash",
    "upvote_ratio": 0.97,
    "ups": 213,
    "created": 1735643085.0,
    "created_utc": 1735643085.0,
    "num_comments": 33,
    "author": "ohbricki",
    "id": "1hqcj6h",
    "created_datetime": "2024-12-31 11:04:45"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://archive.is/TLtmJ\n\n“For state lawmakers who want to keep health care decisions about young transgender people’s care between them, their parents, and their doctors — and out of the hands of judges — the best time to act was yesterday. Next best time: right now.\n\n“If that wasn’t already apparent, Wednesday’s Supreme Court arguments in a challenge to Tennessee’s ban on gender-affirming care for transgender minors makes it crystal clear.”\n\n“[O]nly 14 states (Massachusetts included) and the District of Columbia have laws in place shielding the ability of doctors, their patients, and patients’ families to act according to their needs, wishes, and the proper standard of medical care, according to the nonprofit Movement Advancement Project. Two more states have executive orders currently in place protecting access to transgender health care.\n\n“Astonishingly, according to MAP, 34 states have passed no transgender health care protection rules at all.\n\n“They have not learned one of the most crucial lessons from the Dobbs ruling that overturned Roe v. Wade: Beware the unintended yet foreseeable consequences.”\n\n“It was not just abortion access protections that were stripped from people in states that banned it after Dobbs. The health care implications were much wider, with some providers in states with laws defining life at fertilization choosing to halt in-vitro fertilization procedures for fear of liability. There is confusion about the legal status of frozen eggs and embryos. The incoming Trump administration creates uncertainty over the ongoing availability of not only medications for abortions but also that of some contraceptives. Maternity health care providers are fleeing states with abortion bans.”",
    "author_fullname": "t2_supmldzm",
    "title": "More states must pass shield laws protecting gender-affirming care",
    "upvote_ratio": 0.98,
    "ups": 214,
    "created": 1733614362.0,
    "created_utc": 1733614362.0,
    "num_comments": 10,
    "author": "onnake",
    "id": "1h95bem",
    "created_datetime": "2024-12-07 23:32:42"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_9ej7q",
    "title": "BBC quote the conversion therapy activist organisation Bayswater Support Group as a credible source",
    "upvote_ratio": 0.99,
    "ups": 214,
    "created": 1733948620.0,
    "created_utc": 1733948620.0,
    "num_comments": 11,
    "author": "LocutusOfBorges",
    "id": "1hc32kc",
    "created_datetime": "2024-12-11 20:23:40"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Following the presidential election, trans and queer people from across the country are looking to Minnesota for safety.\n\n“Minnesota’s LGBTQ+ protections, both in the Minnesota Human Rights Act and ‘trans refuge’ legislation, will remain in place regardless of what happens at a federal level, said Kat Rohn, executive director of OutFront Minnesota, an LGBTQ+ advocacy organization.”\n\n“Anti-LGBTQ+ legislation in 26 states has pushed several hundred households to relocate to Minnesota since becoming a ‘trans refuge’ state last year, Rohn said. Legislation passed last year protects the privacy of patients accessing gender-affirming care and shields medical providers from out-of-state subpoenas.”\n\n“Minnesota’s relatively strong job market and economy are a draw for those seeking access to care, and the high cost of living for ‘shield states’ on the east or west coasts deters people from states with lower median incomes, Rohn said.”\n\n“Housing is a considerable obstacle for many transplants — the housing crisis in the Twin Cities affects everybody, but the absence of a dedicated LGBTQ+ shelter is a risk for anyone relocating without guaranteed access to housing, Charley [who requested his last name not be used] said.“\n\n“‘And you can’t sleep in your car,’ Charley said. ‘I talked to a transplant last year who was talking about doing anything to get out of Texas and mentioned in February living in a car.’”",
    "author_fullname": "t2_supmldzm",
    "title": "Trump reelection spurs relocation concerns for Minn. transgender transplants",
    "upvote_ratio": 0.98,
    "ups": 210,
    "created": 1734031260.0,
    "created_utc": 1734031260.0,
    "num_comments": 19,
    "author": "onnake",
    "id": "1hcsxzo",
    "created_datetime": "2024-12-12 19:21:00"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_hc0ws",
    "title": "Will Democrats Let Republicans Gut Trans Health Care Under Trump? | Jael Holzman in Rolling Stone",
    "upvote_ratio": 0.96,
    "ups": 207,
    "created": 1733848360.0,
    "created_utc": 1733848360.0,
    "num_comments": 47,
    "author": "completely-ineffable",
    "id": "1hb5ry3",
    "created_datetime": "2024-12-10 16:32:40"
  },
  {
    "subreddit": "transgender",
    "selftext": "“With President-elect Donald Trump poised to return to the White House, gender-affirming health care providers in states across the country are bracing for impact.\n\n“‘We're very well aware of the incoming Congress and Administration's hostile views of LGBTQ+ communities, and specifically about gender-affirming care and our trans and non-binary communities,’ says Wendy Stark, president and CEO of Planned Parenthood Greater New York. ‘And so we unfortunately are aware that attacks on transgender and non-binary people, their lives, their health care, their access to basic things like bathrooms will likely continue.’\n\n“Here are the key ways gender-affirming health care providers are preparing for Trump’s second presidency.”",
    "author_fullname": "t2_supmldzm",
    "title": "How Gender-Affirming Health Care Providers Are Preparing for Trump’s Presidency",
    "upvote_ratio": 0.99,
    "ups": 207,
    "created": 1734359307.0,
    "created_utc": 1734359307.0,
    "num_comments": 9,
    "author": "onnake",
    "id": "1hfkajt",
    "created_datetime": "2024-12-16 14:28:27"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "'Oppenheimer's Nick Dumont embraces transmasc nonbinary identity",
    "upvote_ratio": 0.99,
    "ups": 210,
    "created": 1733519260.0,
    "created_utc": 1733519260.0,
    "num_comments": 2,
    "author": "OverallEcho9694",
    "id": "1h8bs2o",
    "created_datetime": "2024-12-06 21:07:40"
  },
  {
    "subreddit": "transgender",
    "selftext": "“The top Democrat on the House Armed Services Committee said Saturday he’s still undecided on how he’ll vote on a Pentagon policy bill he helped negotiate after Republicans insisted on language aimed at medical treatments for transgender children.\n\n“The comments from Rep. Adam Smith (D-Wash.) could signal some Democrats will have difficulty supporting the must-pass bill when it hits the House floor in the coming days and complicate its passage as a year-end deadline to get it to President Joe Biden’s desk nears.”\n\n“The compromise version of the bill, unveiled on Saturday, includes a provision that would prohibit Tricare from covering gender dysphoria treatments ‘that could result in sterilization’ for children under 18.”",
    "author_fullname": "t2_supmldzm",
    "title": "Defense bill could hit last-minute snag over transgender provision",
    "upvote_ratio": 0.98,
    "ups": 203,
    "created": 1733673587.0,
    "created_utc": 1733673587.0,
    "num_comments": 70,
    "author": "onnake",
    "id": "1h9lvmm",
    "created_datetime": "2024-12-08 15:59:47"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Fleeing the country and rationing testosterone: Transgender Americans’ new reality under a Trump presidency",
    "upvote_ratio": 0.97,
    "ups": 204,
    "created": 1735024599.0,
    "created_utc": 1735024599.0,
    "num_comments": 36,
    "author": "jackmolay",
    "id": "1hl8bj7",
    "created_datetime": "2024-12-24 07:16:39"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_w9673yu5d",
    "title": "\"Emilia Perez\" sounds more like a trans wreck",
    "upvote_ratio": 0.97,
    "ups": 201,
    "created": 1734110890.0,
    "created_utc": 1734110890.0,
    "num_comments": 44,
    "author": "Kodeforbunnywudwuds",
    "id": "1hdhdyc",
    "created_datetime": "2024-12-13 17:28:10"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Atlanta police are investigating at least two known targeted attacks against members of the transgender community and believe there may be more victims connected to the suspect, Michael Boykin, who was arrested on Dec. 16.\n\n“According to incident reports released by the Atlanta Police Department (APD), two assaults were documented in recent months. The first occurred on Oct. 18 and the second on Nov. 12, both near a Chevron gas station in the 100 block of Ponce de Leon Drive in Northeast Atlanta. \n\n“In both cases, the victims — transgender women — sustained facial injuries after being punched. Officers found the victims with swollen faces and black eyes.\n\n“In the Nov. 12 assault, police responded to a report of a dispute near 160 Ponce de Leon Avenue NE. The victim reported being approached by two men near a gas station and followed to another location, where the suspects physically assaulted her. Officers noted that the victim’s eye was bruised and swollen. \n\n“Witnesses corroborated the account, and one of the suspects, Michael Boykin, fled the scene but was later linked to the incident.\nA security officer familiar with Boykin reported that he has a history of physically assaulting members of the transgender community in the area. Another suspect was arrested and charged with battery and criminal trespass for damaging a witness’s phone during the assault.”",
    "author_fullname": "t2_supmldzm",
    "title": "Atlanta police suspect more victims in assaults targeting transgender womenn",
    "upvote_ratio": 0.99,
    "ups": 201,
    "created": 1735055939.0,
    "created_utc": 1735055939.0,
    "num_comments": 44,
    "author": "onnake",
    "id": "1hlgez7",
    "created_datetime": "2024-12-24 15:58:59"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_3dfr109u",
    "title": "With Defense Legislation, Democrats Have Now Capitulated on Transgender Rights ",
    "upvote_ratio": 1.0,
    "ups": 198,
    "created": 1734629909.0,
    "created_utc": 1734629909.0,
    "num_comments": 35,
    "author": "DCGirl20874",
    "id": "1hhybz9",
    "created_datetime": "2024-12-19 17:38:29"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_igjus2v7",
    "title": "Ohio changes election forms to protect transgender political candidates",
    "upvote_ratio": 0.96,
    "ups": 195,
    "created": 1735677993.0,
    "created_utc": 1735677993.0,
    "num_comments": 9,
    "author": "OverallEcho9694",
    "id": "1hqnn65",
    "created_datetime": "2024-12-31 20:46:33"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "The wrong people listened to on puberty blockers ban",
    "upvote_ratio": 0.97,
    "ups": 199,
    "created": 1734436414.0,
    "created_utc": 1734436414.0,
    "num_comments": 6,
    "author": "jackmolay",
    "id": "1hg8zy4",
    "created_datetime": "2024-12-17 11:53:34"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "'The Greatest Achievement I’ve Earned In My Life Taken From Me” - Transgender Golfer Hailey Davidson Responds To LPGA Ban\n",
    "upvote_ratio": 0.98,
    "ups": 196,
    "created": 1733478406.0,
    "created_utc": 1733478406.0,
    "num_comments": 12,
    "author": "jackmolay",
    "id": "1h7xv8g",
    "created_datetime": "2024-12-06 09:46:46"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_ulg9u",
    "title": "The Hypocrisy of Republicans' Anti-Trans Agenda",
    "upvote_ratio": 0.99,
    "ups": 196,
    "created": 1735581936.0,
    "created_utc": 1735581936.0,
    "num_comments": 6,
    "author": "southpawFA",
    "id": "1hpt9r8",
    "created_datetime": "2024-12-30 18:05:36"
  },
  {
    "subreddit": "transgender",
    "selftext": "“Twenty-seven-year-old Virgil was living in Nashville when, a couple of years ago, the state Legislature proposed bills that ‘together make it very difficult to be trans in public,’ Virgil said. ‘That was kind of the turning point.’\n\n“Virgil and his partner borrowed and scraped together the money they needed for moving expenses, and they now live with five roommates in a house in Federal Way [Washington]. Virgil asked that KUOW not publish his last name because he’s worried about anti-trans backlash.\n\n“‘Safety, of course, was our first priority, but we also wanted to live somewhere that’s nice to live, and I’ve always just loved the Pacific Northwest,’ Virgil said.\n\n“But now, just two years after they arrived, Virgil and his partner aren’t sure they’ll be safe here anymore either, and they’re preparing to potentially leave the country.\n\n“Virgil is one of many transgender people who are worried about what President-elect Donald Trump’s incoming administration means for them.\n\n“Trump’s campaign promises include asking Congress to make gender-affirming care of children illegal, and ending all federal funding (such as through Medicare and Medicaid) for gender-affirming care for adults. He also promised to ask Congress to declare that there are only two genders — male and female — and they are assigned at birth, and to use Title IX to ensure that transgender women cannot compete on women’s sports teams.\n\n“As for same-sex marriage, some in the LGBTQ+ community are worried that, because that was a right granted by the Supreme Court, the current court, which has a conservative supermajority, could decide to rescind it. Justice Clarence Thomas wrote in his concurring opinion in the case that overturned Roe v. Wade that the justices should revisit same-sex marriage.\n\n“After the November election, Seattle’s LGBTQ+ Center filled with people looking for a place to process.”\n\n",
    "author_fullname": "t2_supmldzm",
    "title": "With Trump returning, some trans folks prepare to move to Washington state, or another country",
    "upvote_ratio": 0.99,
    "ups": 188,
    "created": 1735656272.0,
    "created_utc": 1735656272.0,
    "num_comments": 17,
    "author": "onnake",
    "id": "1hqg2yj",
    "created_datetime": "2024-12-31 14:44:32"
  },
  {
    "subreddit": "transgender",
    "selftext": "https://archive.is/rBbzR\n\n“A federal judge on Monday struck down key parts of an Arkansas law that threatened librarians and booksellers with imprisonment if they were found to have provided ‘harmful’ content to a minor.\n\n“U.S. District Judge Timothy Brooks ruled that two parts of Arkansas Act 372 — which Republican Arkansas Gov. Sarah Huckabee Sanders signed in 2023 — are overly broad and vague, and violated librarians’, booksellers’ and patrons’ First Amendment rights.\n\n“The two parts of the law that were struck down would have established a criminal misdemeanor, punishable by up to a year in prison, for librarians and booksellers who distribute ‘harmful’ material to a minor. It also would have required local governments to create oversight boards to review challenged content, which often deal with themes of race and sexuality. The ruling, which will likely be challenged, comes as a growing number of GOP-controlled statehouses have considered similar laws that threaten librarians with prison.”\n\n“Lawmakers that propose these bills contend they are necessary because school and public libraries contain graphic sexual material that should not be available to children. Arkansas state Sen. Dan Sullivan (R), who introduced Arkansas Act 372, said at the time that the law protects children and doesn’t harm librarians unless they’re doing something awful.”\n\n“But others say bills like Sullivan’s are ideologically driven censorship cloaked as concern for children, noting that as book challenges spiked to historic highs over the past two years, the majority of objections targeted books by and about LGBTQ people and people of color, including ‘All Boys Aren’t Blue’ by George M. Johnson and ‘Gender Queer’ by Maia Kobabe.”",
    "author_fullname": "t2_supmldzm",
    "title": "Judge rules Arkansas law threatening librarians with jail unconstitutional",
    "upvote_ratio": 0.98,
    "ups": 186,
    "created": 1735283448.0,
    "created_utc": 1735283448.0,
    "num_comments": 3,
    "author": "onnake",
    "id": "1hn9goi",
    "created_datetime": "2024-12-27 07:10:48"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_a2ced",
    "title": "Grieving relatives of trans woman found dead in LA cast doubt on police findings",
    "upvote_ratio": 0.96,
    "ups": 178,
    "created": 1735378884.0,
    "created_utc": 1735378884.0,
    "num_comments": 12,
    "author": "jackmolay",
    "id": "1ho2fq6",
    "created_datetime": "2024-12-28 09:41:24"
  },
  {
    "subreddit": "transgender",
    "selftext": "",
    "author_fullname": "t2_mg9rgmp2n",
    "title": "From Bathrooms to Backpedaling: Trump’s Trans Gaslighting",
    "upvote_ratio": 0.98,
    "ups": 177,
    "created": 1734084567.0,
    "created_utc": 1734084567.0,
    "num_comments": 15,
    "author": "ohbricki",
    "id": "1hd958y",
    "created_datetime": "2024-12-13 10:09:27"
  }
]